#Область СлужебныйПрограммныйИнтерфейс
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	// ++ Локализация

	#Область ВоенныйБилет
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВоенныйБилет";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Военный билет'",
		КодыЯзыков); 
	#КонецОбласти

	#Область ВоенныйБилетОфицераЗапаса
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВоенныйБилетОфицераЗапаса";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Военный билет офицера запаса'",
		КодыЯзыков); 
	#КонецОбласти

	#Область ДипломатическийПаспорт
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДипломатическийПаспорт";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
	 "ru = 'Дипломатический паспорт гражданина РФ';",
		КодыЯзыков);
	#КонецОбласти 

	#Область ЗагранпаспортРФ
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗагранпаспортРФ";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Загранпаспорт гражданина РФ'",
		КодыЯзыков); 
	#КонецОбласти

	#Область ЗагранпаспортСССР
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗагранпаспортСССР";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Загранпаспорт гражданина СССР'",
		КодыЯзыков); 
	#КонецОбласти

	#Область ПаспортРФ
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПаспортРФ";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Паспорт гражданина РФ'",
		КодыЯзыков); 
	#КонецОбласти

	#Область ПаспортСССР
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПаспортСССР";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Паспорт гражданина СССР'",
		КодыЯзыков); 
	#КонецОбласти

	#Область ПаспортМинморфлота
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПаспортМинморфлота";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Паспорт Минморфлота'",
		КодыЯзыков);
	#КонецОбласти

	#Область ПаспортМоряка
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПаспортМоряка";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Паспорт моряка'",
		КодыЯзыков); 
	#КонецОбласти

	#Область СвидетельствоОРождении
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СвидетельствоОРождении";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Свидетельство о рождении'",
		КодыЯзыков); 
	#КонецОбласти

	#Область УдостоверениеОфицера
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УдостоверениеОфицера";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
		"ru = 'Удостоверение личности офицера'",
			КодыЯзыков); 
	#КонецОбласти
	
	// -- Локализация

КонецПроцедуры

#КонецОбласти