#Область ОбработчикиКомандФормы  

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьДействие(Команда)
	
	Если БольшеНеПоказывать Тогда
		
		Если БольшеНеПоказывать = Истина Тогда
			
			ПоказыватьПредупреждениеОбОтветственностиПриОтправке = Не БольшеНеПоказывать;
			ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("НастройкиПрограммы", 
				"ПоказыватьПредупреждениеОбОтветственностиПриОтправке", 
					ПоказыватьПредупреждениеОбОтветственностиПриОтправке,,, Истина);
					
		КонецЕсли;
		
	КонецЕсли;
	
	Закрыть(КодВозвратаДиалога.Да); 
	
КонецПроцедуры  

#КонецОбласти
