#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Записать данные.
// 
// Параметры:
//  СоответствиеВидовДокументов - ТаблицаЗначений
Процедура ЗаписатьДанные(СоответствиеВидовДокументов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Набор = СоздатьНаборЗаписей();
	Набор.Загрузить(СоответствиеВидовДокументов);
	Набор.Записать(Истина);
	
КонецПроцедуры

// Соответствие видов распознаваемых документов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Соответствие видов распознаваемых документов:
//   * ТипФормализованногоДокумента - ПеречислениеСсылка.ТипыФормализованныхДокументов
//   * ВидДокумента - СправочникСсылка.ВидыДокументов
//   * Тематика - СправочникСсылка.ТематикиДокументов
//   * Шаблон - СправочникСсылка.ШаблоныДокументов
Функция СоответствиеВидовРаспознаваемыхДокументов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СоответствиеВидовРаспознаваемыхДокументов.ТипФормализованногоДокумента КАК ТипФормализованногоДокумента,
	|	СоответствиеВидовРаспознаваемыхДокументов.ВидДокумента КАК ВидДокумента,
	|	СоответствиеВидовРаспознаваемыхДокументов.Тематика КАК Тематика,
	|	СоответствиеВидовРаспознаваемыхДокументов.Шаблон КАК Шаблон
	|ИЗ
	|	РегистрСведений.СоответствиеВидовРаспознаваемыхДокументов КАК СоответствиеВидовРаспознаваемыхДокументов");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
#КонецОбласти

#КонецЕсли