
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьДанныеСертификатовДляЭДО(Форма, ОбработчикЗавершения = Неопределено) Экспорт
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("Форма", Форма);
	ПараметрыОбработчика.Вставить("ОбработчикЗавершения", ОбработчикЗавершения);
	
	ОбработчикПолученияОтпечатков = Новый ОписаниеОповещения("ЗаполнитьДанныеСертификатовДляЭДОПродолжение",
		ЭтотОбъект, ПараметрыОбработчика);
	
	ЭлектроннаяПодписьКлиент.ПолучитьОтпечаткиСертификатов(ОбработчикПолученияОтпечатков, Истина, Ложь);
	
КонецПроцедуры

Процедура ПроверитьНаличиеСертификатовЭДО(Форма, ОбработчикЗавершения = Неопределено, СообщатьОбОшибке = Истина) Экспорт
	
	Форма.ЕстьЭДО();
	
	Контекст = Новый Структура;
	Контекст.Вставить("Форма", Форма);
	Контекст.Вставить("ОбработчикЗавершения", ОбработчикЗавершения);
	Контекст.Вставить("СообщатьОбОшибке", СообщатьОбОшибке);
	
	ОбработчикПродолжения = Новый ОписаниеОповещения(
		"ПроверитьНаличиеСертификатовЭДОПослеОбновленияСертификатов", ЭтотОбъект, Контекст);
	
	ЗаполнитьДанныеСертификатовДляЭДО(Форма, ОбработчикПродолжения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДанныеСертификатовДляЭДОПродолжение(Отпечатки, Параметры) Экспорт
	
	Форма = Параметры.Форма;
	
	Для Каждого Строка Из Форма.СертификатыДляЭДО Цикл
		Строка.ДоступенНаКлиенте = Ложь;
	КонецЦикла;
	
	Если ТипЗнч(Отпечатки) = Тип("Соответствие") Тогда
		Для Каждого Элемент Из Отпечатки Цикл
			
			Отпечаток = Элемент.Ключ;
			
			ОтборСертификата = Новый Структура("Отпечаток", Отпечаток);
			СтрокиСуществующие = Форма.СертификатыДляЭДО.НайтиСтроки(ОтборСертификата);
			
			Если СтрокиСуществующие.Количество() = 0 Тогда
				
				НоваяСтрока = Форма.СертификатыДляЭДО.Добавить();
				НоваяСтрока.Отпечаток = Отпечаток;
				НоваяСтрока.ДоступенНаКлиенте = Истина;
				
			Иначе
				
				Для Каждого СтрокаСуществующая Из СтрокиСуществующие Цикл
					СтрокаСуществующая.ДоступенНаКлиенте = Истина;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла
	КонецЕсли;
	
	Если Параметры.ОбработчикЗавершения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Параметры.ОбработчикЗавершения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаличиеСертификатовЭДОПослеОбновленияСертификатов(Результат, Контекст) Экспорт
	
	Форма = Контекст.Форма;
	
	ДоступныеДляЭДООтпечатки = Новый Массив;
	
	Для Каждого СтрокаСертификата Из Форма.СертификатыДляЭДО Цикл
		Если СтрокаСертификата.ДоступенДляЭДО
			И (СтрокаСертификата.ДоступенНаКлиенте Или СтрокаСертификата.ДоступенНаСервере) Тогда
			
			ДоступныеДляЭДООтпечатки.Добавить(СтрокаСертификата.Отпечаток);
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступныеДляЭДООтпечатки.Количество() = 0 И Контекст.СообщатьОбОшибке Тогда
		ПоказатьПредупреждение(, 
			НСтр("ru = 'Невозможно выполнить действие по ЭДО, поскольку не обнаружено сертификатов электронной подписи
			|по которым разрешен обмен ЭДО. Проверьте наличие сертификата в хранилище личных сертификатов пользователя и
			|разрешенные к обмену сертификаты в настройках учетной записи ЭДО.'"));
		Возврат;
	КонецЕсли;
	
	СертификатыПоОтпечаткам =
		ОбменСКонтрагентамиДОВызовСервера.СертификатыПользователяПоОтпечаткам(ДоступныеДляЭДООтпечатки);
	
	Если СертификатыПоОтпечаткам.Количество() = 0 И Контекст.СообщатьОбОшибке Тогда
		ПоказатьПредупреждение(, 
			НСтр("ru = 'Невозможно выполнить действие по ЭДО, поскольку сертификаты для ЭДО недоступны пользователю 1С.
			|Укажите в карточке сертификата пользователя, либо выполните вход под пользователем, которому принадлежат сертификаты.'"));
		Возврат;
	КонецЕсли;
	
	ДоступныеСертификаты = Новый Соответствие;
	
	Для Каждого СтрокаСертификата Из Форма.СертификатыДляЭДО Цикл
		
		Если Не СтрокаСертификата.ДоступенДляЭДО
			Или (Не СтрокаСертификата.ДоступенНаКлиенте
				И Не СтрокаСертификата.ДоступенНаСервере) Тогда
			
			Продолжить;
		КонецЕсли;
		
		СсылкаНаСертификат = СертификатыПоОтпечаткам[СтрокаСертификата.Отпечаток];
		
		Если ЗначениеЗаполнено(СсылкаНаСертификат) Тогда
		
			ПараметрыСертификата = Новый Структура;
			ПараметрыСертификата.Вставить("Доверенность", СтрокаСертификата.Доверенность);
			
			ДоступныеСертификаты.Вставить(СсылкаНаСертификат, ПараметрыСертификата);
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если Контекст.ОбработчикЗавершения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОбработчикЗавершения, ДоступныеСертификаты);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
