
&НаСервере
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;    
		

	 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
		               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Ссылка,
		               |	РесурсныеСпецификацииМатериалыИУслуги.АлгоритмРасчетаКоличества КАК АлгоритмРасчетаКоличества
		               |ИЗ
		               |	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
		               |ГДЕ
		               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)";
				
		//Запрос.УстановитьПараметр("АлгоритмРасчетаКоличества", "");
		
		Результат = Запрос.Выполнить();
		
		ТаблицаМелкихМатериалов = Новый ТаблицаЗначений;
		ТаблицаМелкихМатериалов.Колонки.Добавить("Номенклатура");
		ТаблицаМелкихМатериалов.Колонки.Добавить("Ссылка");	
		
		Выборка = Результат.Выбрать(); 
		Пока Выборка.Следующий() Цикл   
			Попытка 
				АлгоритмРасчетаКоличества = Выборка.АлгоритмРасчетаКоличества; 
				Если АлгоритмРасчетаКоличества <> "" Тогда 
						НоваяСтрока = ТаблицаМелкихМатериалов.Добавить();        
						НоваяСтрока.Номенклатура = Выборка.Номенклатура;
						НоваяСтрока.Ссылка = Выборка.Ссылка; 
				КонецЕсли;
			Исключение   
			 	Сообщить(Выборка.Ссылка); 
				Сообщить(Выборка.Номенклатура); 				
			КонецПопытки;	
		КонецЦикла;
			
			//ТаблицаМелкихМатериалов = ТаблицаМелкихМатериалов();
			
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("ТаблицаМелкихМатериалов", ТаблицаМелкихМатериалов);
		
		Настройки = КомпоновщикНастроек.Настройки;
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	

КонецПроцедуры   

&НаСервере
Функция ТаблицаМелкихМатериалов()

    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
                   |	РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок КАК КоличествоУпаковок,
                   |	РесурсныеСпецификацииМатериалыИУслуги.Упаковка КАК Упаковка,
                   |	ВЫБОР
                   |		КОГДА РесурсныеСпецификации.МинимальнаяПартияВыпуска = 0
                   |			ТОГДА 1
                   |		ИНАЧЕ РесурсныеСпецификации.МинимальнаяПартияВыпуска
                   |	КОНЕЦ КАК МинимальнаяПартияВыпуска,
                   |	ВЫБОР
                   |		КОГДА РесурсныеСпецификацииМатериалыИУслуги.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
                   |			ТОГДА 1
                   |		КОГДА РесурсныеСпецификацииМатериалыИУслуги.Упаковка = РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
                   |			ТОГДА 1
                   |		ИНАЧЕ &ТекстЗапросаКоэффициентУпаковки
                   |	КОНЕЦ КАК КоэффициентУпаковкиКБазовойЕдиницеИзмерения,
                   |	РесурсныеСпецификации.ОсновноеИзделиеКоличествоУпаковок КАК ОсновноеИзделиеКоличествоУпаковок
                   |ИЗ
                   |	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
                   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
                   |		ПО РесурсныеСпецификацииМатериалыИУслуги.Ссылка = РесурсныеСпецификации.Ссылка";

    Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
        Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
        "РесурсныеСпецификацииМатериалыИУслуги.Упаковка",
        "РесурсныеСпецификацииМатериалыИУслуги.Номенклатура"));


    Результат = Запрос.Выполнить();
	
    ТаблицаМелкихМатериалов = Новый ТаблицаЗначений;
	ТаблицаМелкихМатериалов.Колонки.Добавить("Номенклатура");
	ТаблицаМелкихМатериалов.Колонки.Добавить("ЕдиницаИзмерения");
	
	Выборка = Результат.Выбрать(); 
	Пока Выборка.Следующий() Цикл   
		КоличествоНаПартиюЗапуска = (Выборка.КоличествоУпаковок * Выборка.МинимальнаяПартияВыпуска) / (Выборка.ОсновноеИзделиеКоличествоУпаковок * Выборка.КоэффициентУпаковкиКБазовойЕдиницеИзмерения);
		Если (0 < КоличествоНаПартиюЗапуска) И  (КоличествоНаПартиюЗапуска < 0.001) Тогда
			НоваяСтрока = ТаблицаМелкихМатериалов.Добавить();        
			НоваяСтрока.Номенклатура = Выборка.Номенклатура;
			НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;  
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаМелкихМатериалов;      
	

КонецФункции