#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записать данные.
// 
// Параметры:
//  Файл - СправочникСсылка.ВерсииФайлов 
//  РаспознанныеДанные - ТаблицаЗначений
//  НеЗаписыватьНеРаспознанные - Булево
Процедура ЗаписатьДанные(Файл, РаспознанныеДанные, НеЗаписыватьНеРаспознанные = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Файл.Установить(Файл);
	
	Для Каждого Данные Из РаспознанныеДанные Цикл
		
		Если НеЗаписыватьНеРаспознанные Тогда
			Если ПустаяСтрока(Данные.РаспознанныйТекст) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Данные);
		НоваяЗапись.Файл = Файл;
		НоваяЗапись.ИмяРаспознанногоРеквизита = Данные.ИмяРеквизита;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли