#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	НаборПартииЗапуска = СхемаКомпоновкиДанных.НаборыДанных.ПартииЗапуска;

	УправлениеПроизводством.ПодстановкаАктуальногоРегистраГрафика(НаборПартииЗапуска.Запрос);

	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстЗапланировано", НСтр("ru = 'Запланировано';
																									|en = 'Scheduled'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстЗапущено", НСтр("ru = 'Запущено';
																								|en = 'Started'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстБезСпецификации", НСтр("ru = '<Без спецификации>';
																										|en = '<Without bill of materials>'"));
КонецПроцедуры

#КонецОбласти

#КонецЕсли