&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	СообщениеПользователю												= Параметры.СообщениеПользователю;      
    // получаем имя текущего пользователя
    Имя = ИмяПользователя();
    // формируем текст
    Текст = Имя + Символы.ПС + ": " + Параметры.СообщениеПользователю;
	Если СтрНайти(Текст, "не удалось") > 0 Тогда
    	Расш1_ОбщийМодуль1.ОтправитьВTelegram(Текст);
	КонецЕсли;	
	//Расш1_ОбщийМодуль1.ОтправитьВTelegram(СообщениеПользователю);
КонецПроцедуры
&НаКлиенте
Процедура ЗакрытьОкно(Команда)
	Закрыть();
КонецПроцедуры

