
////&ИзменениеИКонтроль("ПечатьПередачаМатериаловВПроизводство")
//Функция Расш1_ПечатьПередачаМатериаловВПроизводство(МассивОбъектов, ОбъектыПечати)
//	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов();
//	ДопКолонка = КолонкаКодов.ИмяКолонки;
//	ПредставлениеКолонкиКодов = КолонкаКодов.ПредставлениеКолонки;
//	ВыводитьДопКолонку = ЗначениеЗаполнено(ДопКолонка);

//	ЗапросПоДокументам = Новый Запрос;
//	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	ЗапросПоДокументам.Текст =
//	"ВЫБРАТЬ
//	|	Документ.Ссылка                             КАК Ссылка,
//	|	Документ.Номер                              КАК Номер,
//	|	Документ.Дата                               КАК Дата,
//	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Склад)         КАК Склад,
//	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Подразделение)	КАК Подразделение,
//	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Организация)   КАК Организация,
//	|	Документ.Организация.Префикс                КАК Префикс
//	|ИЗ
//	|	Документ.ПередачаМатериаловВПроизводство КАК Документ
//	|ГДЕ
//	|	Документ.Ссылка В(&МассивОбъектов)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Дата, Ссылка
//	|;
//	|ВЫБРАТЬ
//	|	ТаблицаТовары.Ссылка КАК Ссылка,
//	|	МИНИМУМ(ТаблицаТовары.НомерСтроки) КАК НомерСтроки,
//	|	" + ?(ВыводитьДопКолонку, "ТаблицаТовары.Номенклатура." + ДопКолонка + " КАК ДопКолонка,", "") + "
//	|	ТаблицаТовары.Номенклатура.НаименованиеПолное     КАК Номенклатура,
//	|	ТаблицаТовары.Характеристика.НаименованиеПолное   КАК Характеристика,
//	|	ВЫБОР
//	|		КОГДА ТаблицаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
//	|			ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения)
//	|		ИНАЧЕ 
//	|			ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Упаковка)
//	|	КОНЕЦ              КАК Упаковка,
//	|	СУММА(ТаблицаТовары.КоличествоУпаковок) КАК Количество
//	|ИЗ
//	|	Документ.ПередачаМатериаловВПроизводство.Товары КАК ТаблицаТовары
//	|ГДЕ
//	|	ТаблицаТовары.Ссылка В(&МассивОбъектов)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаТовары.Ссылка,
//	|	ТаблицаТовары.Номенклатура,
//	|	ТаблицаТовары.Характеристика,
//	|	ВЫБОР
//	|		КОГДА ТаблицаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
//	|			ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения)
//	|		ИНАЧЕ 
//	|			ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Упаковка)
//	|	КОНЕЦ
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	НомерСтроки";

//	ТабДокумент = Новый ТабличныйДокумент;
//	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПередачаМатериаловВПроизводство";

//	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
//	СинонимДокумента = Метаданные.Документы.ПередачаМатериаловВПроизводство.Синоним;

//	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПередачаМатериаловВПроизводство.ПФ_MXL_ПередачаМатериаловВПроизводство"); 
//	#Удаление
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПередачаМатериаловВПроизводство.ПФ_MXL_ПередачаМатериаловВПроизводство");
//	#КонецУдаления  
//	#Вставка      
//	//Сообщить("+++ тут вставка");
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПередачаМатериаловВПроизводство.Расш1_ПередачаМатериалов");
//	#КонецВставки	
//	
//	
//	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
//	ОбластьПодписи   = Макет.ПолучитьОбласть("Подписи");
//	Если ВыводитьДопКолонку Тогда
//		ОбластьСтрока       = Макет.ПолучитьОбласть("СтрокаДопКолонка");
//		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыДопКолонка");
//	Иначе
//		ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
//		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
//	КонецЕсли;

//	ПервыйДокумент = Истина;
//	Результат = ЗапросПоДокументам.ВыполнитьПакет();

//	ВыборкаДокументы = Результат[0].Выбрать();
//	ВыборкаСтроки = Результат[1].Выбрать();
//	ВыборкаСтроки.Сбросить();

//	Пока ВыборкаДокументы.Следующий() Цикл

//		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

//		Если Не ПервыйДокумент Тогда
//			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//		КонецЕсли;
//		ПервыйДокумент = Ложь;

//		// Вывод заголовка.
//		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаДокументы);
//		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, СинонимДокумента);
//		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументы);
//		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДокумент, Макет, ОбластьЗаголовок, ВыборкаДокументы.Ссылка);
//		ТабДокумент.Вывести(ОбластьЗаголовок);

//		// Вывод шапки.
//		Если ВыводитьДопКолонку Тогда
//			ОбластьШапкаТаблицы.Параметры.ДопКолонка = ПредставлениеКолонкиКодов;
//		КонецЕсли;
//		ТабДокумент.Вывести(ОбластьШапкаТаблицы);

//		// Вывод строк документа.
//		Пока ВыборкаСтроки.НайтиСледующий(ВыборкаДокументы.Ссылка, "Ссылка") Цикл

//			ДопПараметрыПредставлениеНоменклатуры = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
//			ДопПараметрыПредставлениеНоменклатуры.КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();

//			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);

//			ОбластьСтрока.Параметры.Номенклатура = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
//			ВыборкаСтроки.Номенклатура,
//			ВыборкаСтроки.Характеристика,
//			,
//			,
//			ДопПараметрыПредставлениеНоменклатуры);
//	//*********		
//				#Вставка  
//				Запр = Новый Запрос(
//				"ВЫБРАТЬ
//				|	РегистрРазм.Ячейка КАК Ячейка
//				|ИЗ
//				|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РегистрРазм
//				|ГДЕ
//				|	РегистрРазм.Номенклатура = &Ном");
//				Запр.УстановитьПараметр("Ном", ВыборкаСтроки.Товар);
//				Таб         = Запр.Выполнить().Выгрузить();
//				МассивЯчеек = Таб.ВыгрузитьКолонку("Ячейка");
//				//ПараметрыСтроки.Ячейка = СокрЛП(СтрСоединить(МассивЯчеек,", "));
//				ОбластьСтрока.Параметры.Ячейка = СокрЛП(СтрСоединить(МассивЯчеек,", ")); 
//				
//				врЗапросОстатков = Новый Запрос("ВЫБРАТЬ
//				                                |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
//				                                |ИЗ
//				                                |	РегистрНакопления.ТоварыНаСкладах.Остатки(
//				                                |			&ДатаКон,
//				                                |			Склад = &Склад
//				                                |				И Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки");
//				
//				врЗапросОстатков.УстановитьПараметр("ДатаКон", ТекущаяДата()); 
//				ДокОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
//				СкладДляОстатков = ДокОбъект.СкладОтправитель;
//				врЗапросОстатков.УстановитьПараметр("Склад", СкладДляОстатков);
//				врЗапросОстатков.УстановитьПараметр("Номенклатура", ВыборкаСтроки.Товар); 
//				Результат = врЗапросОстатков.Выполнить();
//				Выборка = Результат.Выбрать();
//				Если Выборка.Следующий() Тогда 
//					ВНаличииОстаток = Выборка.ВНаличииОстаток;		
//				КонецЕсли;
//				ОбластьСтрока.Параметры.Остаток = ВНаличииОстаток;
//				#КонецВставки
//			
//			
//	//*********			
//			ТабДокумент.Вывести(ОбластьСтрока);

//		КонецЦикла;

//		// Вывод подвала.
//		ТабДокумент.Вывести(ОбластьПодписи);

//		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);

//	КонецЦикла;

//	Возврат ТабДокумент;

//КонецФункции
