////////////////////////////////////////////////////////////////////////////////
// Управление контактной информацией Документооборот
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура обновления ИБ для справочника видов контактной информации.
Процедура КонтактнаяИнформацияОбновлениеИБ() Экспорт
	
	// Справочник "Организации"
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.ХранитьИсториюИзменений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 3;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
		
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФаксОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 4;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 5;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 6;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Другое");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 7;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// Справочник "Контактные лица"
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 2;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 3;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// Справочник "Контрагенты"
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 2;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 3;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 4;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 5;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
		
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 6;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
		
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(
		Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.СайтКонтрагента;
	ПараметрыВида.Порядок = 7;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
		
	// Справочник "Физические лица"
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ДомашнийАдресФизическогоЛица;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ДомашнийТелефонФизическогоЛица;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 2;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 3;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 4;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 4;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// Справочник "Личные адресаты"
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailАдресата;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.РабочийТелефонАдресата;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 2;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФаксАдресата;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 3;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресАдресата;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 4;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// Справочник "РолиИсполнителей"
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailРоли;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге = Ложь;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// Справочник "Сотрудники"
	Справочники.Сотрудники.ОбновитьВидыКонтактнойИнформации();
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
//
// Параметры:
//  КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//  Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//  ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииВидовКонтактнойИнформации(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда
		МодульМультиязычностьСервер = ОбщегоНазначения.ОбщийМодуль("МультиязычностьСервер");
		
	// Контактная информация справочника "Контактные лица"
		Элемент = Элементы.Добавить(); 
		Элемент.ИмяПредопределенныхДанных = "СправочникКонтактныеЛица";
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Контактная информация справочника ""Контактные лица""'", КодыЯзыков); // @НСтр-2
	
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "МобильныйТелефонКонтактногоЛица";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Мобильный телефон'", КодыЯзыков); // @НСтр-2
	
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "EmailКонтактногоЛица";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Email'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ТелефонКонтактногоЛица";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Рабочий телефон'", КодыЯзыков); // @НСтр-2

	// Контактная информация справочника "Контрагенты"
		Элемент = Элементы.Добавить(); 
		Элемент.ИмяПредопределенныхДанных = "СправочникКонтрагенты";	
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = ' Контактная информация справочника ""Контрагенты""'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "EmailКонтрагента";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Email'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ПочтовыйАдресКонтрагента";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Почтовый адрес'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "СайтКонтрагента";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Сайт'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ТелефонКонтрагента";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Телефон'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ФаксКонтрагента";      
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Факс'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ФактическийАдресКонтрагента";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Фактический адрес'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ЮридическийАдресКонтрагента";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Юридический адрес'", КодыЯзыков); // @НСтр-2

	// Контактная информация справочника "Личные адресаты"
		Элемент = Элементы.Добавить(); 
		Элемент.ИмяПредопределенныхДанных = "СправочникЛичныеАдресаты";	
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = ' Контактная информация справочника ""Личные адресаты""'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "EmailАдресата"; 
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Email'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ПочтовыйАдресАдресата";              
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Почтовый адрес'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "РабочийТелефонАдресата";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Рабочий телефон'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ФаксАдресата";         
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Факс'", КодыЯзыков); // @НСтр-2

	// Контактная информация справочника "Организации"
		Элемент = Элементы.Добавить(); 
		Элемент.ИмяПредопределенныхДанных = "СправочникОрганизации";
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = ' Контактная информация справочника ""Организации""'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "EmailОрганизации";   
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Email'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ДругаяИнформацияОрганизации";  
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Другое'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ПочтовыйАдресОрганизации";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Почтовый адрес'", КодыЯзыков); // @НСтр-2
			
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ТелефонОрганизации"; 
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Телефон'", КодыЯзыков); // @НСтр-2	

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ФаксОрганизации";    
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Факс'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ФактАдресОрганизации";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Фактический адрес'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ЮрАдресОрганизации"; 
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Юридический адрес'", КодыЯзыков); // @НСтр-2

	// Контактная информация справочника "Пользователи"
		Элемент = Элементы.Добавить(); 
		Элемент.ИмяПредопределенныхДанных = "СправочникПользователи";
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = ' Контактная информация справочника ""Пользователи""'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "EmailПользователя";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Email'", КодыЯзыков); // @НСтр-2
			
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ТелефонПользователя";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Телефон'", КодыЯзыков); // @НСтр-2

	// Контактная информация справочника "Пользователи"
		Элемент = Элементы.Добавить(); 
		Элемент.ИмяПредопределенныхДанных = "СправочникРолиИсполнителей";
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = ' Контактная информация справочника ""Роли исполнителей""'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "EmailРоли"; 
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Email'", КодыЯзыков); // @НСтр-2

	// Контактная информация справочника "Сотрудники"
		Элемент = Элементы.Добавить(); 
		Элемент.ИмяПредопределенныхДанных = "СправочникРолиИсполнителей";
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = ' Контактная информация справочника ""Сотрудники""'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "EmailСотрудника";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Email'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "SkypeСотрудника";    
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Skype;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Skype'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ТелефонСотрудника";   
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Телефон'", КодыЯзыков); // @НСтр-2

	// Контактная информация справочника "Физические лица"
		Элемент = Элементы.Добавить(); 
		Элемент.ИмяПредопределенныхДанных = "СправочникФизическиеЛица";
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = ' Контактная информация справочника ""Физические лица""'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "EmailФизическогоЛица"; 
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Email'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ДомашнийАдресФизическогоЛица"; 
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Домашний адрес'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ДомашнийТелефонФизическогоЛица"; 
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Домашний телефон'", КодыЯзыков); // @НСтр-2

		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "МобильныйТелефонФизическогоЛица"; 
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru = 'Мобильный телефон'", КодыЯзыков); // @НСтр-2

	КонецЕсли;

КонецПроцедуры

// Возвращает представление контактной информации (адреса, телефона, электронной почты и т.п.).
//
// Параметры:
//  СсылкаИлиОбъект - ОпределяемыйТип.ВладелецКонтактнойИнформации.
//  ВидИлиТипКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации.
//
// Возвращаемое значение:
//  Строка - представление контактной информации.
//
Функция ПредставлениеКонтактнойИнформации(Ссылка, ВидКонтактнойИнформации) Экспорт
	
	Объект = Ссылка.ПолучитьОбъект();
	
	ПредставлениеКонтактнойИнформации =
		УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Объект,
			ВидКонтактнойИнформации);
	
	Возврат ПредставлениеКонтактнойИнформации;
	
КонецФункции

#КонецОбласти