// @strict-types


#Область ПрограммныйИнтерфейс

// Вызывается из ДействияПриЗаписи Общего модуля ДействияСервер
// 
// Параметры:
// 	Объект - ОпределяемыйТип.ДействияОбъект - записываемый объект.
// 	ДополнительныеСвойства - Структура - содержащая дополнительные свойства записи.
// 	ФункцияУчастника - ОпределяемыйТип.ФункцииУчастниковДействий - функция участника. 
//
Процедура ДействияПриЗаписи(Объект, ДополнительныеСвойства, ФункцияУчастника = Неопределено) Экспорт

// Локализация	
	РаботаСВнешнимПодписанием.ДействияПриЗаписи(Объект, ДополнительныеСвойства, ФункцияУчастника);
// Локализация Конец	

КонецПроцедуры	

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из ОтметитьНачалоВыполнения Общего модуля ДействияСервер
// 
// Параметры:
// 	Действие - ОпределяемыйТип.Действия
// 			 - ОпределяемыйТип.ДействияОбъект
// 	Параметры - Структура - данных участника.
//
Процедура ОтметитьНачалоВыполнения(Действие, Параметры) Экспорт

// Локализация
	РаботаСВнешнимПодписанием.ПриОтметкеНачалаВыполненияДействия(Действие, Параметры);
// Локализация Конец		

КонецПроцедуры	

// Вызывается из ПоместитьДействиеВИсторию Общего модуля ДействияСервер
//
// Параметры:
//  Действие - ОпределяемыйТип.Действия - ссылка на действие.
//
Процедура ПоместитьДействиеВИсторию(Действие) Экспорт

// Локализация
	РаботаСВнешнимПодписанием.ПриПомещенииДействияВИсторию(Действие);  
// Локализация Конец

КонецПроцедуры	

// Вызывается из ОтметитьВыполнение Общего модуля ДействияСервер
//
// Параметры:
//  Действие - ОпределяемыйТип.Действия
//  		 - ОпределяемыйТип.ДействияОбъект
//  Параметры - Структура
//
Процедура ОтметитьВыполнение(Действие, Параметры) Экспорт 

// Локализация	
	РаботаСВнешнимПодписанием.ПриОтметкеВыполненияДействия(Действие, Параметры);
// Локализация Конец	

КонецПроцедуры

// Вызывается из ПрерватьВыполнениеДействия Общего модуля ДействияСервер
//
// Параметры:
//  Действие - ОпределяемыйТип.Действия.
//
Процедура ПрерватьВыполнениеДействия(Действие) Экспорт

// Локализация	
	РаботаСВнешнимПодписанием.ПриПрерыванииВыполненияДействия(Действие);
// Локализация Конец
	
КонецПроцедуры	
	
#КонецОбласти