#Область ПрограммныйИнтерфейс

// См.Справочники.ФактическиеИсполнители.ПредставлениеФактическогоИсполнителя
Функция ПредставлениеПлановогоИсполнителяДляФактического(Данные, Расширенное) Экспорт
	
	РеквизитыПлана = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Данные.План, "Владелец");
	
	// ++ Локализация
	ПлановыйСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(
		Строка(РеквизитыПлана.Владелец), 4, РеквизитыПлана.Владелец);
	Латиница = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz";
	Кириллица = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЫЪЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщыъьэюя";// АПК:1036 проверка
		// орфографии не требуется.
	ДопустимыеСимволы = Латиница + Кириллица + " ";
	ПредставлениеДопускаетСокращение = РаботаСЗадачами.СтрокаСодержитТолькоДопустимыеСимволы(
		ПлановыйСклонение, ДопустимыеСимволы);
	Если Не Расширенное И ПредставлениеДопускаетСокращение Тогда
		ПредставлениеПлан = ФизическиеЛица.ФамилияИнициалыФизЛица(ПлановыйСклонение);
	Иначе
		ПредставлениеПлан = ПлановыйСклонение;
	КонецЕсли;
	Возврат ПредставлениеПлан;

	// -- Локализация
	Возврат РеквизитыПлана.Владелец;
	
КонецФункции

#КонецОбласти