#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка = Справочники.СтавкиНДС.БезНДС Тогда
		Возврат;
	КонецЕсли;
	
	НайденнаяСтавкаНДС = УчетНДС.СтавкаНДСИзЧисла(Ставка, РасчетнаяСтавка);
	
	Если ЗначениеЗаполнено(НайденнаяСтавкаНДС) И НайденнаяСтавкаНДС <> Ссылка Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Ставка НДС с таким числовым коэффициентом уже существует.'"),
			ЭтотОбъект,
			"Ставка",,
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Локализация
	Если Ссылка <> Справочники.СтавкиНДС.БезНДС Тогда
		Страна = Справочники.СтраныМира.Россия;
	КонецЕсли;
	// Локализация Конец
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
