
#Область СлужебныйПрограммныйИнтерфейс

// Формирует имя ключевой операции "АдреснаяКнигаОткрытиеАдреснойКниги".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияОткрытиеАдреснойКниги() Экспорт
	
	КлючеваяОперация = "АдреснаяКнигаОткрытиеАдреснойКниги";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "АдреснаяКнигаПоиск".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияАдреснаяКнигаПоиск() Экспорт
	
	КлючеваяОперация = "АдреснаяКнигаПоиск";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "АдреснаяКнигаЗавершениеВыбораИзАдреснойКниги".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияАдреснаяКнигаЗавершениеВыбораИзАдреснойКниги() Экспорт
	
	КлючеваяОперация = "АдреснаяКнигаЗавершениеВыбораИзАдреснойКниги";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "АдреснаяКнигаДобавлениеЭлементаКПодборуДо100Элементов".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияАдреснаяКнигаДобавлениеЭлементаКПодборуДо100Элементов() Экспорт
	
	КлючеваяОперация = "АдреснаяКнигаДобавлениеЭлементаКПодборуДо100Элементов";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "АдреснаяКнигаДобавлениеЭлементаКПодборуДо1000Элементов".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияАдреснаяКнигаДобавлениеЭлементаКПодборуДо1000Элементов() Экспорт
	
	КлючеваяОперация = "АдреснаяКнигаДобавлениеЭлементаКПодборуДо1000Элементов";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "АдреснаяКнигаДобавлениеЭлементаКПодборуБолее1000Элементов".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияАдреснаяКнигаДобавлениеЭлементаКПодборуБолее1000Элементов() Экспорт
	
	КлючеваяОперация = "АдреснаяКнигаДобавлениеЭлементаКПодборуБолее1000Элементов";
	
	Возврат КлючеваяОперация;
	
КонецФункции

#КонецОбласти
