////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными"
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// Возвращает массив всех узлов для заданного плана обмена кроме предопределенного узла.
//
// Параметры:
//  ИмяПланаОбмена - Строка - имя плана обмена как оно задано в конфигураторе.
// 
// Возвращаемое значение:
//  Массив из ПланОбменаСсылка
//   * ПланОбмена.Ссылка
//
Функция УзлыПланаОбмена(ИмяПланаОбмена) Экспорт
	
	Возврат ОбменДаннымиПовтИсп.УзлыПланаОбмена(ИмяПланаОбмена);
	
КонецФункции
#КонецЕсли

// Используется в редакции Докуменнтооборот Холдинга
// Проверяет, является ли этот узел центральным узлом КОД.
//
// Возвращаемое значение:
//	Булево - Истина - если текущий узел является главным узлом или используется редакция с одним узлом (КОРП).
//
Функция ЭтоЦентральныйУзелКОД() Экспорт

	ЭтоЦентральныйУзелКОД = Истина;

	
	Возврат ЭтоЦентральныйУзелКОД;
	
КонецФункции

// Используется в редакции Докуменнтооборот Холдинга
// Проверяет, является ли этот узел центральным.
//
// Возвращаемое значение:
//	Булево - Истина - если текущий узел является главным узлом Холдинга или используется редакция с одним узлом (КОРП).
//
Функция ЭтоЦентральныйУзел() Экспорт

	ЭтоЦентральныйУзел = Истина;

	
	Возврат ЭтоЦентральныйУзел;
	
КонецФункции

// Используется в редакции Докуменнтооборот Холдинга
// Проверяет, является ли этот узел подчиненный.
//
// Возвращаемое значение:
//	Булево - Истина - если текущий узел является подчиненным узлом Холдинга или - Ложь - если используется редакция 
//  с одним узлом (КОРП).
Функция ЭтоПодчиненныйУзел() Экспорт

	ЭтоПодчиненныйУзел = Ложь;

	
	Возврат ЭтоПодчиненныйУзел;

КонецФункции

// Используется в редакции Докуменнтооборот Холдинга
// Возвращает идентификатор текущего узла.
//
// Возвращаемое значение:
//	УникальныйИдентификатор
//
Функция ИдентификаторТекущегоУзла() Экспорт

	ИдентификаторТекущегоУзла = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	
	
	Возврат ИдентификаторТекущегоУзла;
	
КонецФункции

// Используется в редакции Докуменнтооборот Холдинга
// Возвращаемое значение:
//	Строка - Код текущего узла справочника УзлыКОД
Функция КодТекущегоУзла() Экспорт

	КодТекущегоУзла = "";

	
	Возврат КодТекущегоУзла;
	
КонецФункции	

// Используется в редакции Докуменнтооборот Холдинга
// Возвращает Истина, если текущая конфигурация является конфигурацией Документооборот Холдинга.
//
// Возвращаемое значение:
//	Булево - Истина - Если текущая конфигурация является конфигурацией Документооборот Холдинга.
//
Функция ЭтоДокументооборотХолдинга() Экспорт
	
	ЭтоДокументооборотХолдинга = Ложь;

	
	Возврат ЭтоДокументооборотХолдинга;
	
КонецФункции

// Проверяет, что изменение объекта выполняется процессе загрузки .
//
// Параметры:
//	Объект - КонстантаМенеджерЗначения -
//		   - СправочникОбъект -
//		   - ДокументОбъект -
//		   - БизнесПроцессОбъект -
//		   - ЗадачаОбъект -
//		   - ПланВидовХарактеристикОбъект -
//		   - РегистрСведенийНаборЗаписей -
//		   - РегистрНакопленияНаборЗаписей - Объект, который необходимо проверить.
//
// Возвращаемое значение:
//	Булево - Истина, если выполняется загрузка объекта.
//
Функция ЭтоЗагрузкаОбъекта(Объект) Экспорт

	ЭтоЗагрузкаОбъекта = Ложь;

	
	Возврат ЭтоЗагрузкаОбъекта;

КонецФункции

// Используется в редакции Докуменнтооборот Холдинга
// Проверяет, является ли этот узел основным для пользователя.
//
// Параметры:
//	Пользователь - СправочникСсылка.Пользователи - Пользователь, принадлежность которого необходимо проверить.
//
// Возвращаемое значение:
//	Булево - Истина - Этот узел является основным для пользователя.
//
Функция ЭтоОсновнойУзелПользователя(Пользователь) Экспорт
	
	ЭтоОсновнойУзелПользователя = Истина;
	
	
	Возврат ЭтоОсновнойУзелПользователя;
	
КонецФункции

// Используется в редакции Докуменнтооборот Холдинга
// Проверяет, принадлежит ли ссылка объект этому узлу.
//
// Параметры:
//	Объект - ЛюбаяСсылка - Ссылка, которую необходимо проверить.
//
// Возвращаемое значение:
//	Булево - Объект принадлежит этому узлу.
//
Функция СсылкаНаОбъектЭтогоУзла(Объект) Экспорт
	
	ОбъектЭтогоУзла = Истина;
	
	
	Возврат ОбъектЭтогоУзла;
	
КонецФункции

#КонецОбласти