#Область ПрограммныйИнтерфейс
// Локализация
// Возращает дату, с которой начнется проверка наличия вопросов в обращениях
//
Функция ДатаПроверкиНаличияВопросов() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ДатаПроверкиНаличияВопросов.Получить();
	
КонецФункции
// Локализация Конец

// Возращает значение константы Используется передача дел хранения.
// 
// Возвращаемое значение:
//  Булево - Истина, если используется передача дел хранения
Функция ИспользуетсяПередачаДелХранения() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ИспользуетсяПередачаДелХранения.Получить();
	
КонецФункции

#КонецОбласти


