#Область ДлительныеОперации

// Функция возвращающая таблицу значений 
// для помощника подбора классификации оперцаций НДС 0% по номенклатуре
// данная функция вызывается как фоновое задание

// Параметры:
//   Параметры - Структура
//		- Поля:
//			ТаблицаКодовОпераций - ТаблицаЗначений
//									- Колонки:
//										КодОперации - Строка
//										Операции СправочникСсылка.Операции0
//										ПредставлениеОпераций - Строка
//			НачалоПериода - Дата
//			КонецПериода - Дата
//			Организация - СправочникСсылка.Организации
//			Номенклатура - СправочникСсылка.Номенклатура
//			ЭтоГруппа - Булево

// Возвращаемое значение:
//  - ТаблицаЗначений
//		- Колонки:
//			Номенклатура - СправочникСсылка.Номенклатура
//			ПредставлениеТекущихОпераций - Строка
//			Операции - СправочникСсылка.Операции0
//			ПредставлениеОпераций - Строка
//			Порядок - Число
//			Порядок - Число
//			КлючСтроки - Строка
//			РазныеОперации - Булево

Функция ПодобратьОперации0(Параметры) Экспорт

	Возврат Неопределено;

КонецФункции

#КонецОбласти