#Область ПрограммныйИнтерфейс

// Вызывается из ДеревоПриложенийПриАктивизацииСтроки формы документа ДействиеЗадачи
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Элемент - ТаблицаФормы - Элемент
// 
// Возвращаемое значение:
//  Булево - активизация строки обработана, дальнейшей обработки не требуется
Функция ДеревоПриложенийПриАктивизацииСтроки_ДействиеЗадачи(Форма, Элемент) Экспорт

// Локализация

	Если ОбработатьАктивизациюСтрокиПриложения(Форма, Элемент) Тогда
		Возврат Истина;
	КонецЕсли;
	
// Локализация Конец

	Возврат Ложь;

КонецФункции

// Вызывается из ДеревоПриложенийПриАктивизацииСтроки формы документа Задача
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Элемент - ТаблицаФормы - Элемент
// 
// Возвращаемое значение:
//  Булево - активизация строки обработана, дальнейшей обработки не требуется
Функция ДеревоПриложенийПриАктивизацииСтроки_Задача(Форма, Элемент) Экспорт

// Локализация
	
	Если ОбработатьАктивизациюСтрокиПриложения(Форма, Элемент) Тогда
		Возврат Истина;
	КонецЕсли;
	
// Локализация Конец

	Возврат Ложь;

КонецФункции

#КонецОбласти

// Локализация
#Область СлужебныеПроцедурыИФункции

Функция ОбработатьАктивизациюСтрокиПриложения(Форма, Элемент) Экспорт

	ТекущиеДанные = Форма.Элементы.ДеревоПриложений.ТекущиеДанные;
	Если Форма.ИспользоватьПредпросмотрФайлов
		И ТекущиеДанные.ТипСтроки = ПредопределенноеЗначение("Перечисление.ТипыСтрокДереваПриложений.ДокументЭДО") Тогда
		
		Форма.Элементы.СтраницыПросмотра.ТекущаяСтраница = Форма.Элементы.СтраницаОбзорФайла; // та же страница
		Форма.ПодключитьОбработчикОжидания("ОбновитьПревьюДокументаЭДО", 0.2, Истина);
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

#КонецОбласти
// Локализация Конец
