
#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

// Вызывается из ПриСозданииНаСервере общей формы ВыборКонтрагентаКонтактноеЛицо
// Параметры:
//  СписокКонтрагенты - ДинамическийСписок
Процедура ВыборКонтрагентаКонтактноеЛицо_ПриСозданииНаСервере(СписокКонтрагенты) Экспорт

	// Локализация

	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриСозданииНаСервереСписокКонтрагентов(СписокКонтрагенты);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

	// Локализация Конец
	
КонецПроцедуры

#КонецОбласти
#КонецОбласти