
#Область ПрограммныйИнтерфейс

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей - Массив из см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа,
//                               см. УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа
//  ПараметрыОбновления - Структура:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа, который был удален из профиля, будут также удалены из групп доступа.
//
// Пример:
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Имя           = "Менеджер";
//  ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
//  ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
//  ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
//  ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
//  ОписаниеПрофиля.Роли.Добавить("Подсистема_Продажи");
//  ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупателей");
//  ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКнигаПокупок");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
//  ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
//  ОписаниеПапки.Имя           = "ДополнительныеПрофили";
//  ОписаниеПапки.Идентификатор = "69a066e7-ce81-11eb-881c-b06ebfbf08c7";
//  ОписаниеПапки.Наименование  = НСтр("ru = 'Дополнительные профили'", ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписанияПрофилей.Добавить(ОписаниеПапки);
//
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Родитель = "ДополнительныеПрофили";
//  ОписаниеПрофиля.Идентификатор = "70179f20-2315-11e6-9bff-d850e648b60c";
//  ОписаниеПрофиля.Наименование = НСтр("ru = 'Редактирование, отправка по почте, сохранение в файл печатных форм (дополнительно)'",
//  	ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительно назначается пользователям, которым должна быть доступна возможность редактирования,
//  	|перед печатью, отправка по почте и сохранение в файл сформированных печатных форм.'");
//  ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	// Локализация
	
	// Описание для заполнение профиля "Ответственные за МЭДО"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "4a3c2c1a-3290-11ed-9ec2-4cedfb9508c3";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственные за МЭДО'");
	ОписаниеПрофиля.Роли.Добавить("РаботаСМЭДО");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваМЭДО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("РаботаСДокументамиПредприятия");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияДокументовПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций"); // Для ограничения по виду доступа "Организации"	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДокументовПредприятия"); // Для ограничения по виду доступа "ВидыДокументов"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрифовДоступа"); // Для ограничения по виду доступа "ГрифыДоступа"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппДоступаКонтрагентов"); // Для ограничения по виду доступа "ГруппыДоступаКонтрагентов"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппДоступаФизическихЛиц"); // Для ограничения по виду доступа "ГруппыДоступаФизическихЛиц"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВопросовДеятельности"); // Для ограничения по виду доступа "ВопросыДеятельности"
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
		ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
		ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	КонецЕсли;
	// Роли БЭД
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭДДокументооборот");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профили для работы с ЭДО
	
	// Оператор ЭДО
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "f29fef1f-bac3-460c-a165-07230eac7a6c";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Операторы ЭДО'");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭДДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументовДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУведомленийЭДО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДОДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентамиДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументовПоОрганизациямДокументооборот");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Ответственный за ЭДО и МЧД
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "bd0ef8cc-f453-4eb0-b77e-398f7990b955";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственные за ЭДО и МЧД'");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭДДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутовПодписанияДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМЧДКонтрагентовЭДОДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМЧДОрганизацийЭДОДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменаСКонтрагентамиДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументовДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУведомленийЭДО");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДОДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументовПоОрганизациямДокументооборот");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Локализация Конец
	
КонецПроцедуры

#КонецОбласти
