// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает адрес сайта настройки PUSH уведомлений 
// на русском или английском языке
//
// Параметры:
//  КодЯзыка - Строка - Код языка текущего пользователя
//
// Возвращаемое значение:
//  Строка - Адрес сайта с указанием языка интерфейса.
//
Функция ПолучитьАдресСайтаНастройкиPUSH(КодЯзыка) Экспорт

// Локализация	
	Если КодЯзыка = "ru" Тогда
		Возврат "https://pushnotifications.1c.com/signin?lang=ru";
	КонецЕсли;
// Локализация Конец

	Возврат "https://pushnotifications.1c.com/signin?lang=en";
		
КонецФункции

#КонецОбласти