#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Записывает статус потока  
//
// Параметры: 
//  Поток  - Число
//  ДатаНачала  - Дата
//  ДатаПоследнейАктивности - Дата
//  ТекущаяОбрабатываемаяУчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - учетная запись
//
Процедура ЗаписатьСтатус(Поток, ДатаНачала, ДатаПоследнейАктивности,
	ТекущаяОбрабатываемаяУчетнаяЗапись) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Поток = Поток;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Поток = Поток;
	Если ДатаНачала <> Неопределено Тогда
		МенеджерЗаписи.ДатаНачала = ДатаНачала;
	КонецЕсли;	
	МенеджерЗаписи.ДатаПоследнейАктивности = ДатаПоследнейАктивности;
	МенеджерЗаписи.ТекущаяОбрабатываемаяУчетнаяЗапись = ТекущаяОбрабатываемаяУчетнаяЗапись;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли