#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры.Разряды) = Тип("Массив") Тогда
		Для Каждого Разряд Из Параметры.Разряды Цикл
			НоваяСтрока = РазрядыТарифы.Добавить();
			НоваяСтрока.Разряд = Разряд;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Разряды = Новый Соответствие;
	
	Для Каждого РазрядТариф Из РазрядыТарифы Цикл
		Разряды.Вставить(РазрядТариф.Разряд, РазрядТариф.Тариф);
	КонецЦикла;
	
	Закрыть(Разряды);
	
КонецПроцедуры

#КонецОбласти