///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает адрес загрузки модуля объекта в редактор.
//
// Параметры:
//   СтруктураВыгрузки - Структура:
//     * ТипМетаданных - Строка
//     * ОбъектМетаданных - Строка
//     * ТипМодуля - Строка
//
// Возвращаемое значение:
//   Строка
//
Функция АдресЗагрузкиМодуляВРедактор(Знач СтруктураВыгрузки) Экспорт
	
	АдресЗагрузки = "";
	
	ИмяКоллекции = ИмяКоллекцииМетаданныхПоТипу(СтруктураВыгрузки.ТипМетаданных);
	Попытка
		ПолноеИмя = Метаданные[СтруктураВыгрузки.ТипМетаданных][СтруктураВыгрузки.ОбъектМетаданных].ПолноеИмя();
	Исключение
		ПолноеИмя = "";
	КонецПопытки;
	
	ЧастиИмени = СтрРазделить(ПолноеИмя, ".", Ложь);
	Если ЧастиИмени.Количество() = 2 Тогда
		АдресЗагрузки = СтрШаблон("%1.items.%2.%3",
			ИмяКоллекции,
			ЧастиИмени[1],
			СтруктураВыгрузки.ТипМодуля);
	КонецЕсли;
	
	Возврат АдресЗагрузки;
	
КонецФункции

// Возвращает адрес макета с двоичными данными архива глобальных модулей во временном хранилище.
//
// Параметры:
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
// Возвращаемое значение:
//   см. РедакторВстроенногоЯзыка.АдресМакетаГлобальныеМодули
//
Функция АдресМакетаГлобальныеМодули(Знач УникальныйИдентификаторФормы) Экспорт
	
	Возврат РедакторВстроенногоЯзыка.АдресМакетаГлобальныеМодули(УникальныйИдентификаторФормы);
	
КонецФункции

// Возвращает версию информационной базы.
//
// Возвращаемое значение:
//   Строка
//
Функция ВерсияИБ() Экспорт
	
	Возврат Метаданные.Версия;
	
КонецФункции

// Преобразует значение в строку JSON при помощи метода глобального контекста ЗаписатьJSON.
// Допускаются не все типы значений, подробности см. в синтакс-помощнике.
// Даты преобразуются в формат ISO (YYYY-MM-DDThh:mm:ssZ).
// 
// Параметры:
//  Значение - Произвольный
//
// Возвращаемое значение:
//  Строка
//
Функция ЗначениеВJSON(Знач Значение) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеВJSON(Значение);
	
КонецФункции

// Возвращает имя коллекции метаданных редактора.
//
// Параметры:
//   ТипОбъектов - Строка, Тип - тип объекта 1С:Предприятия.
//
// Возвращаемое значение:
//   см. РедакторВстроенногоЯзыка.ИмяКоллекцииМетаданныхПоТипу
//
Функция ИмяКоллекцииМетаданныхПоТипу(Знач ТипОбъектов) Экспорт
	
	Возврат РедакторВстроенногоЯзыка.ИмяКоллекцииМетаданныхПоТипу(ТипОбъектов);
	
КонецФункции

// Формирует список метаданных для загрузки в редактор.
//
// Параметры:
//   ТипОбъектов - Строка - тип объектов метаданных, которые требуется загрузить.
//
// Возвращаемое значение:
//   см. РедакторВстроенногоЯзыка.МетаданныеДляОбновления
//
Функция МетаданныеДляОбновления(Знач ТипОбъектов) Экспорт
	
	Возврат РедакторВстроенногоЯзыка.МетаданныеДляОбновления(ТипОбъектов);
	
КонецФункции

// Формирует описание объекта метаданных для загрузки в редактор.
//
// Параметры:
//   ТипОбъекта - Строка - тип объекта метаданных, описание которого требуется загрузить.
//
// Возвращаемое значение:
//   см. РедакторВстроенногоЯзыка.ОписаниеОбъектаМетаданных
//
Функция ОписаниеОбъектаМетаданных(Знач ТипОбъекта) Экспорт
	
	Возврат РедакторВстроенногоЯзыка.ОписаниеОбъектаМетаданных(ТипОбъекта);
	
КонецФункции

// Формирует описание переменной для показа в редакторе.
//
// Параметры:
//   ИдентификаторПеременной - Строка - идентификатор переменной.
//   ИмяПеременной - Строка - имя переменной.
//   ПутьКДанным - Строка - путь к данным.
//   АдресХраненияПеременных - Строка - адрес хранения переменных.
//
// Возвращаемое значение:
//   см. РедакторВстроенногоЯзыка.ОписаниеПеременной
//
Функция ОписаниеПеременной(Знач ИдентификаторПеременной, Знач ИмяПеременной, Знач ПутьКДанным,
		Знач АдресХраненияПеременных) Экспорт
	
	Возврат РедакторВстроенногоЯзыка.ОписаниеПеременной(
		ИдентификаторПеременной,
		ИмяПеременной,
		ПутьКДанным,
		АдресХраненияПеременных);
	
КонецФункции

// Возвращает путь к данным редактора встроенного языка.
//
// Параметры:
//   ВоВременномХранилище - Булево - если Истина, то возвращает адрес во временном хранилище, иначе возвращает
//     полный текст HTML документа.
//
// Возвращаемое значение:
//   Строка - данную строку нужно поместить в свойство ПутьКДанным поля HTML документа на форме.
//
Функция ПутьКДаннымРедактора(ВоВременномХранилище = Истина) Экспорт
	
	Возврат РедакторВстроенногоЯзыкаПовтИсп.ПутьКДаннымРедактора(ВоВременномХранилище);
	
КонецФункции

#КонецОбласти