
//&Вместо("ПриУстановкеНовогоНомера")
//Процедура Расш1_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
//	// Вставить содержимое обработчика.
//	Если Не ЗначениеЗаполнено(Грузоотправитель)
//	Тогда
//		ВызватьИсключение "Не заполнено поле ""Грузоотпраивтель""";
//	КонецЕсли;
//	
//	Префикс = ЭТП.ПолучитьПрефиксДляОрганизации( Грузоотправитель.ИНН );
//	
//	//ПродолжитьВызов(СтандартнаяОбработка, Префикс);
//КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура Расш1_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента")
	Тогда
	
		АдресДоставки = ДанныеЗаполнения.АдресДоставки;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И
			ДанныеЗаполнения.Свойство("ДокументОснование")
	Тогда
		Если ТипЗнч( ДанныеЗаполнения.ДокументОснование ) = Тип("Массив")
	        Тогда
		
			АдресДоставки = ДанныеЗаполнения.ДокументОснование[0].АдресДоставки;
		
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

//При создании документов из Заказа клиента заполняет поле ВариантВыбытияМаркируемойПродукции 
//заполняется "Объект из отключенного расширения конфигурации", очищаем. Конф 2.5.7.288
&После("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗначениеЗаполнено(ВариантВыбытияМаркируемойПродукции) тогда
		Для каждого Зн из Перечисления.ВариантыВыбытияМаркируемойПродукции цикл
			Если ВариантВыбытияМаркируемойПродукции = Зн тогда
				Возврат;
			КонецЕсли;
		КонецЦикла;
	    ВариантВыбытияМаркируемойПродукции = Перечисления.ВариантыВыбытияМаркируемойПродукции.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры
