#Область ПрограммныйИнтерфейс

// Дополнить общие настройки штампа ЭП.
// 
// Параметры:
//  Настройки - Структура - См. ФайловыеФункцииПовтИсп.ПолучитьОбщиеНастройкиШтампаЭП
Процедура ДополнитьОбщиеНастройкиШтампаЭП(Настройки) Экспорт
	
	Настройки.Вставить("ИспользоватьВнешнийСервисВставкиЭП", Ложь);
	
	// Локализация
	Настройки.Вставить("ИспользоватьВнешнийСервисВставкиЭП", ВизуализацияПовтИсп.ИспользуетсяВнешнийСервисВставкиШтампаЭП());
	// Локализация Конец
	
	
КонецПроцедуры

#КонецОбласти
