#Область ПрограммныйИнтерфейс

// Определяет состав реквизитов для 
// 
// Параметры:
//  ТипДокумента - ПеречислениеСсылка.ТипыФормализованныхДокументов
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить сопоставление реквизитов и свойств JSON:
// * ИмяРеквизита - Строка - Так реквизит будет назван в РаспознанныйДокумент.РеквизитыДокумента.ИмяРеквизита
// * ОписаниеТипа - ОписаниеТипов - Тип реквизита, определяет тип РаспознанныйДокумент.РеквизитыДокумента.Значение
// * Адрес - Строка - для v1 (формат версии 1) показывает откуда из старого формата взять значение
// * НеОтображать - Булево - где-то используется
// * НетНаПечатнойФорме - Булево - где-то используется
// * КлассСущности - Строка - для v2 (формат версии 2) для поиска среди сущностей
// * ПодклассСущности - Строка - для v2 для поиска среди сущностей
// * Путь - Строка - для v2 для поиска среди сущностей
//
Функция ПолучитьСопоставлениеРеквизитовИСвойствJSON(ТипДокумента = Неопределено) Экспорт
	
	Типы = Типы();
	
	РеквизитыДокумента = Новый ТаблицаЗначений;
	РеквизитыДокумента.Колонки.Добавить("ИмяРеквизита", Типы.ИмяРеквизита);
	РеквизитыДокумента.Колонки.Добавить("ОписаниеТипа");
	РеквизитыДокумента.Колонки.Добавить("Адрес", Типы.Строка);
	
	РеквизитыДокумента.Колонки.Добавить("НеОтображать", Типы.Булево);
	РеквизитыДокумента.Колонки.Добавить("НетНаПечатнойФорме", Типы.Булево);
	РеквизитыДокумента.Колонки.Добавить("ЭтоРеквизитТабличнойЧасти", Типы.Булево);
	
	// Новые колонки универсального формата
	РеквизитыДокумента.Колонки.Добавить("КлассСущности", Типы.Строка);
	РеквизитыДокумента.Колонки.Добавить("ПодклассСущности", Типы.Строка);
	РеквизитыДокумента.Колонки.Добавить("Путь", Типы.Строка);
		
	РеквизитыДокумента.Индексы.Добавить("КлассСущности");
	РеквизитыДокумента.Индексы.Добавить("Путь");
	
	#Область Формат_в_1
	//ОбработанныеРеквизиты, ИмяАтрибутаJSON, ИмяРеквизита, ОписаниеТипа
	Если ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыФормализованныхДокументов.УПД") Тогда
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "СчетФактура.Номер", "НомерДокумента", Типы.Строка);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "СчетФактура.Дата", "ДатаДокумента", Типы.Дата);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец.Наименование", "Продавец", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель.Наименование", "Покупатель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузоотправитель.Наименование", "Грузоотправитель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузополучатель.Наименование", "Грузополучатель", Типы.Контрагент);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец.Наименование", "ПродавецОрганизация", Типы.Организация);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель.Наименование", "ПокупательОрганизация", Типы.Организация);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.ВсегоКОплате.Стоимость", "ИтогоСумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.ВсегоКОплате.СуммаНДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.ВсегоКОплате.Всего", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец.ИНН", "ИННКПППродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель.ИНН", "ИННКПППокупателя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "ОснованиеПередачи.Основание.НомерДоговора", "НомерДоговора", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "ОснованиеПередачи.Основание.ДатаДоговора", "ДатаДоговора", Типы.Дата, Истина);
		
		// Таблица
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварНаименование", "Номенклатура", Типы.Номенклатура);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Количество", "Количество", Типы.Количество);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ЕдиницаИзмерения", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Стоимость", "Сумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Всего", "Всего", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ПредставлениеСтраны", "СтранаПроисхождения", Типы.СтраныМира);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварКод", "Артикул", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ЕдиницаИзмеренияКод", "КодЕдиницыИзмерения", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СтранаПроисхожденияКод", "КодСтраныПроисхождения", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварНаименование", "Содержание", Типы.Строка);
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыФормализованныхДокументов.ТОРГ12") Тогда
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "ТаблицаТоварнаяНакладная.НомерДокумента", "НомерДокумента", Типы.Строка);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "ТаблицаТоварнаяНакладная.ДатаСоставления", "ДатаДокумента", Типы.Дата);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПоставщик.ПредставлениеПоставщика.Наименование", "Продавец", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПлательщик.ПредставлениеПлательщика.Наименование", "Покупатель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерИнформацияОбОрганизации.КонтейнерОрганизация.ПредставлениеОрганизации.Наименование", "Грузоотправитель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерГрузополучатель.ПредставлениеГрузополучателя.Наименование", "Грузополучатель", Типы.Контрагент);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПоставщик.ПредставлениеПоставщика.Наименование", "ПродавецОрганизация", Типы.Организация);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПлательщик.ПредставлениеПлательщика.Наименование", "ПокупательОрганизация", Типы.Организация);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Всего по накладной.СуммаБезНДС", "ИтогоСумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Всего по накладной.СуммаНДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Всего по накладной.СуммаСНДС", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПоставщик.ПредставлениеПоставщика.ИНН", "ИННПродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПлательщик.ПредставлениеПлательщика.ИНН", "ИННПокупателя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерИнформацияОбОрганизации.КонтейнерОрганизация.ПредставлениеОрганизации.ИНН", "ИННГрузоотправителя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерГрузополучатель.ПредставлениеГрузополучателя.ИНН", "ИННГрузополучателя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерОснование.Основание.НомерДоговора", "НомерДоговора", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерОснование.Основание.ДатаДоговора", "ДатаДоговора", Типы.Дата, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПоставщик.ПредставлениеПоставщика.КПП", "КПППродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПлательщик.ПредставлениеПлательщика.КПП", "КПППокупателя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерИнформацияОбОрганизации.КонтейнерОрганизация.ПредставлениеОрганизации.КПП", "КППГрузоотправителя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерГрузополучатель.ПредставлениеГрузополучателя.КПП", "КППГрузополучателя", Типы.Строка, Истина);
		
		// Таблица
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.НаименованиеТовара", "Номенклатура", Типы.Номенклатура);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.КоличествНетто", "Количество", Типы.Количество);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.наименование", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаБезНДС", "Сумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаСНДС", "Всего", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.код", "Артикул", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.кодПоОКЕИ", "КодЕдиницыИзмерения", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.НаименованиеТовара", "Содержание", Типы.Строка);
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыФормализованныхДокументов.СчетФактура") Тогда
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Номер_к.Номер", "НомерДокумента", Типы.Строка);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Номер_к.Дата", "ДатаДокумента", Типы.Дата);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец_к.ПредставлениеПоставщика", "Продавец", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель_к.ПредставлениеПокупателя", "Покупатель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузоотправитель_к.ПредставлениеГрузоотправителя", "Грузоотправитель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузополучатель_к.ПредставлениеГрузополучателя.Наименование", "Грузополучатель", Типы.Контрагент);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец_к.ПредставлениеПоставщика", "ПродавецОрганизация", Типы.Организация);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель_к.ПредставлениеПокупателя", "ПокупательОрганизация", Типы.Организация);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.НадписьВсего.Стоимость", "ИтогоСумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.НадписьВсего.СуммаНДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.НадписьВсего.Всего", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец_к.ИННПоставщика", "ИННКПППродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель_к.ИННПокупателя", "ИННКПППокупателя", Типы.Строка, Истина);
		
		// Таблица
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварНаименование", "Номенклатура", Типы.Номенклатура);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Количество", "Количество", Типы.Количество);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ЕдиницаИзмерения", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Стоимость", "Сумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Всего", "Всего", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ПредставлениеСтраны", "СтранаПроисхождения", Типы.СтраныМира);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ЕдиницаИзмеренияКод", "КодЕдиницыИзмерения", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СтранаПроисхожденияКод", "КодСтраныПроисхождения", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварНаименование", "Содержание", Типы.Строка);
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыФормализованныхДокументов.АктОбОказанииУслуг") Тогда
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заголовок.Номер", "НомерДокумента", Типы.Строка);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заголовок.Дата", "ДатаДокумента", Типы.Дата);
		
		// КонтейнерПоставщик.ПредставлениеПоставщика
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.Наименование", "Продавец", Типы.Контрагент);
		// КонтейнерПлательщик.ПредставлениеПлательщика
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.Наименование", "Покупатель", Типы.Контрагент);
		
		// Нет на печатной форме
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузоотправитель", "Грузоотправитель", Типы.Контрагент, Истина, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузополучатель", "Грузополучатель", Типы.Контрагент, Истина, Истина);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.Наименование", "ПродавецОрганизация", Типы.Организация);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.Наименование", "ПокупательОрганизация", Типы.Организация);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.Итого", "ИтогоСумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.НДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Сумма.Значение", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.ИНН", "ИННПродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.ИНН", "ИННПокупателя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование.НомерДоговора", "НомерДоговора", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование.ДатаДоговора", "ДатаДоговора", Типы.Дата, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.ВТомЧислеНДС", "СуммаВключаетНДС", Типы.Булево);
		
		// Таблица
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Наименование", "Номенклатура", Типы.Номенклатура);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Количество", "Количество", Типы.Количество);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Единиц", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Сумма", "Сумма", Типы.ДенежнаяСумма);
		
		// Нет на печатной форме
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС, , Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма, , Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаСНДС", "Всего", Типы.ДенежнаяСумма, , Истина);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Артикул", "Артикул", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Наименование", "Содержание", Типы.Строка);
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыФормализованныхДокументов.СчетНаОплату") Тогда
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заголовок.Номер", "НомерДокумента", Типы.Строка);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заголовок.Дата", "ДатаДокумента", Типы.Дата);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.Наименование.НаименованиеОрганизации", "Продавец", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.Наименование", "Покупатель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.КПП.Номер", "КПППродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.КПП", "КПППокупателя", Типы.Строка, Истина);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "СрокОплаты.Дата", "СрокОплаты", Типы.Дата);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.Наименование.НаименованиеОрганизации", "ПродавецОрганизация", Типы.Организация);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.Наименование", "ПокупательОрганизация", Типы.Организация);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.Итого", "ИтогоСумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.НДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.Всего", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.ИНН.Номер", "ИННПродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.ИНН", "ИННПокупателя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование.НомерДоговора", "НомерДоговора", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование.ДатаДоговора", "ДатаДоговора", Типы.Дата, Истина);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.Наименование", "Исполнитель", Типы.Организация);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.ИНН", "ИННИсполнителя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.КПП", "КППИсполнителя", Типы.Строка, Истина);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.Счет.Номер", "БанковскийСчетКонтрагента", Типы.БанковскиеСчета);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.Счет.Номер", "БанковскийСчетОрганизации", Типы.БанковскиеСчета);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Банк.Наименование.НаименованиеБанка", "БанкНаименование", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Банк.СчётБанка.Номер", "БанкСчет", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Банк.БИК.Номер", "Банк", Типы.Банк, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.ВТомЧислеНДС", "СуммаВключаетНДС", Типы.Булево);
		
		// Таблица
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Товары", "Номенклатура", Типы.Номенклатура);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Количество", "Количество", Типы.Количество);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Единицы", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Сумма", "Сумма", Типы.ДенежнаяСумма);
		
		// Нет на печатной форме
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.ПроцентСкидки", "ПроцентСкидки", Типы.ДенежнаяСумма, , Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС, , Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма, , Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаСНДС", "Всего", Типы.ДенежнаяСумма, , Истина);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Артикул", "Артикул", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Товары", "Содержание", Типы.Строка);
		
	Иначе
		ИспользоватьНовыйФормат = Истина;
	КонецЕсли;
	#КонецОбласти
	
	Если ИспользоватьНовыйФормат = Истина Тогда
	//=====================================ЗАГОЛОВОК ДОКУМЕНТА=========================================================
	
		// "Р_0"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "НомерДокумента";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ЗаголовокДокумента";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Номер";
		
		// "Р_1"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ДатаДокумента";
		Правило.ОписаниеТипа = Типы.Дата;
		Правило.КлассСущности = "ЗаголовокДокумента";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Дата";
		
		// "Р_4"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Заголовок";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ЗаголовокДокумента";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Наименование";		
		
		//=====================================ПОСТАВЩИК=========================================================
		
		// "Р_4"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Поставщик";
		Правило.ОписаниеТипа = Типы.Контрагент;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_9"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ПоставщикОрганизация"; //ПродавецОрганизация
		Правило.ОписаниеТипа = Типы.Организация;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
			
		// "Р_19"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННПоставщика"; //ИННПродавца
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		
		// "Р_44"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "КПППоставщика"; //КПППродавца
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.КПП";
		
		// "Р_27"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "БанковскийСчетКонтрагента";
		Правило.ОписаниеТипа = Типы.БанковскиеСчета;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.НомерСчета";
		
		// "Р_28"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "БанковскийСчетОрганизации";
		Правило.ОписаниеТипа = Типы.БанковскиеСчета;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.НомерСчета";
		
		// "Р_29"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "БанкСчет";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.НомерСчетаКорреспондента";
		
		// "Р_30"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Банк";
		Правило.ОписаниеТипа = Типы.Банк;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.БИК";
		
		// "Р_47"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "БанкНаименование";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.НаименованиеБанка";
		
		//=====================================ПОКУПАТЕЛЬ=========================================================
	
		// "Р_5"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Покупатель";
		Правило.ОписаниеТипа = Типы.Контрагент;
		Правило.КлассСущности = "Покупатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_10"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ПокупательОрганизация";
		Правило.ОписаниеТипа = Типы.Организация;
		Правило.КлассСущности = "Покупатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_20"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННПокупателя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Покупатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		
		// "Р_46"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "КПППокупателя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Покупатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.КПП";
		
		//=====================================ГРУЗООТПРАВИТЕЛЬ=========================================================
	
		// "Р_6"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Грузоотправитель";
		Правило.ОписаниеТипа = Типы.Контрагент;
		Правило.КлассСущности = "Грузоотправитель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_39"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННГрузоотправителя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Грузоотправитель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		
		// "Р_40"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "КППГрузоотправителя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Грузоотправитель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.КПП";
		
		//=====================================ГРУЗОПОЛУЧАТЕЛЬ=========================================================
			
		// "Р_7"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Грузополучатель";
		Правило.ОписаниеТипа = Типы.Контрагент;
		Правило.КлассСущности = "Грузополучатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_41"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННГрузополучателя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Грузополучатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		
		// "Р_42"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "КППГрузополучателя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Грузополучатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.КПП";	
		
		//=====================================ДОКУМЕНТ ОСНОВАНИЕ=========================================================
		
		// "Р_21"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "НомерДокументаОснования";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ДокументОснование";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Документ.Номер";
		
		// "Р_22"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ДатаДокументаОснования";
		Правило.ОписаниеТипа = Типы.Дата;
		Правило.КлассСущности = "ДокументОснование";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Документ.Дата";
		
		//=====================================ТАБЛИЦА НОМЕНКЛАТУР=========================================================
		
		// "Р_11"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "Сумма";
		
		// "Р_12"
		Правило = РеквизитыДокумента.Добавить(); // Переопределит ПодвалИтого.Сумма
		Правило.ИмяРеквизита = "ИтогоСумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "СуммаБезНДС";
		
		// "Р_13"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИтогоСуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "СуммаНДС";
		
		// "Р_14"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "СуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "СуммаНДС";
		
		// "Р_15"
		Правило = РеквизитыДокумента.Добавить(); // Переопределит ПодвалИтого.СуммаНДС
		Правило.ИмяРеквизита = "ИтогоСуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалСуммаНДС";
		Правило.Путь = "Сумма";
		
		// "Р_16"
		Правило = РеквизитыДокумента.Добавить(); // Переопределит ПодвалСуммаНДС.Сумма
		Правило.ИмяРеквизита = "ИтогоСуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалВТомЧислеНДС";
		Правило.Путь = "Сумма";
		
		// "Р_17"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИтогоВсего";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "СуммаСНДС";
		
		// "Р_18"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Сумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "СуммаСНДС";
		
		// "Р_33"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСуммаУменьшение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУменьшение";
		Правило.Путь = "СуммаБезНДС";
		
		// "Р_34"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСуммаНДСУменьшение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУменьшение";
		Правило.Путь = "СуммаНДС";
		
		// "Р_35"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИтогоВсегоУменьшение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУменьшение";
		Правило.Путь = "СуммаСНДС";
		
		// "Р_36"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСуммаУвеличение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУвеличение";
		Правило.Путь = "СуммаБезНДС";
		
		// "Р_37"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСуммаНДСУвеличение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУвеличение";
		Правило.Путь = "СуммаНДС";
		
		// "Р_38"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИтогоВсегоУвеличение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУвеличение";
		Правило.Путь = "СуммаСНДС";
		
		//=====================================СТРОКИ ТАБЛИЦЫ НОМЕНКЛАТУР==================================================
	
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "НомерИсходнойСтроки";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НомерИсходнойСтроки";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Номенклатура";
		Правило.ОписаниеТипа = Типы.Номенклатура;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НаименованиеНоменклатуры";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Артикул";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "АртикулНоменклатуры";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Содержание";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НаименованиеНоменклатуры";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Количество";
		Правило.ОписаниеТипа = Типы.Количество;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "Количество";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Цена";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "Цена";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Сумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "Сумма";
		
		Правило = РеквизитыДокумента.Добавить(); // Переопределит Сумма
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Сумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СуммаБезНДС";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СтавкаНДС";
		Правило.ОписаниеТипа = Типы.СтавкаНДС;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СтавкаНДС";
		
		Правило = РеквизитыДокумента.Добавить(); // Переопределит СтавкаНДС
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СтавкаНДС";
		Правило.ОписаниеТипа = Типы.СтавкаНДС;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СтавкаНДСТип";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СуммаНДС";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Всего";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СуммаСНДС";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "ЕдиницаИзмерения";
		Правило.ОписаниеТипа = Типы.ЕдиницаИзмерения;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НаименованиеЕдиницыИзмерения";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "КодЕдиницыИзмерения";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "КодЕдиницыИзмерения";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СтранаПроисхождения";
		Правило.ОписаниеТипа = Типы.СтраныМира;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НаименованиеСтраныПроисхождения";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "КодСтраныПроисхождения";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "КодСтраныПроисхождения";
	
	КонецЕсли;
	
	Возврат РеквизитыДокумента;
	
КонецФункции

// Типы.
// 
// Возвращаемое значение:
//  Структура - Типы:
// * ИмяРеквизита - ОписаниеТипов - 
// * Строка - ОписаниеТипов - 
// * Дата - ОписаниеТипов - 
// * Булево - ОписаниеТипов - 
// * Количество - ОписаниеТипов - 
// * ДенежнаяСумма - ОписаниеТипов - 
// * Организация - ОписаниеТипов - 
// * Контрагент - ОписаниеТипов - 
// * БанковскиеСчета - ОписаниеТипов - 
// * Номенклатура - ОписаниеТипов - 
// * СтавкаНДС - ОписаниеТипов - 
// * ЕдиницаИзмерения - ОписаниеТипов - 
// * СтраныМира - ОписаниеТипов - 
// * Банк - ОписаниеТипов - 
Функция Типы() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИмяРеквизита", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(40)));
	
	Результат.Вставить("Строка", Новый ОписаниеТипов("Строка"));
	Результат.Вставить("Дата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Результат.Вставить("Булево", Новый ОписаниеТипов("Булево"));
	Результат.Вставить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	Результат.Вставить("ДенежнаяСумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Результат.Вставить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Вставить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Результат.Вставить("БанковскиеСчета", Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));
	Результат.Вставить("Номенклатура",  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Результат.Вставить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	Результат.Вставить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	Результат.Вставить("СтраныМира", Новый ОписаниеТипов("СправочникСсылка.СтраныМира"));
	Результат.Вставить("Банк", Новый ОписаниеТипов("СправочникСсылка.КлассификаторБанков"));
	
	Возврат Результат;
	
КонецФункции

// Помощник добавления соответствий для См. РаспознаваниеДокументовПереопределяемый.ПриСопоставленииРеквизитовДокумента
// 
// Параметры:
//   ОбработанныеРеквизиты - ТаблицаЗначений
//   ИмяАтрибутаJSON - Строка
//   ИмяРеквизита - Строка
//   ОписаниеТипа - ОписаниеТипов
//   НеОтображать - Булево
//   НетНаПечатнойФорме - Булево
//
Процедура ДобавитьСоответствиеРеквизита(ОбработанныеРеквизиты, ИмяАтрибутаJSON, ИмяРеквизита, ОписаниеТипа, НеОтображать = Ложь, НетНаПечатнойФорме = Ложь) Экспорт
	
	СвойстваРеквизита = ОбработанныеРеквизиты.Добавить();
	СвойстваРеквизита.Адрес = ИмяАтрибутаJSON;
	СвойстваРеквизита.ИмяРеквизита = ИмяРеквизита;
	СвойстваРеквизита.ОписаниеТипа = ОписаниеТипа;
	СвойстваРеквизита.НеОтображать = НеОтображать;
	СвойстваРеквизита.НетНаПечатнойФорме = НетНаПечатнойФорме;
	СвойстваРеквизита.ЭтоРеквизитТабличнойЧасти = (СтрНайти(СвойстваРеквизита.Адрес, ".Строка.") > 0);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет верифицируемые реквизиты при открытии формы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ИсторияВерификации - Булево
Процедура ЗаполнитьВерифицируемыеРеквизитыПриОткрытииФормы(Форма, ИсторияВерификации = Ложь) Экспорт
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("Товары");
	
	Если ИсторияВерификации = Истина Тогда
		
		ДокументСсылка = Форма.Документ;
		
	Иначе
		
		ДокументСсылка = Форма.Объект.Ссылка;
		
	КонецЕсли;
		
	ЭтоФормаРаспознанногоДокумента = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") 
		И ЗначениеЗаполнено(Форма.Объект.ВидДокумента);
		
	Если ИсторияВерификации = Истина ИЛИ ЭтоФормаРаспознанногоДокумента Тогда
		
		Форма.ВерифицируемыеРеквизитыТЧ.Загрузить(ДанныеТаблицыДокумента(ДокументСсылка, ИменаТаблиц));
		Форма.ВерифицируемыеРеквизитыШапки.Загрузить(ДанныеРеквизитовДокумента(ДокументСсылка));
		
		ДанныеТЧБезаналоговВДокументе = 
			ДанныеТабличныхЧастейБезАналоговВРаспознанномДокументе(ДокументСсылка);
			
		Для Каждого Стр Из ДанныеТЧБезаналоговВДокументе Цикл
			
			НСтрока = Форма.ВерифицируемыеРеквизитыТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НСтрока, Стр);
			
		КонецЦикла;
		
	Иначе
		
		Если ДанныеДокументаНеРаспознаны(ДокументСсылка, Истина) Тогда
			
			НСтрока = Форма.ВерифицируемыеРеквизитыШапки.Добавить();
			НСтрока.ИмяРеквизита = РаспознаваниеДокументовСлужебныйКлиентСервер.ИмяРеквизитаДокументНеРаспознан();
			НСтрока.ТребуетПроверки = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Служебная процедура вызываемая из РаспознаваниеДокументов.ЗаполнитьРеквизитыРекурсивно
// 
// Параметры:
//  ТипДокумента - ПеречислениеСсылка.ТипыФормализованныхДокументов
//  ИмяТаблицы - Строка
//  АдресJSON - Строка
//  ДанныеСтрок - Структура
Процедура ПриФормированииДанныхТабличныхЧастей(ТипДокумента, ИмяТаблицы, АдресJSON, ДанныеСтрок) Экспорт
	
	Если ТипДокумента = Перечисления.ТипыФормализованныхДокументов.ТОРГ12 
		И ИмяТаблицы = "ТаблицаТоварнаяНакладная" Тогда
		АдресJSON = ИмяТаблицы + ".";
		ИмяТаблицы = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Добавляет варианты найденные поиском по нескольким реквизитам.
// 
// Параметры:
//  ДанныеРеквизитов - Структура - см РаспознаваниеДокументов.ЗагрузкаДанныхИЗаполнениеДокумента()
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  СоздаватьЕслиНеНайден - Булево
Процедура ДобавитьВариантыНайденныеПоискомПоНесколькимРеквизитам(ДанныеРеквизитов, ДокументСсылка, 
			СоздаватьЕслиНеНайден = Истина) Экспорт
	
	ПорогУверенностиДляПодстановки = РаспознаваниеДокументовКлиентСервер.ПорогУверенностиДляПодстановки();
	
	РеквизитыДокумента = ДанныеРеквизитов.ТаблицаРеквизитов;
	РеквизитыТабличныхЧастей = ДанныеРеквизитов.ТаблицаРеквизитовТЧ;
	
	ОбъединяемыеРеквизиты = Новый Массив;
	ОбъединяемыеРеквизиты.Добавить("Наименование");
	ОбъединяемыеРеквизиты.Добавить("НаименованиеПолное");
	ПараметрыОбъединенияРеквизитов = Новый Структура("Наименование", ОбъединяемыеРеквизиты);
	
	// Продавец
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("Продавец", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("ИННКПППродавца", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		ДобавитьИННКПП(РеквизитыПоискаКонтрагентОрганизация, НайденнаяСтрока.РаспознанныйТекст);
	КонецЕсли;	
	
	Если РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") = Ложь Тогда
		НайденнаяСтрока = РеквизитыДокумента.Найти("ИННПродавца", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Свойство("КПП") = Ложь Тогда
		НайденнаяСтрока = РеквизитыДокумента.Найти("КПППродавца", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		Кандидаты = ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов,
			Отбор
		);
		
		Для Каждого Кандидат Из Кандидаты Цикл
			
			СвойстваКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Кандидат.Ссылка, "Наименование, ИНН");
			
			Наименование = Неопределено;
			ИНН = Неопределено;
			
			Если Не РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН", ИНН) Тогда
				
				Схожесть = 0;
				Если РеквизитыПоискаКонтрагентОрганизация.Свойство("Наименование", Наименование) Тогда
					Схожесть = РаспознаваниеДокументовНечеткийПоискСлужебный.СходствоДжароВинклера(
						УбратьОрганизационнуюФорму(Наименование),
						УбратьОрганизационнуюФорму(СвойстваКонтрагента.Наименование));
				КонецЕсли;
					
				Если Схожесть > 0.9 Тогда
					Кандидат.Коэффициент = Кандидат.Коэффициент * 0.79;
				Иначе
					Кандидат.Коэффициент = Кандидат.Коэффициент * 0.49;
				КонецЕсли;
				
			Иначе
				
				Если ИНН <> СвойстваКонтрагента.ИНН Тогда
					Кандидат.Коэффициент = Кандидат.Коэффициент * 0.49;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если  ОтсутствуютКандидатыСУверенностью(Кандидаты, ПорогУверенностиДляПодстановки) И СоздаватьЕслиНеНайден 
			И РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") Тогда

			СоздатьПоИННиДобавитьВКандидаты(РеквизитыПоискаКонтрагентОрганизация, Кандидаты);
				
		КонецЕсли;
	
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "Продавец", Кандидаты);
		
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Кандидаты = ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов
		);
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "ПродавецОрганизация", Кандидаты);
		
	КонецЕсли;
	
	// Покупатель
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("Покупатель", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("ИННКПППокупателя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		ДобавитьИННКПП(РеквизитыПоискаКонтрагентОрганизация, НайденнаяСтрока.РаспознанныйТекст);
	КонецЕсли;	
	
	Если РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") = Ложь Тогда
		НайденнаяСтрока = РеквизитыДокумента.Найти("ИННПокупателя", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Свойство("КПП") = Ложь Тогда
		НайденнаяСтрока = РеквизитыДокумента.Найти("КПППокупателя", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
			
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		
		Если Отбор.Количество() > 0 Тогда
			
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			Для Каждого Кандидат Из Кандидаты Цикл
				
				СвойстваКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Кандидат.Ссылка, "Наименование, ИНН");
				
				Наименование = Неопределено;
				ИНН = Неопределено;
				Если Не РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН", ИНН) Тогда
					
					Схожесть = 0;
					Если РеквизитыПоискаКонтрагентОрганизация.Свойство("Наименование", Наименование) Тогда
						Схожесть = РаспознаваниеДокументовНечеткийПоискСлужебный.СходствоДжароВинклера(
							УбратьОрганизационнуюФорму(Наименование),
							УбратьОрганизационнуюФорму(СвойстваКонтрагента.Наименование));
					КонецЕсли;
						
					Если Схожесть > 0.9 Тогда
						Кандидат.Коэффициент = Кандидат.Коэффициент * 0.79;
					Иначе
						Кандидат.Коэффициент = Кандидат.Коэффициент * 0.49;
					КонецЕсли;
					
				Иначе
					
					Если ИНН <> СвойстваКонтрагента.ИНН Тогда
						Кандидат.Коэффициент = Кандидат.Коэффициент * 0.49;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
				
			Если ОтсутствуютКандидатыСУверенностью(Кандидаты, ПорогУверенностиДляПодстановки) И СоздаватьЕслиНеНайден 
				И РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") Тогда

				СоздатьПоИННиДобавитьВКандидаты(РеквизитыПоискаКонтрагентОрганизация, Кандидаты);
					
			КонецЕсли;
			
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "Покупатель", Кандидаты);
			
		КонецЕсли;
			
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "ПокупательОрганизация", Кандидаты);
		КонецЕсли;
		
	КонецЕсли;
	
	// Грузополучатель
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("Грузополучатель", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;

	НайденнаяСтрока = РеквизитыДокумента.Найти("ИННКППГрузополучателя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		ДобавитьИННКПП(РеквизитыПоискаКонтрагентОрганизация, НайденнаяСтрока.РаспознанныйТекст);
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") = Ложь Тогда
		НайденнаяСтрока = РеквизитыДокумента.Найти("ИННГрузополучателя", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Свойство("КПП") = Ложь Тогда
		НайденнаяСтрока = РеквизитыДокумента.Найти("КППГрузополучателя", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			Если ОтсутствуютКандидатыСУверенностью(Кандидаты, ПорогУверенностиДляПодстановки) И СоздаватьЕслиНеНайден 
				И РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") Тогда

				СоздатьПоИННиДобавитьВКандидаты(РеквизитыПоискаКонтрагентОрганизация, Кандидаты);
					
			КонецЕсли;
				
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "Грузополучатель", Кандидаты);
		КонецЕсли;
		
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "ГрузополучательОрганизация", Кандидаты);
		КонецЕсли;
	КонецЕсли;
	
	// Грузоотправитель
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("Грузоотправитель", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("ИННКППГрузоотправителя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		ДобавитьИННКПП(РеквизитыПоискаКонтрагентОрганизация, НайденнаяСтрока.РаспознанныйТекст);
	КонецЕсли;	
	
	Если РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") = Ложь Тогда
		НайденнаяСтрока = РеквизитыДокумента.Найти("ИННГрузоотправителя", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Свойство("КПП") = Ложь Тогда
		НайденнаяСтрока = РеквизитыДокумента.Найти("КППГрузоотправителя", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			Если ОтсутствуютКандидатыСУверенностью(Кандидаты, ПорогУверенностиДляПодстановки) И СоздаватьЕслиНеНайден 
				И РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") Тогда
				СоздатьПоИННиДобавитьВКандидаты(РеквизитыПоискаКонтрагентОрганизация, Кандидаты);
			КонецЕсли;
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "Грузоотправитель", Кандидаты);
		КонецЕсли;
		
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "ГрузоотправительОрганизация", Кандидаты);
		КонецЕсли;
	КонецЕсли;
	
	//Исполнитель
	
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	НайденнаяСтрока = РеквизитыДокумента.Найти("Исполнитель", "ИмяРеквизита");
	
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("ИННКППИсполнителя", "ИмяРеквизита");
	
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		ДобавитьИННКПП(РеквизитыПоискаКонтрагентОрганизация, НайденнаяСтрока.РаспознанныйТекст);
	КонецЕсли;	
	
	Если РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") = Ложь Тогда
		НайденнаяСтрока = РеквизитыДокумента.Найти("ИННИсполнителя", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(
				НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Свойство("КПП") = Ложь Тогда
		НайденнаяСтрока = РеквизитыДокумента.Найти("КППИсполнителя", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(
				НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
			
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			Если ОтсутствуютКандидатыСУверенностью(Кандидаты, ПорогУверенностиДляПодстановки) И СоздаватьЕслиНеНайден 
				И РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") Тогда
				СоздатьПоИННиДобавитьВКандидаты(РеквизитыПоискаКонтрагентОрганизация, Кандидаты);
			КонецЕсли;
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "Исполнитель", Кандидаты);
		КонецЕсли;
		
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "ИсполнительОрганизацияИсполнитель", 
				Кандидаты);
		КонецЕсли;
	КонецЕсли;
	
	// Банк
	РеквизитыПоискаБанк = Новый Структура();
	НайденнаяСтрока = РеквизитыДокумента.Найти("Банк", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаБанк.Вставить("Код", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	Если РеквизитыПоискаБанк.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.КлассификаторБанков.ПустаяСсылка");
		Кандидаты = ПолучитьКандидатов(
			РеквизитыПоискаБанк,
			Тип);
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "Банк", Кандидаты);
	КонецЕсли;
	
	// Банковский счет
	РеквизитыПоискаБанковскийСчет = Новый Структура();
	НайденнаяСтрока = РеквизитыДокумента.Найти("БанковскийСчетКонтрагента", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаБанковскийСчет.Вставить("Наименование", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	Если РеквизитыПоискаБанковскийСчет.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка");
		Кандидаты = ПолучитьКандидатов(
			РеквизитыПоискаБанковскийСчет,
			Тип);
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "БанковскийСчетКонтрагента", Кандидаты);
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "БанковскийСчетОрганизации", Кандидаты);
	КонецЕсли;
	
	//////////////////////////////
	// Табличная часть
	/////////////////////////////
	
	// Номенклатура
	НайденныеСтроки = РеквизитыТабличныхЧастей.НайтиСтроки(Новый Структура("ИмяРеквизита", "Номенклатура"));
	
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		
		// Номенклатура
		
		РеквизитыПоискаНоменклатура = Новый Структура();
		РеквизитыПоискаНоменклатура.Вставить("Наименование", СтрокаТаблицы.РаспознанныйТекст);
		
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТаблицы", "Артикул", СтрокаТаблицы.НомерСтрокиТаблицы);
		НайденнаяСтрока = РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 Тогда
			Артикул = ИзвлечьАртикулИзСтроки(НайденнаяСтрока[0].РаспознанныйТекст);
			Если Не ПустаяСтрока(Артикул) Тогда
				РеквизитыПоискаНоменклатура.Вставить("Артикул", Артикул);
			КонецЕсли;
		КонецЕсли;
		
		Тип = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		Кандидаты = ПолучитьКандидатов(
			РеквизитыПоискаНоменклатура,
			Тип,
			ПараметрыОбъединенияРеквизитов);
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "Номенклатура", Кандидаты, 
			СтрокаТаблицы.НомерСтрокиТаблицы);
		
		// СтранаПроисхождения
		
		РеквизитыПоискаСтранаПроисхождения = Новый Структура();
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТаблицы", "СтранаПроисхождения", 
			СтрокаТаблицы.НомерСтрокиТаблицы);
		НайденнаяСтрока = РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 И НЕ ПустаяСтрока(НайденнаяСтрока[0].РаспознанныйТекст) Тогда
			РеквизитыПоискаСтранаПроисхождения.Вставить("Наименование", НайденнаяСтрока[0].РаспознанныйТекст);
		КонецЕсли;
		Отбор.ИмяРеквизита = "КодСтраныПроисхождения";
		НайденнаяСтрока = РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 Тогда
			Код = ИзвлечьЦифрыИзСтроки(НайденнаяСтрока[0].РаспознанныйТекст);
			Если Не ПустаяСтрока(Код) Тогда
				РеквизитыПоискаСтранаПроисхождения.Вставить("Код", Код);
			КонецЕсли;
		КонецЕсли;
		Если РеквизитыПоискаСтранаПроисхождения.Количество() Тогда
			Тип = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка");
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаСтранаПроисхождения,
				Тип,
				ПараметрыОбъединенияРеквизитов);
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "СтранаПроисхождения", Кандидаты, 
				СтрокаТаблицы.НомерСтрокиТаблицы);
		КонецЕсли;
		
		// ЕдиницаИзмерения
		
		РеквизитыПоискаЕдиницаИзмерения = Новый Структура();
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТаблицы", "ЕдиницаИзмерения", 
			СтрокаТаблицы.НомерСтрокиТаблицы);
		НайденнаяСтрока = РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 И НЕ ПустаяСтрока(НайденнаяСтрока[0].РаспознанныйТекст) Тогда
			РеквизитыПоискаЕдиницаИзмерения.Вставить("Наименование", НайденнаяСтрока[0].РаспознанныйТекст);
		КонецЕсли;
		Отбор.ИмяРеквизита = "КодЕдиницыИзмерения";
		НайденнаяСтрока = РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 Тогда
			Код = ИзвлечьЦифрыИзСтроки(НайденнаяСтрока[0].РаспознанныйТекст);
			Если Не ПустаяСтрока(Код) Тогда
				РеквизитыПоискаЕдиницаИзмерения.Вставить("Код", Код);
			КонецЕсли;
		КонецЕсли;
		Если РеквизитыПоискаЕдиницаИзмерения.Количество() Тогда
			Тип = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка");
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаЕдиницаИзмерения,
				Тип,
				ПараметрыОбъединенияРеквизитов);
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "ЕдиницаИзмерения", Кандидаты, 
				СтрокаТаблицы.НомерСтрокиТаблицы);
		КонецЕсли;
		
		// СтавкаНДС
		
		РеквизитыПоискаСтавкаНДС = Новый Структура();
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТаблицы", "СтавкаНДС", СтрокаТаблицы.НомерСтрокиТаблицы);
		НайденнаяСтрока = РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 И НЕ ПустаяСтрока(НайденнаяСтрока[0].РаспознанныйТекст) Тогда
			РеквизитыПоискаСтавкаНДС.Вставить("Наименование", НайденнаяСтрока[0].РаспознанныйТекст);
		КонецЕсли;
		Если РеквизитыПоискаСтавкаНДС.Количество() Тогда
			
			Тип = ПредопределенноеЗначение("Справочник.СтавкиНДС.ПустаяСсылка");
			
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаСтавкаНДС,
				Тип,
				ПараметрыОбъединенияРеквизитов);
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, ДокументСсылка, "СтавкаНДС", Кандидаты, 
				СтрокаТаблицы.НомерСтрокиТаблицы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Описание реквизита модели распознанного документа.
// Если не найден - при указании СоздаватьЕслиНеНайдено = Истина будет добавлен с пустым значением.
// 
// Параметры:
//  ТаблицаРеквизитов - ТаблицаЗначений
//  ИмяРеквизита - Строка
//  СоздаватьЕслиНеНайдено - Булево - Создавать если не найдено
// 
// Возвращаемое значение:
//  Неопределено, СтрокаТаблицыЗначений - Реквизит документа
Функция РеквизитДокумента(ТаблицаРеквизитов, ИмяРеквизита, СоздаватьЕслиНеНайдено = Истина) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяРеквизита", ИмяРеквизита);
	НайденныеСтроки = ТаблицаРеквизитов.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0];
	КонецЕсли;
	
	Если Не СоздаватьЕслиНеНайдено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.ИмяРеквизита = ИмяРеквизита;
	
	Возврат НоваяСтрока;
	
КонецФункции

// Добавляет реквизит таблицы документа.
// 
// Параметры:
//  ТаблицаРеквизитов - ТаблицаЗначений - 
//  НомерСтрокиТаблицы - Число - 
//  ИмяРеквизита - Строка
//  СоздаватьЕслиНеНайдено - Булево - Создавать если не найдено
// 
// Возвращаемое значение:
//  Неопределено - Реквизит таблицы документа
Функция РеквизитТаблицыДокумента(ТаблицаРеквизитов, НомерСтрокиТаблицы, ИмяРеквизита, 
		СоздаватьЕслиНеНайдено = Истина) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("НомерСтрокиТаблицы", НомерСтрокиТаблицы);
	Отбор.Вставить("ИмяРеквизита", ИмяРеквизита);
	НайденныеСтроки = ТаблицаРеквизитов.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0];
	КонецЕсли;
	
	Если Не СоздаватьЕслиНеНайдено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.НомерСтрокиТаблицы = НомерСтрокиТаблицы;
	НоваяСтрока.ИмяРеквизита = ИмяРеквизита;
	
	Возврат НоваяСтрока;
	
КонецФункции

// Возвращает юр физ лицо по организационной форме.
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие - ФиксированноеСоответствие
Функция ЮрФизЛицоПоОрганизационнойФорме() Экспорт
	
	Результат = Новый Соответствие;
	РаспознаваниеДокументовПереопределяемый.ПриОпределенииЮрФизЛицаПоОрганизационнойФорме(Результат);
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

// Добавляет кандидатов в список выбора.
// 
// Параметры:
//  РаспознанныеДанные - ТаблицаЗначений - см. РаспознаваниеДокументов.ДанныеРеквизитовДокумента()
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ИмяРеквизита - Строка
//  Кандидаты - Массив из Структура
//  НомерСтроки - Число
Процедура ДобавитьКандидатовВСписокВыбора(
		РаспознанныеДанные, ДокументСсылка, ИмяРеквизита, Кандидаты, НомерСтроки = Неопределено) Экспорт
	
	Если Кандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НомерСтроки = Неопределено Тогда
		НаборЗаписей = РегистрыСведений.СписокВыбораРеквизитовРаспознаваниеДокументов.СоздатьНаборЗаписей();
	Иначе
		НаборЗаписей = РегистрыСведений.СписокВыбораТабличныхЧастейРаспознаваниеДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.НомерСтрокиТаблицы.Установить(НомерСтроки);
	КонецЕсли;
	
	НаборЗаписей.Отбор.Документ.Установить(ДокументСсылка);
	НаборЗаписей.Отбор.ИмяРеквизита.Установить(ИмяРеквизита);
	
	// Для поиска по нескольким реквизитам затираем результаты старого нечеткого поиска,
	НаборЗаписей.Прочитать();
	
	НаиболееУверенноеЗначениеПройдено = Ложь;
	ИмеющиесяДанные = НаборЗаписей.Выгрузить();
	Если ИмеющиесяДанные.Количество() Тогда
		
		ТекущийПорядковыйНомер = 0;
		Индекс = ИмеющиесяДанные.Количество();
		Пока Индекс > 0 Цикл
			
			Индекс = Индекс - 1;
			ИмеющиесяДанные.Удалить(Индекс);

		КонецЦикла;
		
	Иначе
		
		ТекущийПорядковыйНомер = 0;
		
	КонецЕсли;
	
	НаборЗаписей.Загрузить(ИмеющиесяДанные);
	
	Для Каждого Кандидат Из Кандидаты Цикл
		
		ЗаполнитьНайденноеЗначение(РаспознанныеДанные, ИмяРеквизита, НомерСтроки, Кандидат.Ссылка, 
			Кандидат.Коэффициент * 100, НаиболееУверенноеЗначениеПройдено);
		ЕстьСовпадение = Ложь;
		Для Каждого ИмеющаясяЗапись Из НаборЗаписей Цикл
			Если ИмеющаясяЗапись.Значение = Кандидат.Ссылка
				И ИмеющаясяЗапись.ДополнительноеЗначение = Кандидат.ДополнительнаяСсылка Тогда
				
				ЕстьСовпадение = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЕстьСовпадение Тогда
			ТекущийПорядковыйНомер = ТекущийПорядковыйНомер + 1;
			ДанныеНабора = НаборЗаписей.Добавить();
			ДанныеНабора.Документ = ДокументСсылка;
			ДанныеНабора.ПорядковыйНомер = ТекущийПорядковыйНомер;
			ДанныеНабора.ИмяРеквизита = ИмяРеквизита;
			ДанныеНабора.Значение = Кандидат.Ссылка;
			ДанныеНабора.ДополнительноеЗначение = Кандидат.ДополнительнаяСсылка;
			ДанныеНабора.Уверенность = Кандидат.Коэффициент * 100;
			Если НЕ НомерСтроки = Неопределено Тогда
				ДанныеНабора.НомерСтрокиТаблицы = НомерСтроки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Добавляет созданные элементы в список выбора.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ДанныеРеквизитов - Массив из Структура
Процедура ДобавитьСозданныеЭлементыВСписокВыбора(ДокументСсылка, ДанныеРеквизитов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ДанныеРеквизита Из ДанныеРеквизитов Цикл
		
		Если ДанныеРеквизита.НомерСтрокиТаблицы > 0 Тогда 
			НаборЗаписей = РегистрыСведений.СписокВыбораТабличныхЧастейРаспознаваниеДокументов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.НомерСтрокиТаблицы.Установить(ДанныеРеквизита.НомерСтрокиТаблицы);
		Иначе
			НаборЗаписей = РегистрыСведений.СписокВыбораРеквизитовРаспознаваниеДокументов.СоздатьНаборЗаписей();
		КонецЕсли;
		
		НаборЗаписей.Отбор.Документ.Установить(ДокументСсылка);
		НаборЗаписей.Отбор.ИмяРеквизита.Установить(ДанныеРеквизита.ИмяРаспознанногоРеквизита);
		
		НаборЗаписей.Прочитать();
		
		ТекущиеЗаписи = НаборЗаписей.Выгрузить();
		
		УжеВСписке = Ложь;
		
		Для Каждого Запись Из ТекущиеЗаписи Цикл
			
			Если Запись.Значение = ДанныеРеквизита.УстановленноеЗначение Тогда
				
				Запись.ПорядковыйНомер = 1;
				Запись.СозданВФорме = Истина;
				УжеВСписке = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		//сдвинем и перенумеруем
		Порядок = 2;
		Для Каждого Запись Из ТекущиеЗаписи Цикл
			
			Если Запись.Значение = ДанныеРеквизита.УстановленноеЗначение И Запись.СозданВФорме = Истина Тогда
				Продолжить;
			КонецЕсли;
			
			Запись.ПорядковыйНомер = Порядок;
			Порядок = Порядок + 1;
			
		КонецЦикла;
		
		Если УжеВСписке = Ложь Тогда
		
			НоваяЗапись = ТекущиеЗаписи.Добавить();
			
			Если ДанныеРеквизита.НомерСтрокиТаблицы > 0 Тогда 
				НоваяЗапись.НомерСтрокиТаблицы = ДанныеРеквизита.НомерСтрокиТаблицы;
			КонецЕсли;
			
			НоваяЗапись.Документ = ДокументСсылка;
			НоваяЗапись.ПорядковыйНомер = 1;
			НоваяЗапись.ИмяРеквизита = ДанныеРеквизита.ИмяРаспознанногоРеквизита;
			НоваяЗапись.Значение = ДанныеРеквизита.УстановленноеЗначение;
			НоваяЗапись.Уверенность = РаспознаваниеДокументовКлиентСервер.ПорогУверенностиДляВерификации();
			НоваяЗапись.СозданВФорме = Истина;
			
		КонецЕсли;
		
		НаборЗаписей.Загрузить(ТекущиеЗаписи);
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Извлекает цифры из строки.
// 
// Параметры:
//  Строка - Строка
// 
// Возвращаемое значение:
//  Строка - Извлечь цифры из строки
Функция ИзвлечьЦифрыИзСтроки(Строка) Экспорт
	
	ДоступныеСимволы = "0123456789";
	Возврат ИзвлечьСимволыИзСтроки(Строка, ДоступныеСимволы);
	
КонецФункции

// Извлекает артикул из строки.
// 
// Параметры:
//  Строка - Строка
// 
// Возвращаемое значение:
//  Строка - Извлечь артикул из строки
Функция ИзвлечьАртикулИзСтроки(Строка) Экспорт
	
	ДоступныеСимволы = "-_./:"
		+ "0123456789"
		+ "абвгдежзиклмнопрстуфхцчшщъыьэюя"
		+ "АБВГДЕЖЗИКЛМНОПРЕСТУФХЦЧШЩЪЫЬЭЮЯ"
		+ "abcdefghijklmnopqrstuvwxwz"
		+ "ABCDEFGHIGKLMNOPQRSTUVWXYZ";
	Возврат ИзвлечьСимволыИзСтроки(Строка, ДоступныеСимволы);
	
КонецФункции

// Извлекает ИННКППИз строки.
// 
// Параметры:
//  ИННКПП - Строка
//  ИмяРеквизита - Строка
// 
// Возвращаемое значение:
//  Строка - Извлечь ИННКППИз строки
Функция ИзвлечьИННКППИзСтроки(ИННКПП, ИмяРеквизита) Экспорт
	
	НаборЗначений = СтрРазделить(ИННКПП, "/", Ложь);
	
	Если НаборЗначений.Количество() И ИмяРеквизита = "ИНН" Тогда
		Возврат ИзвлечьЦифрыИзСтроки(НаборЗначений[0]);
	ИначеЕсли НаборЗначений.Количество() > 1 И ИмяРеквизита = "КПП" Тогда
		СтрокаИзЦифр = ИзвлечьЦифрыИзСтроки(НаборЗначений[1]);
		Если СтрДлина(СтрокаИзЦифр) > 9 Тогда //бывают лишние символы
			СтрокаИзЦифр = Лев(СтрокаИзЦифр,9);
		КонецЕсли;
		Возврат СтрокаИзЦифр;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Возвращает макет отображения картинки документа HTML.
// 
// Параметры:
//  АдресВременногоХранилища - Неопределено - Адрес временного хранилища
// 
// Возвращаемое значение:
//  Неопределено, Строка - Макет отображения картинки документа HTML
Функция МакетОтображенияКартинкиДокументаHTML(АдресВременногоХранилища = Неопределено) Экспорт
	
	ДвоичныеДанные = ПолучитьОбщийМакет("МакетОтображенияКартинкиДокумента");
	
	ЧтениеТекста = Новый ЧтениеТекста(ДвоичныеДанные.ОткрытьПотокДляЧтения(), КодировкаТекста.UTF8);
	Возврат ЧтениеТекста.Прочитать();
	
КонецФункции

// Доступные организации.
// 
// Возвращаемое значение:
//  Массив из Справочникссылка.Организации - Доступные организации
Функция ДоступныеОрганизации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Возвращает данные для списка выбора.
// 
// Параметры:
//  Документ - СправочникСсылка.ДокументыПредприятия
//  ДанныеТаблицы - Булево - вернуть данные таблиц
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить данные для списка выбора
Функция ПолучитьДанныеДляСпискаВыбора(Документ, ДанныеТаблицы = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ДанныеТаблицы Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.ИмяРеквизита КАК ИмяРеквизита,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.ПорядковыйНомер КАК ПорядковыйНомер,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.Значение КАК Значение,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.ДополнительноеЗначение КАК ДополнительноеЗначение,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.Уверенность КАК Уверенность,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.СозданВФорме КАК СозданВФорме
		|ИЗ
		|	РегистрСведений.СписокВыбораТабличныхЧастейРаспознаваниеДокументов КАК СписокВыбораТабличныхЧастейРаспознаваниеДокументов
		|ГДЕ
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.Документ = &РаспознанныйДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Уверенность УБЫВ"
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.ИмяРеквизита КАК ИмяРеквизита,
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.ПорядковыйНомер КАК ПорядковыйНомер,
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.Значение КАК Значение,
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.ДополнительноеЗначение КАК ДополнительноеЗначение,
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.Уверенность КАК Уверенность,
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.СозданВФорме КАК СозданВФорме
		|ИЗ
		|	РегистрСведений.СписокВыбораРеквизитовРаспознаваниеДокументов КАК СписокВыбораРеквизитовРаспознаваниеДокументов
		|ГДЕ
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.Документ = &РаспознанныйДокумент
		|	И (НЕ СписокВыбораРеквизитовРаспознаваниеДокументов.Значение ССЫЛКА Справочник.Организации
		|			ИЛИ СписокВыбораРеквизитовРаспознаваниеДокументов.Значение В (&ДоступныеОрганизации))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Уверенность УБЫВ";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("РаспознанныйДокумент", Документ);
	Запрос.УстановитьПараметр("ДоступныеОрганизации", ДоступныеОрганизации());
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Возвращает двоичные данные распознанного файла.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  НормализованноеИзображение - Булево - вернуть нормализованное сервисом изображение
// 
// Возвращаемое значение:
//  Файл, Неопределено, ДвоичныеДанные, Произвольный - Распознанный файл документа
Функция РаспознанныйФайлДокумента(ДокументСсылка, НормализованноеИзображение = Истина) Экспорт
	
	Возврат РегистрыСведений.РезультатыРаспознаванияДокументов.РаспознанныйФайлПоДокументу(ДокументСсылка, 
		НормализованноеИзображение);
	
КонецФункции

// Возвращает данные таблицы документа.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ИменаТаблиц - Массив из Строка - Имена таблиц
//  ДобавитьУстановленноеЗначение - Булево - Добавить установленное значение
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные таблицы документа
Функция ДанныеТаблицыДокумента(ДокументСсылка, Знач ИменаТаблиц, Знач ДобавитьУстановленноеЗначение = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РаспознанныеДанныеТаблиц.ИмяТаблицы КАК ИмяТаблицы,
	|	РаспознанныеДанныеТаблиц.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
	|	РаспознанныеДанныеТаблиц.ИмяРаспознанногоРеквизита КАК ИмяРаспознанногоРеквизита,
	|	РаспознанныеДанныеТаблиц.КоординатаX0 КАК КоординатаX0,
	|	РаспознанныеДанныеТаблиц.КоординатаX1 КАК КоординатаX1,
	|	РаспознанныеДанныеТаблиц.КоординатаY0 КАК КоординатаY0,
	|	РаспознанныеДанныеТаблиц.КоординатаY1 КАК КоординатаY1,
	|	РаспознанныеДанныеТаблиц.ОбластьИзображения КАК ОбластьИзображения,
	|	РаспознанныеДанныеТаблиц.РаспознанноеЗначение КАК РаспознанноеЗначение,
	|	РаспознанныеДанныеТаблиц.РаспознанныйТекст КАК РаспознанныйТекст,
	|	РаспознанныеДанныеТаблиц.СтрокВИзображении КАК СтрокВИзображении,
	|	РаспознанныеДанныеТаблиц.УверенностьРаспознанногоЗначения КАК УверенностьРаспознанногоЗначения,
	|	РаспознанныеДанныеТаблиц.ЭлементСоздан КАК ЭлементСоздан,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.ИмяРеквизита КАК ИмяРеквизита,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.ТабличнаяЧасть КАК ТабличнаяЧасть,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.Идентификатор КАК Идентификатор,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.СозданВФорме КАК СозданВФорме,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.Проверен КАК Проверен,
	|	ЕСТЬNULL(ВерификацияРеквизитовТЧРаспознанныхДокументов.ТребуетПроверки, ЛОЖЬ) КАК ТребуетПроверки,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.УстановленноеЗначение КАК УстановленноеЗначение,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.ДатаПроверки КАК ДатаПроверки,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.Ответственный КАК Ответственный
	|ИЗ
	|	РегистрСведений.РезультатыРаспознаванияДокументов КАК РезультатыРаспознаванияДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспознанныеДанныеТаблиц КАК РаспознанныеДанныеТаблиц
	|		ПО РезультатыРаспознаванияДокументов.Файл = РаспознанныеДанныеТаблиц.Файл
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов КАК
	|			ВерификацияРеквизитовТЧРаспознанныхДокументов
	|		ПО РезультатыРаспознаванияДокументов.Документ = ВерификацияРеквизитовТЧРаспознанныхДокументов.Документ
	|		И РаспознанныеДанныеТаблиц.ИмяТаблицы = ВерификацияРеквизитовТЧРаспознанныхДокументов.ИмяТаблицы
	|		И РаспознанныеДанныеТаблиц.НомерСтрокиТаблицы = 
	|				ВерификацияРеквизитовТЧРаспознанныхДокументов.НомерСтрокиТаблицы
	|		И РаспознанныеДанныеТаблиц.ИмяРаспознанногоРеквизита = 
	|					ВерификацияРеквизитовТЧРаспознанныхДокументов.ИмяРаспознанногоРеквизита
	|ГДЕ
	|	РезультатыРаспознаванияДокументов.Документ = &Документ
	|	И ВерификацияРеквизитовТЧРаспознанныхДокументов.СтрокаУдалена = Ложь
	|	И РаспознанныеДанныеТаблиц.ИмяТаблицы В (&ИменаТаблиц)");
	

	Запрос.УстановитьПараметр("ИменаТаблиц", СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаТаблиц));
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	РаспознанныеДанные = Запрос.Выполнить().Выгрузить();
	
	Если ДобавитьУстановленноеЗначение = Истина Тогда
		
		Для Каждого Стр Из РаспознанныеДанные Цикл
			
			Если Не ЗначениеЗаполнено(Стр.Идентификатор) Тогда //в документе нет аналога распознанного реквизита
				Продолжить;
			КонецЕсли;
			
			СтрокаДокумента = ДокументСсылка[Стр.ТабличнаяЧасть].Найти(Стр.Идентификатор, "Идентификатор");
			
			Если СтрокаДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Стр.УстановленноеЗначение = СтрокаДокумента[Стр.ИмяРеквизита];
				
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РаспознанныеДанные;
	
КонецФункции

// Возвращает данные табличных частей без аналогов в распознанном документе.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ДобавитьУстановленноеЗначение - Булево
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция ДанныеТабличныхЧастейБезАналоговВРаспознанномДокументе(ДокументСсылка, 
		Знач ДобавитьУстановленноеЗначение = Истина) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РаспознанныеДанные.ИмяРаспознанногоРеквизита КАК ИмяРаспознанногоРеквизита,
	|	РаспознанныеДанные.КоординатаX0 КАК КоординатаX0,
	|	РаспознанныеДанные.КоординатаX1 КАК КоординатаX1,
	|	РаспознанныеДанные.КоординатаY0 КАК КоординатаY0,
	|	РаспознанныеДанные.КоординатаY1 КАК КоординатаY1,
	|	РаспознанныеДанные.ОбластьИзображения КАК ОбластьИзображения,
	|	РаспознанныеДанные.РаспознанноеЗначение КАК РаспознанноеЗначение,
	|	РаспознанныеДанные.РаспознанныйТекст КАК РаспознанныйТекст,
	|	РаспознанныеДанные.СтрокВИзображении КАК СтрокВИзображении,
	|	РаспознанныеДанные.УверенностьРаспознанногоЗначения КАК УверенностьРаспознанногоЗначения,
	|	РаспознанныеДанные.ЭлементСоздан КАК ЭлементСоздан,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.ИмяРеквизита КАК ИмяРеквизита,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.ТабличнаяЧасть КАК ТабличнаяЧасть,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.Идентификатор КАК Идентификатор,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.СозданВФорме КАК СозданВФорме,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.Проверен КАК Проверен,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.ТребуетПроверки КАК ТребуетПроверки,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.УстановленноеЗначение КАК УстановленноеЗначение,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.ДатаПроверки КАК ДатаПроверки,
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.Ответственный КАК Ответственный
	|ИЗ
	|	РегистрСведений.РезультатыРаспознаванияДокументов КАК РезультатыРаспознаванияДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспознанныеДанные КАК РаспознанныеДанные
	|		ПО РаспознанныеДанные.Файл = РезультатыРаспознаванияДокументов.Файл
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов КАК
	|			ВерификацияРеквизитовТЧРаспознанныхДокументов
	|		ПО РезультатыРаспознаванияДокументов.Документ = ВерификацияРеквизитовТЧРаспознанныхДокументов.Документ
	|		И
	|			РаспознанныеДанные.ИмяРаспознанногоРеквизита = 
	|				ВерификацияРеквизитовТЧРаспознанныхДокументов.ИмяРаспознанногоРеквизита
	|ГДЕ
	|	ВерификацияРеквизитовТЧРаспознанныхДокументов.ИмяТаблицы = """"
	|	И ВерификацияРеквизитовТЧРаспознанныхДокументов.СтрокаУдалена = Ложь
	|	И РезультатыРаспознаванияДокументов.Документ = &Документ");
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	РаспознанныеДанные = Запрос.Выполнить().Выгрузить();
	
	Если ДобавитьУстановленноеЗначение = Истина Тогда
		
		Для Каждого Стр Из РаспознанныеДанные Цикл
			
			Если Не ЗначениеЗаполнено(Стр.Идентификатор) Тогда //в документе нет аналога распознанного реквизита
				Продолжить;
			КонецЕсли;
			
			СтрокаДокумента = ДокументСсылка[Стр.ТабличнаяЧасть].Найти(Стр.Идентификатор, "Идентификатор");
			
			Если СтрокаДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Стр.УстановленноеЗначение = СтрокаДокумента[Стр.ИмяРеквизита];
				
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РаспознанныеДанные;

КонецФункции

// Данные реквизитов документа.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные реквизитов документа
Функция ДанныеРеквизитовДокумента(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РаспознанныеДанные.ИмяРаспознанногоРеквизита КАК ИмяРаспознанногоРеквизита,
	|	РаспознанныеДанные.КоординатаX0 КАК КоординатаX0,
	|	РаспознанныеДанные.КоординатаX1 КАК КоординатаX1,
	|	РаспознанныеДанные.КоординатаY0 КАК КоординатаY0,
	|	РаспознанныеДанные.КоординатаY1 КАК КоординатаY1,
	|	РаспознанныеДанные.ОбластьИзображения КАК ОбластьИзображения,
	|	РаспознанныеДанные.РаспознанноеЗначение КАК РаспознанноеЗначение,
	|	РаспознанныеДанные.РаспознанныйТекст КАК РаспознанныйТекст,
	|	РаспознанныеДанные.СтрокВИзображении КАК СтрокВИзображении,
	|	РаспознанныеДанные.УверенностьРаспознанногоЗначения КАК УверенностьРаспознанногоЗначения,
	|	РаспознанныеДанные.ЭлементСоздан КАК ЭлементСоздан,
	|	ВерификацияРеквизитовРаспознанныхДокументов.ИмяРеквизита КАК ИмяРеквизита,
	|	ВерификацияРеквизитовРаспознанныхДокументов.СозданВФорме КАК СозданВФорме,
	|	ВерификацияРеквизитовРаспознанныхДокументов.Проверен КАК Проверен,
	|	ЕСТЬNULL(ВерификацияРеквизитовРаспознанныхДокументов.ТребуетПроверки, ЛОЖЬ) КАК ТребуетПроверки,
	|	ВерификацияРеквизитовРаспознанныхДокументов.УстановленноеЗначение КАК УстановленноеЗначение,
	|	ВерификацияРеквизитовРаспознанныхДокументов.ДатаПроверки КАК ДатаПроверки,
	|	ВерификацияРеквизитовРаспознанныхДокументов.Ответственный КАК Ответственный
	|ИЗ
	|	РегистрСведений.РезультатыРаспознаванияДокументов КАК РезультатыРаспознаванияДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспознанныеДанные КАК РаспознанныеДанные
	|		ПО РезультатыРаспознаванияДокументов.Файл = РаспознанныеДанные.Файл
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерификацияРеквизитовРаспознанныхДокументов КАК
	|			ВерификацияРеквизитовРаспознанныхДокументов
	|		ПО РезультатыРаспознаванияДокументов.Документ = ВерификацияРеквизитовРаспознанныхДокументов.Документ
	|		И РаспознанныеДанные.ИмяРаспознанногоРеквизита = 
	|				ВерификацияРеквизитовРаспознанныхДокументов.ИмяРаспознанногоРеквизита
	|ГДЕ
	|	РезультатыРаспознаванияДокументов.Документ = &Документ");
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает свойства ячеек таблицы.
// 
// Параметры:
//  РеквизитыТабличныхЧастей - ТаблицаЗначений - Реквизиты табличных частей
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
// 
// Возвращаемое значение:
//  Структура - Свойства ячеек таблицы
Функция СвойстваЯчеекТаблицы(РеквизитыТабличныхЧастей, ДокументСсылка) Экспорт
	
	Результат = Новый Структура;
	
	Для Каждого ДанныеСтрокиТЧ Из РеквизитыТабличныхЧастей Цикл
		
		Если ПустаяСтрока(ДанныеСтрокиТЧ.ИмяТаблицы) Тогда //стороны, контрагенты
			Продолжить;
		Иначе
			
			ИдентификаторДляФормированияКлюча = ДанныеСтрокиТЧ.НомерСтрокиТаблицы;
			ИмяРеквизита = ДанныеСтрокиТЧ.ИмяРаспознанногоРеквизита;
			
		КонецЕсли;
		
		Свойства = Новый Структура;
		Свойства.Вставить("ИмяРеквизита", ИмяРеквизита);
		Свойства.Вставить("Значение", ДанныеСтрокиТЧ.УстановленноеЗначение);
		Свойства.Вставить("ТипЗначения", ТипЗнч(ДанныеСтрокиТЧ.УстановленноеЗначение));
		
		Свойства.Вставить("НайденноеЗначение", ДанныеСтрокиТЧ.РаспознанноеЗначение);
		Свойства.Вставить("УверенностьНайденногоЗначения", ДанныеСтрокиТЧ.УверенностьРаспознанногоЗначения);
		
		Свойства.Вставить("РаспознанныйТекст", ДанныеСтрокиТЧ.РаспознанныйТекст);
		Свойства.Вставить("ЭлементСоздан", ДанныеСтрокиТЧ.ЭлементСоздан);
		Свойства.Вставить("НомерСтроки", ДанныеСтрокиТЧ.НомерСтрокиТаблицы);
		
		Свойства.Вставить("СтрокВИзображении", ДанныеСтрокиТЧ.СтрокВИзображении);
		Свойства.Вставить("Координаты", РаспознаваниеДокументовСлужебныйКлиентСервер.
			ПолучитьНаборКоординат(ДанныеСтрокиТЧ));
		
		Свойства.Вставить("ЗначенияВыбора", Новый Массив);
		
		Ключ = РаспознаваниеДокументовСлужебныйКлиентСервер.КлючСвойстваЯчеекТаблицы(
			ИмяРеквизита, ИдентификаторДляФормированияКлюча);
			
		Результат.Вставить(Ключ, Свойства);
		
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗначенияВыбораЗначений = ПолучитьДанныеДляСпискаВыбора(ДокументСсылка, Истина);
	
	Для Каждого ДанныеВыбора Из ЗначенияВыбораЗначений Цикл
		
		Ключ = РаспознаваниеДокументовСлужебныйКлиентСервер.КлючСвойстваЯчеекТаблицы(
			ДанныеВыбора.ИмяРеквизита, ДанныеВыбора.НомерСтрокиТаблицы);
		
		ВариантВыбора = Новый Структура;
		ВариантВыбора.Вставить("Значение", ДанныеВыбора.Значение);
		ВариантВыбора.Вставить("ДополнительноеЗначение", ДанныеВыбора.ДополнительноеЗначение);
		ВариантВыбора.Вставить("Уверенность", ДанныеВыбора.Уверенность);
		ВариантВыбора.Вставить("СозданВФорме", ДанныеВыбора.СозданВФорме);
		
		Свойства = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, Ключ);
		
		Если Свойства = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Свойства.ЗначенияВыбора.Добавить(ВариантВыбора);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает ключевые реквизиты по имени распознанного реквизита.
// 
// Параметры:
//  ИмяРеквизита - Строка - Имя реквизита
//  ТипФормализованногоДокумента - Неопределено, ПеречислениеСсылка.ТипыФормализованныхДокументов - 
// 
// Возвращаемое значение:
//  Массив из Строка - Ключевые реквизиты
Функция КлючевыеРеквизиты(ИмяРеквизита, ТипФормализованногоДокумента = Неопределено) Экспорт
	
	ИменаРеквизитов = Новый  Массив;
	Если Не ПустаяСтрока(ИмяРеквизита) И ЗначениеЗаполнено(ТипФормализованногоДокумента) Тогда
		
		Если ТипФормализованногоДокумента <> Перечисления.ТипыФормализованныхДокументов.НеопределенныйДокумент Тогда
			
			Если СтрНачинаетсяС(ИмяРеквизита, "Покупатель") Тогда
				
				ИменаРеквизитов.Добавить("ИННПокупателя");
				ИменаРеквизитов.Добавить("КПППокупателя");
				ИменаРеквизитов.Добавить("ИННКПППокупателя");
				
			ИначеЕсли СтрНачинаетсяС(ИмяРеквизита, "Продавец") Тогда
				
				ИменаРеквизитов.Добавить("ИННПродавца");
				ИменаРеквизитов.Добавить("КПППродавца");
				ИменаРеквизитов.Добавить("ИННКПППродавца");
				
			ИначеЕсли СтрНачинаетсяС(ИмяРеквизита, "Грузоотправитель") Тогда
				
				ИменаРеквизитов.Добавить("ИННГрузоотправителя");
				ИменаРеквизитов.Добавить("КППГрузоотправителя");
				ИменаРеквизитов.Добавить("ИННКППГрузоотправителя");
				
			ИначеЕсли СтрНачинаетсяС(ИмяРеквизита, "Грузополучатель") Тогда
				
				ИменаРеквизитов.Добавить("ИННГрузополучателя");
				ИменаРеквизитов.Добавить("КППГрузополучателя");
				ИменаРеквизитов.Добавить("ИННКППГрузополучателя");
				
			ИначеЕсли СтрНачинаетсяС(ИмяРеквизита, "Исполнитель") Тогда
				
				ИменаРеквизитов.Добавить("ИННИсполнителя");
				ИменаРеквизитов.Добавить("КППИсполнителя");
				
			КонецЕсли;
			
		Иначе //универсальный формат
		
			СоответствиеРеквизитов = РаспознаваниеДокументовСлужебный.
				ПолучитьСопоставлениеРеквизитовИСвойствJSON(ТипФормализованногоДокумента);
				
			Отбор = Новый Структура;
			Отбор.Вставить("КлассСущности", ИмяРеквизита);
			Отбор.Вставить("ПодклассСущности", "Свойства");
			Отбор.Вставить("Путь", "Компания.ИНН");
			
			Нстр = СоответствиеРеквизитов.НайтиСтроки(Отбор);
			
			Если Нстр.Количество() > 0 И ИменаРеквизитов.Найти(Нстр[0].ИмяРеквизита) Тогда
				ИменаРеквизитов.Добавить(Нстр[0].ИмяРеквизита);
			КонецЕсли;
			
			Отбор.Вставить("КлассСущности", ИмяРеквизита);
			Отбор.Вставить("ПодклассСущности", "Свойства");
			Отбор.Вставить("Путь", "Компания.КПП");
			
			Нстр = СоответствиеРеквизитов.НайтиСтроки(Отбор);
			
			Если Нстр.Количество() > 0 И ИменаРеквизитов.Найти(Нстр[0].ИмяРеквизита) Тогда
				ИменаРеквизитов.Добавить(Нстр[0].ИмяРеквизита);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИменаРеквизитов;
	
КонецФункции

// Возвращает признак необходимости верификации формы
// 
// Параметры:
//  ФормаДокумента - ФормаКлиентскогоПриложения
// 
// Возвращаемое значение:
//  Булево
Функция НеобходимаВерификация(ФормаДокумента) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
		ФормаДокумента, "ВерифицируемыеРеквизитыШапки") Тогда
		
		Для Каждого Стр Из ФормаДокумента.ВерифицируемыеРеквизитыШапки Цикл
			
			Если Стр.ТребуетПроверки = Истина И Стр.Проверен = Ложь Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаДокумента, "ВерифицируемыеРеквизитыТЧ") Тогда
	
		Для Каждого Стр Из ФормаДокумента.ВерифицируемыеРеквизитыТЧ Цикл
			
			Если Стр.СтрокаУдалена = Истина Тогда
				Продолжить;
			КонецЕсли;
			
			Если Стр.ТребуетПроверки = Истина И Стр.Проверен = Ложь Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Добавляет служебные колонки и потключает обработчики событий
// 
// Параметры:
//  ДобавляемыеРеквизиты - Массив Из РеквизитФормы
//  ЭлементыОбхода - ГруппаФормы, ПолеФормы, ДекорацияФормы, ТаблицаФормы, КнопкаФормы - Элементы обхода
//  Путь - Строка
//  ДобавляемыеОбработчики - Массив из Структура, Неопределено - 
Процедура НастроитьСлужебныеКолонкиРекурсивно(
		ДобавляемыеРеквизиты, ЭлементыОбхода, Путь, ДобавляемыеОбработчики = Неопределено) Экспорт
	#Если Не ВнешнееСоединение Тогда
		
	Для Каждого ЭлементКолонка Из ЭлементыОбхода.ПодчиненныеЭлементы Цикл
		
		Если ЭлементКолонка.Вид = ВидГруппыФормы.ГруппаКолонок Тогда
			НастроитьСлужебныеКолонкиРекурсивно(ДобавляемыеРеквизиты, ЭлементКолонка, Путь, ДобавляемыеОбработчики);
		ИначеЕсли ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода Тогда
			
			ЭлементКолонка.ВыбиратьТип = Ложь;
			ЭлементКолонка.БыстрыйВыбор = Ложь;
			ЭлементКолонка.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
			ЭлементКолонка.КнопкаСоздания = Ложь;
			
			Если ДобавляемыеОбработчики <> Неопределено Тогда
				Для Каждого Обработчик Из ДобавляемыеОбработчики Цикл
					ЭлементКолонка.УстановитьДействие(Обработчик.ИмяОбработчика, Обработчик.ИмяПроцедуры);
				КонецЦикла;
			КонецЕсли;
			
			Если Не СтрЗаканчиваетсяНа(ЭлементКолонка.Имя, "ТребуетПроверки") Тогда
					
					ИмяТаблицы = СтрЗаменить(Путь, "Объект.", "");
					
					ИмяКолонки = СтрЗаменить(ЭлементКолонка.Имя, ИмяТаблицы, "");
					
					НовыйРеквизит = 
						Новый РеквизитФормы(ИмяКолонки + "ТребуетПроверки", Новый ОписаниеТипов("Булево"), Путь);
					
					ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	#КонецЕсли
	
КонецПроцедуры

// Создает элементы добавленных реквизитов.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ДобавляемыеРеквизиты - Массив из РеквизитФормы- Добавляемые реквизиты
//  ЭлементРодитель - ДекорацияФормы, КнопкаФормы, ТаблицаФормы, ГруппаФормы, ПолеФормы - Элемент родитель
Процедура СоздатьЭлементыДобавленныхРеквизитов(Форма, ДобавляемыеРеквизиты, ЭлементРодитель) Экспорт
	
	#Если Не ВнешнееСоединение Тогда
		
	Для Каждого Реквизит Из ДобавляемыеРеквизиты Цикл
		
		НовыйЭлемент = Форма.Элементы.Добавить(ЭлементРодитель.Имя+Реквизит.Имя, 
																					Тип("ПолеФормы"), ЭлементРодитель);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = Реквизит.Путь + "." + Реквизит.Имя;
		НовыйЭлемент.Видимость = Ложь;
		
	КонецЦикла;
	
	#КонецЕсли
	
КонецПроцедуры

// Заполняет поля условного оформления таблицы.
// 
// Параметры:
//  Форма - Форма, ФормаКлиентскогоПриложения - Форма
//  ИмяТаблицы - Строка - Имя таблицы
Процедура ЗаполнитьПоляУсловногоОформленияТаблицы(Форма, Знач ИмяТаблицы) Экспорт
	
	Если СтрНайти(ИмяТаблицы, "Объект.") > 0 Тогда
		
		ИмяТаблицыДляОтбора = СтрЗаменить(ИмяТаблицы, "Объект.", "");
		ТаблицаФормы = Форма.Объект[ИмяТаблицыДляОтбора];
		
	Иначе
		ТаблицаФормы = Форма[ИмяТаблицы];
		ИмяТаблицыДляОтбора = ИмяТаблицы;
	КонецЕсли;
	
	Если ТаблицаФормы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормыЗначение = ТаблицаФормы.Выгрузить();
	
	Для Каждого Строка Из ТаблицаФормы Цикл
		
		Для Каждого Колонка Из ТаблицаФормыЗначение.Колонки Цикл
			
			ИмяРеквизита = Колонка.Имя;
			
			ИмяКолонкиТребуетПроверки = ИмяРеквизита+"ТребуетПроверки";
			
			Если Строка.Свойство(ИмяКолонкиТребуетПроверки) = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			Отбор = Новый Структура;
			Отбор.Вставить("ТабличнаяЧасть", ИмяТаблицыДляОтбора);
			
			Отбор.Вставить("ИмяРеквизита", ИмяРеквизита);
			Отбор.Вставить("Идентификатор", Строка.Идентификатор);
			
			НСтр = Форма.ВерифицируемыеРеквизитыТЧ.НайтиСтроки(Отбор);
			
			Если НСтр.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Строка[ИмяКолонкиТребуетПроверки] = НСтр[0].ТребуетПроверки И Не НСтр[0].Проверен;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет служебные реквизиты при создании формы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ЗаполнитьСлужебныеРеквизитыПриСозданииФормы(Форма) Экспорт
	
	#Если Не ВнешнееСоединение Тогда
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСервисРаспознаванияДокументовДляЗаполненияКарточек") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВерифицируемыеРеквизитыПриОткрытииФормы(Форма);
	
	Если РаспознаваниеДокументовСлужебныйКлиентСервер.НужнаВерификация(Форма) Тогда
		
		ВерифицируемыеТЧ = РаспознаваниеДокументовСлужебныйКлиентСервер.ВерифицируемыеТабличныеЧасти();
		
		Для Каждого ИмяТЧ Из ВерифицируемыеТЧ Цикл
			
			ДобавляемыеРеквизиты = Новый Массив;
			
			НастроитьСлужебныеКолонкиРекурсивно(
				ДобавляемыеРеквизиты, Форма.Элементы[ИмяТЧ], Форма.Элементы[ИмяТЧ].ПутьКДанным);
				
			Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			СоздатьЭлементыДобавленныхРеквизитов(Форма, ДобавляемыеРеквизиты, Форма.Элементы[ИмяТЧ]);
				
			ИмяТЧОбъекта = "Объект."+ИмяТЧ;
			
			ЗаполнитьПоляУсловногоОформленияТаблицы(Форма, ИмяТЧОбъекта);
			РаспознаваниеДокументовСлужебныйКлиентСервер.УстановитьУсловноеОформлениеДляТаблицы(Форма, ИмяТЧОбъекта);
				
		КонецЦикла;
		
	Иначе
		
		Форма.ВерифицируемыеРеквизитыШапки.Очистить();
		Форма.ВерифицируемыеРеквизитыТЧ.Очистить();
		
	КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры

// Возвращает тип распознанного документа.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
// 
// Возвращаемое значение:
//  Неопределено, ПеречислениеСсылка.ТипыФормализованныхДокументов - Тип распознанного документа
Функция ТипРаспознанногоДокумента(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РезультатыРаспознаванияДокументов.ТипДокумента
	|ИЗ
	|	РегистрСведений.РезультатыРаспознаванияДокументов КАК РезультатыРаспознаванияДокументов
	|ГДЕ
	|	РезультатыРаспознаванияДокументов.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТипДокумента;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Добавляет в доп свойства данные верификации если есть необходимость
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ДокументОбъект - СправочникОбъект.ДокументыПредприятия
Процедура ПередЗаписьюДокументаПредприятияИзФормы(Форма, ДокументОбъект) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "РаспознанныеДанныеВерифицированы") Тогда
		Если Форма.РаспознанныеДанныеВерифицированы = Истина 
			ИЛИ (РаспознаваниеДокументовСлужебныйКлиентСервер.ДанныеДокументаНеРаспознаны(Форма) 
			И ЗначениеЗаполнено(Форма.Объект.ВидДокумента)) Тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("ДанныеВерификации", 
					РаспознаваниеДокументовСлужебныйКлиентСервер.ДанныеВерифицируемыхРеквизитов(
						Форма, Форма.РаспознанныеДанныеВерифицированы));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет форму документа верифицированными данными.
// 
// Параметры:
//  АдресВоВременномХранилище - Строка
//  Форма - ФормаКлиентскогоПриложения
Процедура ЗаполнитьДокументВерифицированнымиДанными(Знач АдресВоВременномХранилище, Форма) Экспорт
	
	ДанныеВерификации = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Если ДанныеВерификации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыВерификации = ДанныеВерификации.ТаблицыВерификации;
	ЗначенияРеквизитов = ДанныеВерификации.ЗначенияРеквизитовФормы;
	
	Если ТаблицыВерификации <> Неопределено Тогда
		Форма.ВерифицируемыеРеквизитыШапки.Загрузить(ТаблицыВерификации.ВерифицируемыеРеквизитыШапки.Выгрузить());
		Форма.ВерифицируемыеРеквизитыТЧ.Загрузить(ТаблицыВерификации.ВерифицируемыеРеквизитыТЧ.Выгрузить());
	КонецЕсли;
	
	Для Каждого Реквизит Из ЗначенияРеквизитов Цикл
		
		Если ТипЗнч(Реквизит.Значение) = Тип("ДанныеФормыКоллекция") Тогда
			
			Если Форма.Объект.Свойство(Реквизит.Ключ)  Тогда
				
				ДанныеКоллекции = Реквизит.Значение.Выгрузить();
				
				Форма.Объект[Реквизит.Ключ].Загрузить(ДанныеКоллекции);
	
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, Реквизит.Ключ) Тогда
				
				ДанныеКоллекции = Реквизит.Значение.Выгрузить();
				
				Форма[Реквизит.Ключ].Загрузить(ДанныеКоллекции);
				
			Иначе
				
				Продолжить;
				
			КонецЕсли;
			
		Иначе
			
			Если Форма.Объект.Свойство(Реквизит.Ключ) Тогда
				
				Форма.Объект[Реквизит.Ключ] = Реквизит.Значение;
				
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, Реквизит.Ключ) Тогда
				
				Форма[Реквизит.Ключ] = Реквизит.Значение;
				
			Иначе
				
				Продолжить;
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает признак того что данные документа не распознаны.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ТребуетПроверки - Неопределено, Булево - Требует проверки
// 
// Возвращаемое значение:
//  Булево - Данные документа не распознаны
Функция ДанныеДокументаНеРаспознаны(ДокументСсылка, ТребуетПроверки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВерификацияРеквизитовРаспознанныхДокументов.Документ
	|ИЗ
	|	РегистрСведений.ВерификацияРеквизитовРаспознанныхДокументов КАК ВерификацияРеквизитовРаспознанныхДокументов
	|ГДЕ
	|	ВерификацияРеквизитовРаспознанныхДокументов.Документ = &Документ
	|	И ВерификацияРеквизитовРаспознанныхДокументов.ИмяРеквизита = &ИмяРеквизита
	|	И ВерификацияРеквизитовРаспознанныхДокументов.ТребуетПроверки = &ТребуетПроверки";
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяРеквизита", 
		РаспознаваниеДокументовСлужебныйКлиентСервер.ИмяРеквизитаДокументНеРаспознан());
		
	Если ТребуетПроверки = Неопределено Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"И ВерификацияРеквизитовРаспознанныхДокументов.ТребуетПроверки = &ТребуетПроверки", "");
			
	Иначе 
			
		Запрос.УстановитьПараметр("ТребуетПроверки", ТребуетПроверки);
			
	КонецЕсли;
	
	Возврат Не Запрос.Выполнить().Пустой()
	
КонецФункции

// Возвращает признак необходимости вывода статуса распознавания в обзоре.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
// 
// Возвращаемое значение:
//  Булево - Выводить статус распознавания в обзоре
Функция ВыводитьСтатусРаспознаванияВОбзоре(Форма) Экспорт
		
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СтатусРаспознаванияДокумента")
			Тогда
				Возврат Ложь;
		КонецЕсли;
		
		Возврат ЗначениеЗаполнено(Форма.СтатусРаспознаванияДокумента)
			И Форма.СтатусРаспознаванияДокумента = Перечисления.СтатусыРаспознаванияДокументов.Распознан
			И Не ДанныеДокументаНеРаспознаны(Форма.Объект.Ссылка)
			И Не РаспознаваниеДокументовСлужебныйКлиентСервер.НужнаВерификация(Форма);
	
КонецФункции

// Заполняет служебные поля при записи реквизитов документа в регистр "ДанныеДокументовПредприятия"
// 
// Параметры:
//  Документ - СправочникОбъект.ДокументыПредприятия
//  ЗаписьРегистра - РегистрСведенийЗапись
Процедура ПриЗаписиРеквизитовДокумента(Документ, ЗаписьРегистра) Экспорт
	
	Если Документ.ДополнительныеСвойства.Свойство("ЗаполнениеРаспознаваемогоДокумента") Тогда 
		
		ИнформацияОРаспознавании = РаспознаваниеДокументов.ИнформацияОРаспознаванииДокумента(Документ.Ссылка);
		
		Если ИнформацияОРаспознавании = Неопределено Тогда
			ЗаписьРегистра.СтатусРаспознавания = Перечисления.СтатусыРаспознаванияДокументов.ПустаяСсылка();
			ЗаписьРегистра.ТребуетПроверки = Ложь;
		Иначе
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ИнформацияОРаспознавании,
				"СтатусРаспознавания, ТребуетПроверки"); 
		КонецЕсли;
		
	ИначеЕсли Документ.ДополнительныеСвойства.Свойство("ДанныеВерификации") Тогда
		
		ЗаписьРегистра.СтатусРаспознавания = Перечисления.СтатусыРаспознаванияДокументов.Распознан;
		ЗаписьРегистра.ТребуетПроверки = 
			НеобходимаВерификация(Документ.ДополнительныеСвойства.ДанныеВерификации);
		
	КонецЕсли
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьКонтрагентаПоРеквизитам(РеквизитыСоздания, ТекстОшибки)
	
	ЭтоЮридическоеЛицо = Истина;
	ИНН = "";
	
	Если РеквизитыСоздания.Свойство("ИНН") Тогда
		ИНН = РеквизитыСоздания.ИНН;
	КонецЕсли;
	
	Если СтрДлина(ИНН) = 12 Тогда
		ЭтоЮридическоеЛицо = Ложь;
	КонецЕсли;	
	
	Если ПустаяСтрока(ИНН) Тогда 
		 Возврат Неопределено;
	КонецЕсли;
	
	КПП = "";
	
	Если РеквизитыСоздания.Свойство("КПП") Тогда
		КПП = РеквизитыСоздания.КПП;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Если Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, ЭтоЮридическоеЛицо, ТекстОшибки) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
		
	Если Не РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(КПП, ТекстОшибки) Тогда
		
		КПП = "";
		
	КонецЕсли;
		
	Если ЭтоЮридическоеЛицо Тогда
		СведенияОЮрлице = КонтрагентыЛокализация.СведенияОЮридическомЛицеПоИНН(ИНН);
		СведенияОКонтрагенте = СведенияОЮрлице.ЕГРЮЛ;
	Иначе
		СведенияОКонтрагенте = КонтрагентыЛокализация.РеквизитыПредпринимателяПоИНН(ИНН);
	КонецЕсли;
	
	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	РеквизитыКонтрагента = Новый Структура;
	РеквизитыКонтрагента.Вставить("Наименование", СведенияОКонтрагенте.НаименованиеСокращенное);
	РеквизитыКонтрагента.Вставить("ИНН", СведенияОКонтрагенте.ИНН);
	
	Если КПП = "" Тогда
		РеквизитыКонтрагента.Вставить("КПП", СведенияОКонтрагенте.КПП);
	Иначе
		РеквизитыКонтрагента.Вставить("КПП", КПП);
	КонецЕсли;
	
	Контрагент = Неопределено;
	КонтрагентыЛокализация.СоздатьКонтрагентаПоРеквизитам(РеквизитыКонтрагента, Контрагент);
	
	Возврат Контрагент;
		
КонецФункции

Процедура СоздатьПоИННиДобавитьВКандидаты(РеквизитыСоздания, Кандидаты, ТекстОшибки = "")
	
	КонтрагентСсылка = СоздатьКонтрагентаПоРеквизитам(РеквизитыСоздания, ТекстОшибки);
	
	Если КонтрагентСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НовыйКандидат = Кандидаты.Добавить();
	НовыйКандидат.Ссылка = КонтрагентСсылка;
	НовыйКандидат.Коэффициент = 0;
	
	Если РеквизитыСоздания.Свойство("КПП") И РеквизитыСоздания.КПП = КонтрагентСсылка.КПП Тогда
		НовыйКандидат.Коэффициент = 1;
	Иначе
		НовыйКандидат.Коэффициент = РаспознаваниеДокументовКлиентСервер.ПорогУверенностиДляПодстановки() / 100;
	КонецЕсли;
	
КонецПроцедуры

Функция ОтборПоРеквизитам(РеквизитыОбъекта, ТипОбъекта)
	
	Отбор = Новый Массив;
	
	Если ТипОбъекта = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Или ТипОбъекта = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка") Тогда
		
		ДанныеСравнения = Новый Структура;
		
		Для Каждого Реквизит Из РеквизитыОбъекта Цикл
			
			Если Реквизит.Ключ = "ИНН" И Не ПустаяСтрока(Реквизит.Значение) Тогда
				ДобавитьОтбор(ДанныеСравнения, Реквизит, ВидСравнения.Равно);
			КонецЕсли;	
			
			Если ДанныеСравнения.Свойство("ИНН") И Реквизит.Ключ = "КПП" И Не ПустаяСтрока(Реквизит.Значение) Тогда
				ДобавитьОтбор(ДанныеСравнения, Реквизит.Значение, ВидСравнения.Равно);
			КонецЕсли;	
		
		КонецЦикла;
		
		Если ДанныеСравнения.Количество() > 0 Тогда
			Отбор.Добавить(ДанныеСравнения);
		КонецЕсли;	
			
	КонецЕсли;
	
	Возврат Отбор;
	
КонецФункции	

Процедура ДобавитьОтбор(ДанныеСравнения, ЗначениеОтбора, ВидСравнения)
	
	ДанныеСравнения.Вставить("Свойство", ЗначениеОтбора.Ключ);
	ДанныеСравнения.Вставить("ВидСравнения", ВидСравнения);
	ДанныеСравнения.Вставить("Значение", ЗначениеОтбора.Значение);
	
КонецПроцедуры	

Функция ПолучитьКандидатов(
		ПараметрыПоиска,
		ТипСсылкой,
		ПараметрыОбъединенныхРеквизитов = Неопределено,
		Отбор = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат РаспознаваниеДокументовНечеткийПоискСлужебный.НечеткийПоиск(ТипСсылкой.Метаданные(), ПараметрыПоиска, Отбор);
	
КонецФункции

Процедура ДобавитьИННКПП(ПараметрыПоиска, ИННКПП)
	
	ПараметрыПоиска.Вставить("ИНН", ИзвлечьИННКППИзСтроки(ИННКПП, "ИНН"));
	ПараметрыПоиска.Вставить("КПП", ИзвлечьИННКППИзСтроки(ИННКПП, "КПП"));
	
КонецПроцедуры

Функция УбратьОрганизационнуюФорму(Знач СтрокаПоиска)
	
	МассивЗамен = Новый Массив;
	МассивЗамен.Добавить("ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ");
	МассивЗамен.Добавить("ПУБЛИЧНОЕ АКЦИОНЕРНОЕ ОБЩЕСТВО");
	МассивЗамен.Добавить("ОТКРЫТОЕ АКЦИОНЕРНОЕ ОБЩЕСТВО");
	МассивЗамен.Добавить("ЗАКРЫТОЕ АКЦИОНЕРНОЕ ОБЩЕСТВО");
	МассивЗамен.Добавить("АКЦИОНЕРНОЕ ОБЩЕСТВО");
	МассивЗамен.Добавить("ИНДИВИДУАЛЬНЫЙ ПРЕДПРИНИМАТЕЛЬ");
	МассивЗамен.Добавить("ФЕДЕРАЛЬНОЕ ГОСУДАРСТВЕННОЕ УНИТАРНОЕ ПРЕДПРИЯТИЕ");
	
	СтрокаПоискаВРег = ВРег(СтрокаПоиска);
	Для Каждого СтрокаЗамены Из МассивЗамен Цикл
		ДлинаЗамены = СтрДлина(СтрокаЗамены);
		Если Лев(СтрокаПоискаВРег, ДлинаЗамены) = СтрокаЗамены Тогда
			СтрокаПоиска = СокрЛП(Сред(СтрокаПоиска, ДлинаЗамены + 1));
		КонецЕсли;
		Если Прав(СтрокаПоискаВРег, ДлинаЗамены) = СтрокаЗамены Тогда
			СтрокаПоиска = СокрЛП(Лев(СтрокаПоиска, СтрДлина(СтрокаПоиска) - ДлинаЗамены));
		КонецЕсли;
	КонецЦикла;
	
	Подстрока = Лев(СтрокаПоиска, 4);
	Если Подстрока = "ООО " Или Подстрока = "ПАО " Или Подстрока = "ОАО "  Или Подстрока = "ЗАО " Тогда
		СтрокаПоиска = Сред(СтрокаПоиска, 5);
	Иначе
		Подстрока = Лев(СтрокаПоиска, 3);
		Если Подстрока = "АО " Или Подстрока = "ИП " Тогда
			СтрокаПоиска = Сред(СтрокаПоиска, 4);
		ИначеЕсли Лев(СтрокаПоиска, 5) = "ФГУП " Тогда
			СтрокаПоиска = Сред(СтрокаПоиска, 6);
		КонецЕсли;
	КонецЕсли;
	
	Подстрока = Прав(СтрокаПоиска, 4);
	Если Подстрока = " ООО" Или Подстрока = " ПАО" Или Подстрока = " ОАО"  Или Подстрока = " ЗАО" Тогда
		СтрокаПоиска = Лев(СтрокаПоиска, СтрДлина(СтрокаПоиска) - 4);
	Иначе
		Подстрока = Прав(СтрокаПоиска, 3);
		Если Подстрока = " АО" Или Подстрока = " ИП" Тогда
			СтрокаПоиска = Лев(СтрокаПоиска, СтрДлина(СтрокаПоиска) - 3);
		ИначеЕсли Прав(СтрокаПоиска, 5) = " ФГУП" Тогда
			СтрокаПоиска = Лев(СтрокаПоиска, СтрДлина(СтрокаПоиска) - 5);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СокрЛП(СтрокаПоиска);
	
КонецФункции

Функция ИзвлечьСимволыИзСтроки(Строка, ДоступныеСимволы)
	
	Результат = Строка;
	Индекс = 1;
	Пока Индекс <= СтрДлина(Результат) Цикл
		ПроверяемыйСимвол = Сред(Результат, Индекс, 1);
		Если СтрНайти(ДоступныеСимволы, ПроверяемыйСимвол) = 0 Тогда
			Результат = СтрЗаменить(Результат, ПроверяемыйСимвол, "");
			Продолжить;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьНайденноеЗначение(РаспознанныеДанные, ИмяРеквизита, НомерСтроки, Значение, Уверенность, 
		НаиболееУверенноеЗначениеПройдено)
	
	Если НаиболееУверенноеЗначениеПройдено Тогда
		Возврат;
	КонецЕсли;
	
	НаиболееУверенноеЗначениеПройдено = Истина;
	Если НомерСтроки = Неопределено Тогда
		НайденнаяСтрока = РаспознанныеДанные.ТаблицаРеквизитов.Найти(ИмяРеквизита, "ИмяРеквизита");
		Если НайденнаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТаблицы", ИмяРеквизита, НомерСтроки);
		НайденныеСтроки = РаспознанныеДанные.ТаблицаРеквизитовТЧ.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Возврат;
		Иначе
			НайденнаяСтрока = НайденныеСтроки[0];
		КонецЕсли;
	КонецЕсли;
	
	НайденнаяСтрока.РаспознанноеЗначение = Значение;
	НайденнаяСтрока.УверенностьРаспознанногоЗначения = Уверенность;
	
КонецПроцедуры

Функция ОтсутствуютКандидатыСУверенностью(Кандидаты, Уверенность)
	
	Если Кандидаты.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого Кандидат Из Кандидаты Цикл
		
		Если Кандидат.Коэффициент * 100 >= Уверенность Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти