
#Область ПрограммныйИнтерфейс

// См. ОбзорПроцессовКлиент.ПредставлениеHTMLПриНажатии
// 
// Возвращаемое значение:
//  Булево - Нажатие на HTML обработано, дальнейшей обработки не требуется
Функция ПредставлениеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка, Форма) Экспорт

// Локализация
	Если ДанныеСобытия.Href = ИнтеграцияShareДокументооборотКлиентСервер.СсылкаНаИнструкциюСервисаВБЭД() Тогда
		
		ЗапуститьПриложениеАсинх(ДанныеСобытия.Href);
		Возврат Истина;
		
	КонецЕсли;
// Локализация Конец

	Возврат Ложь;

КонецФункции

#КонецОбласти
