#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НормированиеИРасценкаРаботПоТарифнымСеткам = Ложь;
	//++ НЕ УТКА
	
	//++ Локализация
	НормированиеИРасценкаРаботПоТарифнымСеткам = ПолучитьФункциональнуюОпцию("НормированиеИРасценкаРаботПоТарифнымСеткам");
	//-- Локализация
	
	//-- НЕ УТКА
	Элементы.Должность.Видимость = НормированиеИРасценкаРаботПоТарифнымСеткам;
	Элементы.ДолжностьОтбор.Видимость = НормированиеИРасценкаРаботПоТарифнымСеткам;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДолжностьОтборПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Должность",
		ДолжностьОтбор,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(ДолжностьОтбор));
КонецПроцедуры

#КонецОбласти