// @strict-types

#Область ПрограммныйИнтерфейс

// Преобразует переданную строку:
// в форматированную строку, если строка начинается с "<body>" и заканчивается "</body>";
// В противном случае строка остается без изменений.
//
// Параметры:
//  АвтопротоколБезСлужебныхТегов - Строка - исходная строка.
//
// Возвращаемое значение:
//  Строка - результат преобразования.
//
Функция ФорматированнаяСтрокаИзHTML(АвтопротоколБезСлужебныхТегов) Экспорт

	АвтопротоколДляСозданияФайла = "";

// Локализация
	АвтопротоколДляСозданияФайла = ОбщегоНазначенияДокументооборот.ФорматированнаяСтрокаИзHTML(
		АвтопротоколБезСлужебныхТегов);
// Конец Локализация

	Возврат АвтопротоколДляСозданияФайла;

КонецФункции	

#КонецОбласти