&После("ПередЗаписью")  
Процедура Расш1_ДобавитьИзделиеВПримечаниеВыработки()  
	Попытка
		Документ = ЭтотОбъект; 
		КоличествоСтрокТЧ = Документ.ВидыРабот.Количество(); 
		Для Счетчик= -(КоличествоСтрокТЧ - 1) по 0 Цикл
			СтрокаТЧ = Документ.ВидыРабот[-Счетчик]; 
			Этап = СтрокаТЧ.Распоряжение;
			Спецификация = Этап.Спецификация;
			ОсновноеИзделие = Спецификация.ОсновноеИзделиеНоменклатура;
			СтрокаТЧ.Примечание = ОсновноеИзделие.Наименование;			
		КонецЦикла;  
	Исключение
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст =  "Не удалось обработать документ";
		Сооб.Сообщить();
	КонецПопытки;
КонецПроцедуры 