
//&Вместо("ПриУстановкеНовогоНомера")
//Процедура Расш1_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
//	// Вставить содержимое обработчика.
//	
//	Если Не ЗначениеЗаполнено(Грузоотправитель)
//	Тогда
//		ВызватьИсключение "Не заполнено поле ""Грузоотпраивтель""";
//	КонецЕсли;
//	
//	Префикс = ЭТП.ПолучитьПрефиксДляОрганизации( Грузоотправитель.ИНН );
//	
//	//ПродолжитьВызов(СтандартнаяОбработка, Префикс);
//КонецПроцедуры


&После("ПриКопировании")
Процедура Расш1_ПриКопировании(ОбъектКопирования)
	
	СохранитьРеквизиты = Новый СписокЗначений;
	СохранитьРеквизиты.Добавить( ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ЗаказКлиентаГрузоваяКомпания" ) );
	СохранитьРеквизиты.Добавить( ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ЗаказКлиентаСчетДействителенВТечение" ) );
	
	КУдалению = Новый Массив;
	
	Для Каждого СТЧ Из ДополнительныеРеквизиты
	Цикл
		Если СохранитьРеквизиты.НайтиПоЗначению( СТЧ.Свойство ) = Неопределено
	        Тогда
			КУдалению.Добавить( СТЧ );
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СТМ Из КУдалению
	Цикл
		ДополнительныеРеквизиты.Удалить( СТМ );
	КонецЦикла;
	
КонецПроцедуры


//&Перед("ПередЗаписью")
//Процедура Расш1_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	//Ловушка на непонятно как происходящую очистку доп.реквизита
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ЗаказКлиентаДополнительныеРеквизиты.Свойство КАК Свойство,
//		|	ЗаказКлиентаДополнительныеРеквизиты.Значение КАК Значение
//		|ИЗ
//		|	Документ.ЗаказКлиента.ДополнительныеРеквизиты КАК ЗаказКлиентаДополнительныеРеквизиты
//		|ГДЕ
//		|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка = &Ссылка
//		|	И ЗаказКлиентаДополнительныеРеквизиты.Свойство.Имя = ""ЗаказКлиентаВключенВПланМесяца""";
//	Выб = Запрос.Выполнить().Выбрать();
//	Если Выб.Следующий() И ЗначениеЗаполнено(Выб.Значение) тогда
//		Стр = ЭтотОбъект.ДополнительныеРеквизиты.Найти(Выб.Свойство,"Свойство");
//		Если (Стр = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Стр.Значение)) тогда 
//			СигнаСтр = "#СнятиеЗащиты#";
//			Если СтрНайти(ЭтотОбъект.Комментарий, СигнаСтр) = 0 тогда
//				ВызватьИсключение "Ошибка записи ВКЛЮЧЕНО В ПЛАН, обратитесь к администратору базы данных!";
//				Отказ = Истина;
//			Иначе
//				ЭтотОбъект.Комментарий = СтрЗаменить(ЭтотОбъект.Комментарий, СигнаСтр,"");
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры
