#Область СлужебныеПроцедурыИФункции
// Возвращает языки распознавния программы.
//
// Параметры:
//  ПрограммаРаспознавания - ПеречисленниеСсылка.ПрограммыРаспознавания
//
// Возвращаемое значение:
//  ТаблицаЗначений
//    * Language - Строка
//    * Name - Строка
Функция ЯзыкиРаспознавания(ПрограммаРаспознавания) Экспорт
	Если ПрограммаРаспознавания = Перечисления.ПрограммыРаспознавания.CuneiForm Тогда
		Языки = Новый ТаблицаЗначений();
		Языки.Колонки.Добавить("Language");
		Языки.Колонки.Добавить("Name");
		Язык = Языки.Добавить();
		Язык.Language="0";
		Язык.Name = НСтр("ru = 'Английский'");
		Язык = Языки.Добавить();
		Язык.Language="1";
		Язык.Name = НСтр("ru = 'Немецкий'");
		Язык = Языки.Добавить();
		Язык.Language="2";
		Язык.Name = НСтр("ru = 'Французский'");
		Язык = Языки.Добавить();
		Язык.Language="3";
		Язык.Name = НСтр("ru = 'Русский'");
		Язык = Языки.Добавить();
		Язык.Language="4";
		Язык.Name = НСтр("ru = 'Шведский'");
		Язык = Языки.Добавить();
		Язык.Language="5";
		Язык.Name = НСтр("ru = 'Испанский'");
		Язык = Языки.Добавить();
		Язык.Language="6";
		Язык.Name = НСтр("ru = 'Итальянский'");
		Язык = Языки.Добавить();
		Язык.Language="7";
		Язык.Name = НСтр("ru = 'Русско-Английский'");
		Язык = Языки.Добавить();
		Язык.Language="8";
		Язык.Name = НСтр("ru = 'Украинский'");
		Язык = Языки.Добавить();
		Язык.Language="9";
		Язык.Name = НСтр("ru = 'Сербский'");
		Язык = Языки.Добавить();
		Язык.Language="10";
		Язык.Name = НСтр("ru = 'Хорватский'");
		Язык = Языки.Добавить();
		Язык.Language="11";
		Язык.Name = НСтр("ru = 'Польский'");
		Язык = Языки.Добавить();
		Язык.Language="12";
		Язык.Name = НСтр("ru = 'Датский'");
		Язык = Языки.Добавить();
		Язык.Language="13";
		Язык.Name = НСтр("ru = 'Португальский'");
		Язык = Языки.Добавить();
		Язык.Language="14";
		Язык.Name = НСтр("ru = 'Голландский'");
		Язык = Языки.Добавить();
		Язык.Language="19";
		Язык.Name = НСтр("ru = 'Чешский'");
		Язык = Языки.Добавить();
		Язык.Language="20";
		Язык.Name = НСтр("ru = 'Румынский'");
		Язык = Языки.Добавить();
		Язык.Language="21";
		Язык.Name = НСтр("ru = 'Венгерский'");
		Язык = Языки.Добавить();
		Язык.Language="22";
		Язык.Name = НСтр("ru = 'Болгарский'");
		Язык = Языки.Добавить();
		Язык.Language="23";
		Язык.Name = НСтр("ru = 'Словенский'");
		Язык = Языки.Добавить();
		Язык.Language="24";
		Язык.Name = НСтр("ru = 'Латышский'");
		Язык = Языки.Добавить();
		Язык.Language="25";
		Язык.Name = НСтр("ru = 'Литовский'");
		Язык = Языки.Добавить();
		Язык.Language="26";
		Язык.Name = НСтр("ru = 'Эстонский'");
		Язык = Языки.Добавить();
		Язык.Language="27";
		Язык.Name = НСтр("ru = 'Турецкий'");
		
		Возврат Языки;
	Иначе
		Языки = Новый ТаблицаЗначений();
		Языки.Колонки.Добавить("Language");
		Языки.Колонки.Добавить("Name");
		Язык = Языки.Добавить();
		Язык.Language="7";
		Язык.Name = НСтр("ru = 'Русский, Английский'");
		
		Возврат Языки;
	КонецЕсли;	
КонецФункции
#КонецОбласти