#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Спецификация           = Параметры.Спецификация;
	ТехнологическийПроцесс = Параметры.ТехнологическийПроцесс;
	КоличествоПлан         = Параметры.КоличествоПлан;
	
	Если НЕ ЗначениеЗаполнено(ТехнологическийПроцесс) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Дробь = ПроизводствоСервер.Дробь(Параметры.КоэффициентТехнологическогоПроцесса, КоличествоПлан);
	ПроизводствоСервер.СократитьДробь(Дробь);
	
	КоэффициентЧислитель = Дробь.Числитель;
	КоэффициентЗнаменатель = Дробь.Знаменатель;
	
	РассчитыватьКоэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТехнологическийПроцесс, "РассчитыватьКоэффициент");
	Если РассчитыватьКоэффициент Тогда
		Элементы.РассчитатьКоэффициент.Доступность = Истина;
	КонецЕсли;
	
	ДанныеОсновногоИзделия = Справочники.РесурсныеСпецификации.ДанныеОсновногоИзделияСпецификации(
		Спецификация);
	
	Элементы.ТехнологическийПроцесс.Заголовок = Метаданные.НайтиПоТипу(ТипЗнч(ТехнологическийПроцесс)).ПредставлениеОбъекта;
	ЕдиницаИзмеренияПредставление = Строка(ДанныеОсновногоИзделия.ЕдиницаИзмерения);
	Элементы.ДекорацияЗапланировано.Заголовок = ЕдиницаИзмеренияПредставление;
	Элементы.ДекорацияКоэффициент2.Заголовок  = ЕдиницаИзмеренияПредставление;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Закрыть(КоличествоПлан * КоэффициентЧислитель / КоэффициентЗнаменатель);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти