
&После("ОбработкаЗаполнения")
Процедура Расш1_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Попытка
		Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства И
			ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЭтапПроизводства2_2") 
			//И СтрНачинаетсяС(Отправитель.Наименование, "14 цех") 
		тогда
			СпецГрНаим = Распоряжение.Спецификация.Родитель.Наименование;
			Если СпецГрНаим = "Перепроверка" тогда
				КодОпер = "90";
			ИначеЕсли СпецГрНаим = "Передел" тогда
				КодОпер = "98";
			ИначеЕсли СпецГрНаим = "Ремонт" тогда
				КодОпер = "95";
			Иначе
				КодОпер = "01";
			КонецЕсли;
			
			ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ПеремещениеТоваровКодОперации");
			Если ЗначениеЗаполнено(ДопСвойство) тогда
				СтрДоп = ДополнительныеРеквизиты.Добавить();
				СтрДоп.Свойство = ДопСвойство;
				СтрДоп.Значение = КодОпер;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры
