Функция ВыполнитьНастройкуЭтапов( СтруктураПараметров ) экспорт
	
	СтатьяЗамена = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("ЗАМЕНА");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапПроизводства2_2.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
		|ГДЕ
		|	ЭтапПроизводства2_2.Распоряжение = &Распоряжение
		|   И ЭтапПроизводства2_2.Проведен = ИСТИНА
		|   И (ЭтапПроизводства2_2.Статус = &Статус1 ИЛИ ЭтапПроизводства2_2.Статус = &Статус2)";
	СтатусКВыполнению = Перечисления.СтатусыЭтаповПроизводства2_2.КВыполнению;
	СтатусСформирован = Перечисления.СтатусыЭтаповПроизводства2_2.Сформирован;
	//ВыходныеИзделияЭтапа = Новый Массив;
	Для Каждого Распоряжение из СтруктураПараметров.Распоряжения
	Цикл
		Запрос.УстановитьПараметр( "Распоряжение", Распоряжение );
		Запрос.УстановитьПараметр( "Статус1", СтатусКВыполнению );
		Запрос.УстановитьПараметр( "Статус2", СтатусСформирован );		
		ЭтапыПоЗаказу = Запрос.Выполнить().Выбрать();
		Пока ЭтапыПоЗаказу.Следующий()
		Цикл
			Попытка
				Этап = ЭтапыПоЗаказу.Ссылка.ПолучитьОбъект();
				Этап.Трудозатраты.Очистить(); 
				Если НЕ (Этап.Статус = СтатусКВыполнению) Тогда
					Этап.Статус = СтатусКВыполнению;
				КонецЕсли; 
				Кладовая = Справочники.СтруктураПредприятия.ЦеховаяКладоваяПоУмолчанию(Этап.Подразделение); 			
				ОбеспечениеМатериалами = Этап.ОбеспечениеМатериаламиИРаботами;
				КоличествоСтрокТЧ = ОбеспечениеМатериалами.Количество(); 
//				Для Каждого СтрокаТЧ из ОбеспечениеМатериалами Цикл
				Для Счетчик= -(КоличествоСтрокТЧ - 1) по 0 Цикл
					СтрокаТЧ = Этап.ОбеспечениеМатериаламиИРаботами[-Счетчик]; 
					РеквизитВспомогательныйМатериал = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ВспомогательныйМатериал_a6ab234c1428470d81365a2df40445b9");
					ЗначениеРеквизитаВспомогательныйМатериал = УправлениеСвойствами.ЗначениеСвойства(СтрокаТЧ.Номенклатура, РеквизитВспомогательныйМатериал);
					Если ЗначениеРеквизитаВспомогательныйМатериал <> Неопределено Тогда
//						Если ЗначениеРеквизитаВспомогательныйМатериал = Истина Тогда
							Этап.ОбеспечениеМатериаламиИРаботами.Удалить(СтрокаТЧ);	
							//Продолжить;
//						КонецЕсли;
					КонецЕсли; 
					
					//Если СтрокаТЧ.Склад <> Кладовая Тогда
					//	СтрокаТЧ.Склад = Кладовая;
					//КонецЕсли; 
					//Этап.ОбеспечениеМатериаламиИРаботами.Удалить(СтрокаТЧ);
				КонецЦикла;                                                                            
				Этап.НеОтгружатьЧастями = Ложь;
				Этап.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сооб = Новый СообщениеПользователю;
				Сооб.Текст =  "Не удалось обработать этап " + Этап.НаименованиеЭтапа;
				Сооб.КлючДанных = Этап.Ссылка;
				Сооб.Сообщить();
			КонецПопытки;
		КонецЦикла;		
	КонецЦикла;	
	
	Возврат Истина;
	
КонецФункции     

Процедура ОбъединитьСтрокиВыходныхИзделий(Этап)
	Если Этап.ВыходныеИзделия.Количество()<2 тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
		|	ЭтапПроизводства2_2ВыходныеИзделия.Характеристика КАК Характеристика,
		|	ЭтапПроизводства2_2ВыходныеИзделия.Упаковка КАК Упаковка,
		|	ЭтапПроизводства2_2ВыходныеИзделия.Получатель КАК Получатель,
		|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
		|	ЭтапПроизводства2_2ВыходныеИзделия.Серия КАК Серия,
		|	МИНИМУМ(ЭтапПроизводства2_2ВыходныеИзделия.НомерСтроки) КАК НомерСтроки,
		|	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.Количество) КАК Количество,
		|	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок) КАК КоличествоУпаковок
		|ИЗ
		|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
		|ГДЕ
		|	НЕ ЭтапПроизводства2_2ВыходныеИзделия.Произведено
		|	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Отменено
		|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура,
		|	ЭтапПроизводства2_2ВыходныеИзделия.Характеристика,
		|	ЭтапПроизводства2_2ВыходныеИзделия.Упаковка,
		|	ЭтапПроизводства2_2ВыходныеИзделия.Получатель,
		|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение,
		|	ЭтапПроизводства2_2ВыходныеИзделия.Серия
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки УБЫВ";  
	Запрос.УстановитьПараметр("Ссылка", Этап.Ссылка);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Количество() = Этап.ВыходныеИзделия.Количество() тогда 
		Возврат;
	КонецЕсли;
	Сч = Этап.ВыходныеИзделия.Количество() -1;
	Пока Выб.Следующий() цикл
		ТекСтр = Этап.ВыходныеИзделия[Сч]; 
		Пока Сч > Выб.НомерСтроки-1 цикл
			Если НЕ ТекСтр.Произведено И НЕ ТекСтр.Отменено тогда
				Этап.ВыходныеИзделия.Удалить(Сч);
			КонецЕсли;                           
			Сч = Сч-1;
			ТекСтр = Этап.ВыходныеИзделия[Сч]; 
		КонецЦикла;                              
		Если ТекСтр.Количество <> Выб.Количество тогда
			ТекСтр.Количество = Выб.Количество;
		КонецЕсли;
		Если ТекСтр.КоличествоУпаковок <> Выб.КоличествоУпаковок тогда
			ТекСтр.КоличествоУпаковок = Выб.КоличествоУпаковок;
		КонецЕсли;
		Сч = Сч-1;
	КонецЦикла;
КонецПроцедуры

Функция  ПолучитьТЧТрудозатратыИзСпецификации( Спецификация )
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РесурсныеСпецификацииТрудозатраты.Ссылка КАК Ссылка,
	|	РесурсныеСпецификацииТрудозатраты.НомерСтроки КАК НомерСтроки,
	|	РесурсныеСпецификацииТрудозатраты.ВидРабот КАК ВидРабот,
	|	РесурсныеСпецификацииТрудозатраты.Количество КАК Количество,
	|	РесурсныеСпецификацииТрудозатраты.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	РесурсныеСпецификацииТрудозатраты.Этап КАК Этап,
	|	РесурсныеСпецификацииТрудозатраты.ЭтапРедактирование КАК ЭтапРедактирование,
	|	РесурсныеСпецификацииТрудозатраты.НазначениеРабот КАК НазначениеРабот,
	|	РесурсныеСпецификацииТрудозатраты.ОтборСвойство КАК ОтборСвойство,
	|	РесурсныеСпецификацииТрудозатраты.ОтборЗначениеСвойства КАК ОтборЗначениеСвойства,
	|	РесурсныеСпецификацииТрудозатраты.АлгоритмРасчетаКоличества КАК АлгоритмРасчетаКоличества
	|ИЗ
	|	Справочник.РесурсныеСпецификации.Трудозатраты КАК РесурсныеСпецификацииТрудозатраты
	|ГДЕ
	|	РесурсныеСпецификацииТрудозатраты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр( "Ссылка", Спецификация );
	Трудозатраты = Запрос.Выполнить().Выгрузить();
	
	Возврат Трудозатраты;
КонецФункции

Функция ПолучитьТЧВыходныеИзделия( Этап )	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Количество КАК Количество,
	|	ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Произведено КАК Произведено,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Получатель КАК Получатель,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ЭтапПроизводства2_2ВыходныеИзделия.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	|ГДЕ
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр( "Ссылка", Этап );
	Ответ = Запрос.Выполнить().Выгрузить();

	Возврат Ответ;
	
КонецФункции

Функция ПолучитьНомерЦехозаходаВТехнологическомМаршруте( Маршрут, Этап, Подразделение )
	
	ПараметрыОтбора = Новый Структура("Подразделение", Подразделение );
	Строки = Маршрут.НайтиСтроки( ПараметрыОтбора );
	Если Строки.Количество() = 1
	Тогда
		Ответ= -1;
	Иначе
		Ответ = 0;
		Пока Строки[Ответ].Ссылка <> Этап
		Цикл
			Ответ = Ответ + 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция СоздатьФиктивногоИсполнителя( Наименовнаие )
	
	НовИсп = Справочники.ФизическиеЛица.СоздатьЭлемент();
	НовИсп.Наименование = Наименовнаие;
	НовИсп.Записать();
	
	Возврат НовИсп.Ссылка;
	
КонецФункции

Функция ПолучитьПредставлениеСледующегоЦехапоМаршруту( Маршрут, Этап )
	
	Ном = 0;
	Пока Маршрут[Ном].Ссылка <> Этап
	Цикл
		Ном = Ном + 1;
	КонецЦикла;
	Ном = Ном + 1;
	
	Ответ = Маршрут[Ном].ПодразделениеПредставление;
	
КонецФункции

Функция ПолучитьСоответствиеФиктивныхИсполнителей()
	Ответ = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтруктураПредприятия.Ссылка КАК Ссылка,
	|	СтруктураПредприятия.Наименование КАК Наименование,
	|	ФизЛица.Ссылка КАК ФиктивныйИсполнитель
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ФизическиеЛица.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ГДЕ
	|			НЕ ФизическиеЛица.ПометкаУдаления
	|			И НЕ ФизическиеЛица.ЭтоГруппа) КАК ФизЛица
	|		ПО СтруктураПредприятия.Наименование = ФизЛица.Ссылка.Наименование
	|ГДЕ
	|	НЕ СтруктураПредприятия.ПометкаУдаления";	
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Ответ.Вставить(Выб.Ссылка, Выб.ФиктивныйИсполнитель );
	КонецЦикла;
	
	Возврат Ответ;
КонецФункции

Функция ПолучитьТЧОбеспечениеМатериаловИУслуг( Этап )
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА РесурсныеСпецификацииВыходныеИзделия.Ссылка.Ссылка ЕСТЬ NULL
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ) КАК ЭтоМатериал,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад КАК Склад,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НомерСтроки КАК НомерСтроки,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	               |		ПО ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = РесурсныеСпецификацииВыходныеИзделия.Номенклатура
	               |			И (РесурсныеСпецификацииВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует))
	               |			И (НЕ РесурсныеСпецификацииВыходныеИзделия.Ссылка.ПометкаУдаления)
	               |ГДЕ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НомерСтроки";
	Запрос.УстановитьПараметр( "Ссылка", Этап.Ссылка );
	Ответ = Запрос.Выполнить().Выгрузить();

	Возврат Ответ;
	
КонецФункции
