#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КлючеваяОперация = РаботаСРабочимКалендаремКлиентСервер.КлючеваяОперацияОткрытиеКалендаря();
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
	ПараметрыФормы = Новый Структура("ВариантРаботыФормы", "МойКалендарь");
	ОткрытьФорму("Справочник.ЗаписиРабочегоКалендаря.Форма.Календарь", ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти