////////////////////////////////////////////////////////////////////////////////
// Модуль для работы с проектами.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПредставлениеПроектаЗадачи(Проект, ПроектнаяЗадача, ВыводитьЗадачаПроектаНеУказана = Неопределено) Экспорт 
	
	ПредставлениеПроектаЗадачи = "";
	
	Если ЗначениеЗаполнено(ПроектнаяЗадача) Тогда 
		
		ПредставлениеПроектаЗадачи = Строка(Проект) + " (" + Строка(ПроектнаяЗадача) + ")";
		
	ИначеЕсли ЗначениеЗаполнено(Проект) Тогда 
		
		Если ВыводитьЗадачаПроектаНеУказана = Неопределено Тогда 
			ВыводитьЗадачаПроектаНеУказана = РаботаСПроектами.ЕстьПроектныеЗадачи(Проект);
		КонецЕсли;	
			
		Если ВыводитьЗадачаПроектаНеУказана Тогда 
			ПредставлениеПроектаЗадачи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (Задача проекта не указана)'"),
				Строка(Проект));
		Иначе
			
			ПредставлениеПроектаЗадачи = Строка(Проект);
			
		КонецЕсли;
			
	КонецЕсли;	
	
	Возврат ПредставлениеПроектаЗадачи;
	
КонецФункции	

//Осуществляет поиск задачи в дереве задач
//Параметры:КоллекцияЗадачОдногоУровня - список задач одного уровня дерева
//			ИскомаяЗадача - задач, которую необходимо найти
//			Индекс = значение индекса найденной задачи в дереве. Если задача не найдена, 
//						значение параметра не изменяется.
Процедура НайтиЗадачуВДеревеПоСсылке(КоллекцияЗадачОдногоУровня, ИскомаяЗадача, Индекс) Экспорт
	
	Если ТипЗнч(Индекс) = Тип("Число") И Индекс > -1 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача Из КоллекцияЗадачОдногоУровня Цикл
		Если Задача.Ссылка = ИскомаяЗадача Тогда
			Индекс = Задача.ПолучитьИдентификатор();
		Иначе
			НайтиЗадачуВДеревеПоСсылке(Задача.ПолучитьЭлементы(), ИскомаяЗадача, Индекс);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Формирует имя ключевой операции "ПроектыОткрытиеСпискаПроектов".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияОткрытиеСпискаПроектов() Экспорт
	
	КлючеваяОперация = "ПроектыОткрытиеСпискаПроектов";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "ПроектыОткрытиеПроекта".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияОткрытиеПроекта() Экспорт
	
	КлючеваяОперация = "ПроектыОткрытиеПроекта";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "ПроектыЗаписьПроекта".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияЗаписьПроекта() Экспорт
	
	КлючеваяОперация = "ПроектыЗаписьПроекта";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "ПроектыОткрытиеПланаПроекта".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияОткрытиеПланаПроекта() Экспорт
	
	КлючеваяОперация = "ПроектыОткрытиеПланаПроекта";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "ПроектыОткрытиеПроектнойЗадачи".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияОткрытиеПроектнойЗадачи() Экспорт
	
	КлючеваяОперация = "ПроектыОткрытиеПроектнойЗадачи";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "ПроектыЗаписьПроектнойЗадачи".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияЗаписьПроектнойЗадачи() Экспорт
	
	КлючеваяОперация = "ПроектыЗаписьПроектнойЗадачи";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "ПроектыОткрытиеСпискаКТ".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияОткрытиеСпискаКТ() Экспорт
	
	КлючеваяОперация = "ПроектыОткрытиеСпискаКТ";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "ПроектыОткрытиеКТ".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияОткрытиеКТ() Экспорт
	
	КлючеваяОперация = "ПроектыОткрытиеКТ";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "ПроектыЗаписьКТ".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияЗаписьКТ() Экспорт
	
	КлючеваяОперация = "ПроектыЗаписьКТ";
	
	Возврат КлючеваяОперация;
	
КонецФункции

#КонецОбласти