// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает таблицу соответствия областей замещения видам задач, в части областей замещения, подчиненных "Документам".
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица соответствия областей замещения видам задач:
//   * ОбластьЗамещения - СправочникСсылка.ОбластиЗамещения - область.
//   * ВидЗадачи - СправочникСсылка.ОбластиЗамещения - вид задачи.
//
Функция ВидыЗадачДокументовПоОбластямЗамещения() Экспорт
	
	ВидыДействийЗадачПоОбластямЗамещения = Новый ТаблицаЗначений;
	ВидыДействийЗадачПоОбластямЗамещения.Колонки.Добавить("ОбластьЗамещения",
		Новый ОписаниеТипов("СправочникСсылка.ОбластиЗамещения"));
	ВидыДействийЗадачПоОбластямЗамещения.Колонки.Добавить("ВидЗадачи",
		Новый ОписаниеТипов("СправочникСсылка.ВидыЗадач"));
	
	ОбластиМенеджер = Справочники.ОбластиЗамещения;
	ВидыЗадачМенеджер = Справочники.ВидыЗадач;
	
	Стр = ВидыДействийЗадачПоОбластямЗамещения.Добавить();
	Стр.ОбластьЗамещения = ОбластиМенеджер.ДокументыИсполнение;
	Стр.ВидЗадачи = ВидыЗадачМенеджер.Исполнение;
	
	Стр = ВидыДействийЗадачПоОбластямЗамещения.Добавить();
	Стр.ОбластьЗамещения = ОбластиМенеджер.ДокументыОзнакомление;
	Стр.ВидЗадачи = ВидыЗадачМенеджер.Ознакомление;
	
	Стр = ВидыДействийЗадачПоОбластямЗамещения.Добавить();
	Стр.ОбластьЗамещения = ОбластиМенеджер.ДокументыПодписание;
	Стр.ВидЗадачи = ВидыЗадачМенеджер.Подписание;
	
	Стр = ВидыДействийЗадачПоОбластямЗамещения.Добавить();
	Стр.ОбластьЗамещения = ОбластиМенеджер.ДокументыПоручение;
	Стр.ВидЗадачи = ВидыЗадачМенеджер.Поручение;
	
	Стр = ВидыДействийЗадачПоОбластямЗамещения.Добавить();
	Стр.ОбластьЗамещения = ОбластиМенеджер.ДокументыПоручение;
	Стр.ВидЗадачи = ВидыЗадачМенеджер.Вопрос;
	
	Стр = ВидыДействийЗадачПоОбластямЗамещения.Добавить();
	Стр.ОбластьЗамещения = ОбластиМенеджер.ДокументыПоручение;
	Стр.ВидЗадачи = ВидыЗадачМенеджер.ЗапросНаПереносСрока;
	
	Стр = ВидыДействийЗадачПоОбластямЗамещения.Добавить();
	Стр.ОбластьЗамещения = ОбластиМенеджер.ДокументыРассмотрение;
	Стр.ВидЗадачи = ВидыЗадачМенеджер.Рассмотрение;
	
	Стр = ВидыДействийЗадачПоОбластямЗамещения.Добавить();
	Стр.ОбластьЗамещения = ОбластиМенеджер.ДокументыРегистрация;
	Стр.ВидЗадачи = ВидыЗадачМенеджер.Регистрация;
	
	Стр = ВидыДействийЗадачПоОбластямЗамещения.Добавить();
	Стр.ОбластьЗамещения = ОбластиМенеджер.ДокументыСогласование;
	Стр.ВидЗадачи = ВидыЗадачМенеджер.Согласование;
	
	Стр = ВидыДействийЗадачПоОбластямЗамещения.Добавить();
	Стр.ОбластьЗамещения = ОбластиМенеджер.ДокументыУтверждение;
	Стр.ВидЗадачи = ВидыЗадачМенеджер.Утверждение;
	
	Возврат ВидыДействийЗадачПоОбластямЗамещения;
	
КонецФункции

#КонецОбласти
