#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяПометкаУдаления = Объект.ПометкаУдаления;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбъектЗаписан = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияДокументооборотКлиент.ПередЗакрытием(
		Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка, Модифицированность) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ПометкаУдаления <> ТекущаяПометкаУдаления Или ОбъектЗаписан Тогда
		Оповестить("Запись_ГруппаКонтрагентов", Объект.Ссылка, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
