
#Область ПрограммныйИнтерфейс

// Заполняет данные ключевых операций.
// 
// Параметры:
//  ДанныеКлючевыхОпераций - см. ОбщегоНазначенияДокументооборот.НовыеДанныеКлючевыхОпераций
// 
Процедура ЗаполнитьДанныеКлючевыхОпераций(ДанныеКлючевыхОпераций) Экспорт
	
	КодОсновногоЯзыка = МультиязычностьСервер.СведенияОЯзыках().ОсновнойЯзык;
	
	ДанныеКлючевойОперации = ДанныеКлючевыхОпераций.Добавить();
	ДанныеКлючевойОперации.Имя = РаботаСКонтрагентамиДокументооборотКлиентСервер.КлючеваяОперацияЗаписьКонтрагента();
	ДанныеКлючевойОперации.Наименование = НСтр("ru = 'Контрагенты: Запись контрагента'", КодОсновногоЯзыка);
	ДанныеКлючевойОперации.ЦелевоеВремя = 2;
	
	ДанныеКлючевойОперации = ДанныеКлючевыхОпераций.Добавить();
	ДанныеКлючевойОперации.Имя = РаботаСКонтрагентамиДокументооборотКлиентСервер.КлючеваяОперацияОткрытиеКонтрагента();
	ДанныеКлючевойОперации.Наименование = НСтр("ru = 'Контрагенты: Открытие контрагента'", КодОсновногоЯзыка);
	ДанныеКлючевойОперации.ЦелевоеВремя = 2;
	
	ДанныеКлючевойОперации = ДанныеКлючевыхОпераций.Добавить();
	ДанныеКлючевойОперации.Имя =
		РаботаСКонтрагентамиДокументооборотКлиентСервер.КлючеваяОперацияОткрытиеСпискаКонтрагентов();
	ДанныеКлючевойОперации.Наименование = НСтр("ru = 'Контрагенты: Открытие списка контрагентов'", КодОсновногоЯзыка);
	ДанныеКлючевойОперации.ЦелевоеВремя = 3;
	
	ДанныеКлючевойОперации = ДанныеКлючевыхОпераций.Добавить();
	ДанныеКлючевойОперации.Имя =
		РаботаСКонтрагентамиДокументооборотКлиентСервер.КлючеваяОперацияОткрытиеФормыВыбораКонтрагента();
	ДанныеКлючевойОперации.Наименование = НСтр("ru = 'Контрагенты: Открытие формы выбора контрагента'", КодОсновногоЯзыка);
	ДанныеКлючевойОперации.ЦелевоеВремя = 3;
	
	ДанныеКлючевойОперации = ДанныеКлючевыхОпераций.Добавить();
	ДанныеКлючевойОперации.Имя = РаботаСКонтрагентамиДокументооборотКлиентСервер.
		КлючеваяОперацияткрытиеФормыВыбораКонтрагентаКонтактногоЛицаВИсходящемДокументе();
	ДанныеКлючевойОперации.Наименование =
		НСтр("ru = 'Контрагенты: Открытие формы выбора контрагента и контактного лица в исходящем документе'",
		КодОсновногоЯзыка);
	ДанныеКлючевойОперации.ЦелевоеВремя = 3;
	
	ДанныеКлючевойОперации = ДанныеКлючевыхОпераций.Добавить();
	ДанныеКлючевойОперации.Имя = РаботаСКонтрагентамиДокументооборотКлиентСервер.КлючеваяОперацияСозданиеКонтрагента();
	ДанныеКлючевойОперации.Наименование = НСтр("ru = 'Контрагенты: Создание контрагента'", КодОсновногоЯзыка);
	ДанныеКлючевойОперации.ЦелевоеВремя = 2;
	
КонецПроцедуры

#КонецОбласти
