
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Находит имена следующий действий после указанного элемента.
// Рекурсивная процедура.
//
// Параметры:
//  ИменаПоследующихДействий - Массив - в этот параметр помещается результат.
//  Элемент - Строка - имя элемента, после которого ищутся действия.
//  Схема - СправочникОбъект.УдалитьСхемыКомплексныхПроцессов - объект схемы.
//
Процедура НайтиИменаПоследующихДействий(ИменаПоследующихДействий, Элемент, Схема) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяПредшественника", Элемент);
	ПоследователиЭлемента = Схема.ПредшественникиЭлементовСхемы.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаТаблицы Из ПоследователиЭлемента Цикл
		ТипПоследователя = Схема.ЭлементыСхемы.Найти(СтрокаТаблицы.Имя, "Имя").Тип;
		
		Если ТипПоследователя = Перечисления.УдалитьТипыЭлементовСхемыКомплексногоПроцесса.Действие
			Или ТипПоследователя = Перечисления.УдалитьТипыЭлементовСхемыКомплексногоПроцесса.ВложенныйПроцесс Тогда
			
			ИменаПоследующихДействий.Добавить(СтрокаТаблицы.Имя);
		Иначе
			НайтиИменаПоследующихДействий(ИменаПоследующихДействий, СтрокаТаблицы.Имя, Схема);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает ссылку на схему процесса по схеме комплексного процесса.
// 
// Параметры:
//  СхемаКП - СправочникСсылка.УдалитьСхемыКомплексныхПроцессов
// 
// Возвращаемое значение:
//  СправочникСсылка.СхемыПроцессов
//  
Функция СсылкаНаСхемуПроцессаПоСхемеКомплексногоПроцесса(СхемаКП) Экспорт
	
	Возврат Справочники.СхемыПроцессов.ПолучитьСсылку(СхемаКП.УникальныйИдентификатор());
	
КонецФункции

// Возвращает графическую схему для спр. СхемаПроцесса по графической схеме для
// спр. УдалитьСхемыКомплексныхПроцессов (СхемыКомплексныхПроцессов).
// 
// Параметры:
//  СхемаКП - ГрафическаяСхема
// 
// Возвращаемое значение:
//  ГрафическаяСхема
//
Функция ГрафическаяСхемаПроцессаПоСхемеКомплексногоПроцесса(СхемаКП) Экспорт
	
	СхемаXDTO = СериализаторXDTO.ЗаписатьXDTO(СхемаКП);
	
	ТипВложенногоПроцесса = 10;
	ТипДействия = 5;
	
	ИндексЭлемента = СхемаXDTO.item.Количество() - 1;
	
	Пока ИндексЭлемента >= 0 Цикл
		
		ЭлементXDTO = СхемаXDTO.item[ИндексЭлемента];
			
		Если ЭлементXDTO.itemType = ТипВложенногоПроцесса Тогда
			СхемаXDTO.item.Добавить(ВложенныйПроцессXDTOДляСхемыПроцесса(ЭлементXDTO));
			СхемаXDTO.item.Удалить(ИндексЭлемента);
		ИначеЕсли ЭлементXDTO.itemType = ТипДействия Тогда
			СхемаXDTO.item.Добавить(ДействиеXDTOДляСхемыПроцесса(ЭлементXDTO));
			СхемаXDTO.item.Удалить(ИндексЭлемента);
		КонецЕсли;
		
		ИндексЭлемента = ИндексЭлемента - 1;
		
	КонецЦикла;
			
	Возврат СериализаторXDTO.ПрочитатьXDTO(СхемаXDTO);
	
КонецФункции

// Возвращает типы элементов схемы процесса по схеме комплексного процесса.
// 
// Параметры:
//  СхемаКП - ГрафическаяСхема 
// 
// Возвращаемое значение:
//   Соответствие из КлючИЗначение:
//    * Ключ - Строка - имя элемента графической схемы
//    * Значение - ПеречислениеСсылка.ТипыЭлементовСхемПроцессов 
//  
Функция ТипыЭлементовСхемыПроцессаПоСхемеКомплексногоПроцесса(СхемаКП) Экспорт
	
	ТипыЭлементов = Новый Соответствие();
	
	Для Каждого ЭлементСхемы Из СхемаКП.ЭлементыГрафическойСхемы Цикл
		
		ТипЭлемента = ТипЗнч(ЭлементСхемы);
		Если ТипЭлемента = Тип("ЭлементГрафическойСхемыСоединительнаяЛиния") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЭлемента = Тип("ЭлементГрафическойСхемыВложенныйБизнесПроцесс") Тогда
			
			ТипыЭлементов[ЭлементСхемы.Имя] = Перечисления.ТипыЭлементовСхемПроцессов.ВложенныйПроцесс;
						
		ИначеЕсли  ТипЭлемента = Тип("ЭлементГрафическойСхемыДействие") Тогда
			
			ТипыЭлементов[ЭлементСхемы.Имя] = Перечисления.ТипыЭлементовСхемПроцессов.Действие;
						
		ИначеЕсли  ТипЭлемента = Тип("ЭлементГрафическойСхемыДекоративнаяЛиния") Тогда
			
			ТипыЭлементов[ЭлементСхемы.Имя] = Перечисления.ТипыЭлементовСхемПроцессов.ДекоративнаяЛиния;
						 			 			
		ИначеЕсли  ТипЭлемента = Тип("ЭлементГрафическойСхемыДекорация") Тогда
			
			ТипыЭлементов[ЭлементСхемы.Имя] = Перечисления.ТипыЭлементовСхемПроцессов.Декорация;
			
		ИначеЕсли  ТипЭлемента = Тип("ЭлементГрафическойСхемыЗавершение") Тогда
			
			ТипыЭлементов[ЭлементСхемы.Имя] = Перечисления.ТипыЭлементовСхемПроцессов.Завершение;
				
		ИначеЕсли  ТипЭлемента = Тип("ЭлементГрафическойСхемыОбработка") Тогда
			
			ТипыЭлементов[ЭлементСхемы.Имя] = Перечисления.ТипыЭлементовСхемПроцессов.Скрипт;
			
		ИначеЕсли  ТипЭлемента = Тип("ЭлементГрафическойСхемыРазделение") Тогда
			
			ТипыЭлементов[ЭлементСхемы.Имя] = Перечисления.ТипыЭлементовСхемПроцессов.Разделение;
								
		ИначеЕсли  ТипЭлемента = Тип("ЭлементГрафическойСхемыСлияние") Тогда
			
			ТипыЭлементов[ЭлементСхемы.Имя] = Перечисления.ТипыЭлементовСхемПроцессов.Слияние;
			
		ИначеЕсли  ТипЭлемента = Тип("ЭлементГрафическойСхемыСтарт") Тогда
			
			ТипыЭлементов[ЭлементСхемы.Имя] = Перечисления.ТипыЭлементовСхемПроцессов.Старт;
			
		ИначеЕсли  ТипЭлемента = Тип("ЭлементГрафическойСхемыУсловие") Тогда
			
			ТипыЭлементов[ЭлементСхемы.Имя] = Перечисления.ТипыЭлементовСхемПроцессов.Условие;
			
		Иначе
			
			ВызватьИсключение 
				НСтр("ru = 'Графическая схема содержит недопустимые элементы для справочника Схемы процессов.'",
				ОбщегоНазначения.КодОсновногоЯзыка());
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТипыЭлементов;
	
КонецФункции

// Возвращает результаты действия в условии схемы для новой структуры данных.
// 
// Параметры:
//  РезультатВыполненияВСхемеКП - ПеречислениеСсылка.РезультатыВыполненияДействийКомплексныхПроцессов
//                                результат в предыдущей структуре схем.
//  ИмяДействия - Строка - имя действия в схеме комплексного процесса. 
//  ПараметрыДействий - ТабличнаяЧасть, ТаблицаЗначений - таблица с параметрами действий,
//                      соответствующая СправочникОбъект.УдалитьСхемыКомплексныхПроцессов.ПараметрыДействий
// 
// Возвращаемое значение:
//  Массив
//   * ПеречислениеСсылка.РезультатыПроцессаПодписания
//   * ПеречислениеСсылка.ОбщиеРезультатыПриглашения
//   * ПеречислениеСсылка.РезультатыРегистрации
//   * ПеречислениеСсылка.РезультатыСогласования
//   * ПеречислениеСсылка.РезультатыУтверждения
//   * Строка - см. РезультатВыполненияДействияКомплексногоПроцессаЗавершено
//
Функция РезультатыДействияВУсловииСхемыДляНовойСтруктурыДанных(
	РезультатВыполненияВСхемеКП, ИмяДействия, ПараметрыДействий) Экспорт
	
	РезультатыДействия = Новый Массив;
	
	ПараметрыДействия = ПараметрыДействий.Найти(ИмяДействия, "Имя");
	Если ПараметрыДействия = Неопределено Тогда
		Возврат РезультатыДействия; 
	КонецЕсли;
	
	РезультатЗавершено = 
		РаботаСКомплекснымиБизнесПроцессамиКлиентСервер.
		РезультатВыполненияДействияКомплексногоПроцессаЗавершено();
	
	ТипНастройки = ТипЗнч(ПараметрыДействия.ШаблонПроцесса);
	
	РезультатыВыполнения = Перечисления.РезультатыВыполненияДействийКомплексныхПроцессов; 
	
	Если ТипНастройки = Тип("СправочникСсылка.ШаблоныИсполнения")
		Или ТипНастройки = Тип("СправочникСсылка.ШаблоныОзнакомления")
		Или ТипНастройки = Тип("СправочникСсылка.ШаблоныРассмотрения")
		Или РезультатВыполненияВСхемеКП = РезультатыВыполнения.ЗавершеноСЛюбымРезультатом Тогда
				
		РезультатыДействия.Добавить(РезультатЗавершено.Значение);
	КонецЕсли;
	
	Если ТипНастройки = Тип("СправочникСсылка.ШаблоныПодписания") Тогда
		Если РезультатВыполненияВСхемеКП = РезультатыВыполнения.Положительно Тогда
			РезультатыДействия.Добавить(Перечисления.РезультатыПроцессаПодписания.Подписано);
		ИначеЕсли РезультатВыполненияВСхемеКП = РезультатыВыполнения.Отрицательно Тогда
			РезультатыДействия.Добавить(Перечисления.РезультатыПроцессаПодписания.НеПодписано);
		КонецЕсли;
	ИначеЕсли ТипНастройки = Тип("СправочникСсылка.ШаблоныПриглашения") Тогда
		Если РезультатВыполненияВСхемеКП = РезультатыВыполнения.Положительно Тогда
			РезультатыДействия.Добавить(
				Перечисления.ОбщиеРезультатыПриглашения.ПринятоВсемиУчастниками);
			РезультатыДействия.Добавить(
				Перечисления.ОбщиеРезультатыПриглашения.ПринятоОбязательнымиУчастниками);
		ИначеЕсли РезультатВыполненияВСхемеКП = РезультатыВыполнения.Отрицательно Тогда
			РезультатыДействия.Добавить(
				Перечисления.ОбщиеРезультатыПриглашения.НеПринятоВсемиУчастниками);
			РезультатыДействия.Добавить(
				Перечисления.ОбщиеРезультатыПриглашения.НеПринятоОбязательнымиУчастниками);
		КонецЕсли;		
	ИначеЕсли ТипНастройки = Тип("СправочникСсылка.ШаблоныРегистрации") Тогда
		Если РезультатВыполненияВСхемеКП = РезультатыВыполнения.Положительно Тогда
			РезультатыДействия.Добавить(Перечисления.РезультатыРегистрации.Зарегистрировано);
		ИначеЕсли РезультатВыполненияВСхемеКП = РезультатыВыполнения.Отрицательно Тогда
			РезультатыДействия.Добавить(Перечисления.РезультатыРегистрации.НеЗарегистрировано);
		КонецЕсли;
	ИначеЕсли ТипНастройки = Тип("СправочникСсылка.ШаблоныСогласования") Тогда
		Если РезультатВыполненияВСхемеКП = РезультатыВыполнения.ПоложительноБезЗамечаний Тогда
			РезультатыДействия.Добавить(Перечисления.РезультатыСогласования.Согласовано);
		ИначеЕсли РезультатВыполненияВСхемеКП = РезультатыВыполнения.ПоложительноСЗамечаниями Тогда
			РезультатыДействия.Добавить(Перечисления.РезультатыСогласования.СогласованоСЗамечаниями);	
		ИначеЕсли РезультатВыполненияВСхемеКП = РезультатыВыполнения.Положительно Тогда
			РезультатыДействия.Добавить(Перечисления.РезультатыСогласования.Согласовано);
			РезультатыДействия.Добавить(Перечисления.РезультатыСогласования.СогласованоСЗамечаниями);
		ИначеЕсли РезультатВыполненияВСхемеКП = РезультатыВыполнения.Отрицательно Тогда
			РезультатыДействия.Добавить(Перечисления.РезультатыСогласования.НеСогласовано);
		КонецЕсли;
	ИначеЕсли ТипНастройки = Тип("СправочникСсылка.ШаблоныУтверждения") Тогда
		Если РезультатВыполненияВСхемеКП = РезультатыВыполнения.Положительно Тогда
			РезультатыДействия.Добавить(Перечисления.РезультатыУтверждения.Утверждено);
		ИначеЕсли РезультатВыполненияВСхемеКП = РезультатыВыполнения.Отрицательно Тогда
			РезультатыДействия.Добавить(Перечисления.РезультатыУтверждения.НеУтверждено);
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатыДействия;
	
КонецФункции

// Проверяет является ли элемент с именем вложенным процессом.
// 
// Параметры:
//  ИмяЭлемента Строка - имя элемента в схеме КП.
//  ЭлементыСхемы - ТабличнаяЧасть, ТаблицаЗначений - таблица с элементами схемы,
//                  соответствующая СправочникОбъект.УдалитьСхемыКомплексныхПроцессов.ЭлементыСхемы
// 
// Возвращаемое значение:
//  Булево
//
Функция ЭтоВложенныйПроцессВСхемеКП(ИмяЭлемента, ЭлементыСхемы) Экспорт
	
	СтрокаЭлемента = ЭлементыСхемы.Найти(ИмяЭлемента, "Имя");
	Если СтрокаЭлемента <> Неопределено
		
		И СтрокаЭлемента.Тип = 
		Перечисления.УдалитьТипыЭлементовСхемыКомплексногоПроцесса.ВложенныйПроцесс Тогда
		
		Возврат Истина;
	КонецЕсли; 

	Возврат Ложь;
	
КонецФункции

// Возвращает ссылку на скрипт условия проверки завершенности вложенного процесса
// с именем в схеме процесса. 
// 
// Параметры:
//  ИмяЭлемента - Строка - имя вложенного процесса в схеме.
//  Группа 
// 
// Возвращаемое значение:
//  СправочникСсылка.СкриптыУсловийСхемДляКомплексныхПроцессов
//
Функция СкриптПроверкиЗавершенностиВложенногоПроцесса(ИмяЭлемента, Группа = Неопределено) Экспорт
	
	ВыражениеСкрипта =
		"ИмяЭлемента = ""%1"";
		|
		|ПроцесыЭлементов =
		|	РаботаСКомплекснымиБизнесПроцессамиСервер.ПроцессыЭлементовСхемыПоКомплексномуПроцессу(
		|	Параметры.ПроцессОбъект.Ссылка);
		|
		|ПроцессЭлемента = ПроцесыЭлементов[ИмяЭлемента];
		|
		|Результат = ЗначениеЗаполнено(ПроцессЭлемента)
		|	И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроцессЭлемента, ""Завершен"");";
		
	ВыражениеСкрипта = СтрШаблон(ВыражениеСкрипта, ИмяЭлемента);
	
	ХешВыржаения =
		РаботаСКомплекснымиБизнесПроцессамиСервер.ХешВыржаенияНаВстроенномЯзыке(ВыражениеСкрипта);
	
	СкриптСхемы = Справочники.СкриптыУсловийСхемДляКомплексныхПроцессов.
		СкриптСхемыПоХешуВыражения(ХешВыржаения);
	
	Если ЗначениеЗаполнено(СкриптСхемы) Тогда
		Возврат СкриптСхемы;
	КонецЕсли;
	
	СкриптыСхемОбъект = Справочники.СкриптыУсловийСхемДляКомплексныхПроцессов.СоздатьЭлемент();
	
	СкриптыСхемОбъект.Наименование = СтрШаблон(
		НСтр("ru = 'Вложенный процесс ""%1"" завершен.'"),
		ИмяЭлемента);	
		
	СкриптыСхемОбъект.Выражение = ВыражениеСкрипта;
	СкриптыСхемОбъект.ХешВыражения = ХешВыржаения;
	СкриптыСхемОбъект.ДатаСоздания = ТекущаяДата();
	СкриптыСхемОбъект.ДатаИзменения = СкриптыСхемОбъект.ДатаСоздания;
	
	СкриптыСхемОбъект.Родитель = Группа;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СкриптыСхемОбъект);
	
	Возврат СкриптыСхемОбъект.Ссылка;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает действие для схемы процесса в виде XDTO объекта, по 
// XDTO действия схемы комплексного процесса.
// 
// Параметры:
//  ДействиеXDTOДляКП - ОбъектXDTO - XDTO действия схемы комплексного процесса
// 
// Возвращаемое значение:
//  ОбъектXDTO
//
Функция ДействиеXDTOДляСхемыПроцесса(ДействиеXDTOДляКП)
	
	СхемаСШаблоном = СериализаторXDTO.ЗаписатьXDTO(
		Справочники.СхемыПроцессов.ПолучитьМакет("ШаблонЭлементаДействие"));
	
	ДействиеXDTO = Неопределено;
	Для Каждого ЭлементШаблон Из СхемаСШаблоном.item Цикл
		Если ЭлементШаблон.itemType = 9 Тогда
			ДействиеXDTO = ЭлементШаблон;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПереносимыеРеквизиты =
		"itemId,
		|itemCode,
		|itemTabOrder,
		|rectLeft,
		|rectRight,
		|rectTop,
		|rectBottom,
		|zOrder,
		|groupNum,
		|pointUUID,
		|currentLanguage";
	
	ЗаполнитьЗначенияСвойств(ДействиеXDTO, ДействиеXDTOДляКП, ПереносимыеРеквизиты);
	
	ДействиеXDTO.itemTitle.item[0].lang = ДействиеXDTOДляКП.itemTitle.item[0].lang;
	ДействиеXDTO.itemTitle.item[0].content = ДействиеXDTOДляКП.itemTitle.item[0].content;
	
	ДействиеXDTO.point[0].x = ДействиеXDTOДляКП.point[0].x;
	ДействиеXDTO.point[0].y = ДействиеXDTOДляКП.point[0].y;
	ДействиеXDTO.point[1].x = ДействиеXDTOДляКП.point[1].x;
	ДействиеXDTO.point[1].y = ДействиеXDTOДляКП.point[1].y;
	ДействиеXDTO.point[2].x = ДействиеXDTOДляКП.point[2].x;
	ДействиеXDTO.point[2].y = ДействиеXDTOДляКП.point[2].y;
	ДействиеXDTO.point[3].x = ДействиеXDTOДляКП.point[3].x;
	ДействиеXDTO.point[3].y = ДействиеXDTOДляКП.point[3].y;
	
	Возврат ДействиеXDTO;
	
КонецФункции

// Возвращает вложенный процесс для схемы процесса в виде XDTO объекта, по 
// XDTO вложенного процесса по схеме комплексного процесса.
// 
// Параметры:
//  ДействиеXDTOДляКП - ОбъектXDTO - XDTO вложенного процесса схемы комплексного процесса
// 
// Возвращаемое значение:
//  ОбъектXDTO
//
Функция ВложенныйПроцессXDTOДляСхемыПроцесса(ВложенныйПроцессXDTOДляКП)
	
	СхемаСШаблоном = СериализаторXDTO.ЗаписатьXDTO(
		Справочники.СхемыПроцессов.ПолучитьМакет("ШаблонЭлементаВложенныйПроцесс"));
	
	ВложенныйПроцессXDTO = Неопределено;
	Для Каждого ЭлементШаблон Из СхемаСШаблоном.item Цикл
		Если ЭлементШаблон.itemType = 9 Тогда
			ВложенныйПроцессXDTO = ЭлементШаблон;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПереносимыеРеквизиты =
		"itemId,
		|itemCode,
		|itemTabOrder,
		|rectLeft,
		|rectRight,
		|rectTop,
		|rectBottom,
		|zOrder,
		|groupNum,
		|pointUUID,
		|currentLanguage";
	
	ЗаполнитьЗначенияСвойств(ВложенныйПроцессXDTO, ВложенныйПроцессXDTOДляКП, ПереносимыеРеквизиты);
	
	ВложенныйПроцессXDTO.itemTitle.item[0].lang = ВложенныйПроцессXDTOДляКП.itemTitle.item[0].lang;
	
	ВложенныйПроцессXDTO.itemTitle.item[0].content = 
		ВложенныйПроцессXDTOДляКП.itemTitle.item[0].content;
	
	ВложенныйПроцессXDTO.point[0].x = ВложенныйПроцессXDTOДляКП.point[0].x;
	ВложенныйПроцессXDTO.point[0].y = ВложенныйПроцессXDTOДляКП.point[0].y;
	ВложенныйПроцессXDTO.point[1].x = ВложенныйПроцессXDTOДляКП.point[1].x;
	ВложенныйПроцессXDTO.point[1].y = ВложенныйПроцессXDTOДляКП.point[1].y;
	ВложенныйПроцессXDTO.point[2].x = ВложенныйПроцессXDTOДляКП.point[2].x;
	ВложенныйПроцессXDTO.point[2].y = ВложенныйПроцессXDTOДляКП.point[2].y;
	ВложенныйПроцессXDTO.point[3].x = ВложенныйПроцессXDTOДляКП.point[3].x;
	ВложенныйПроцессXDTO.point[3].y = ВложенныйПроцессXDTOДляКП.point[3].y;
	
	Возврат ВложенныйПроцессXDTO;
	
КонецФункции

#КонецОбласти

#КонецЕсли