
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак использования внешнего сервиса вставки ЭП
//
// Возвращаемое значение:
//   Булево
//
Функция ИспользуетсяВнешнийСервисВставкиШтампаЭП() Экспорт
	
	Возврат ВизуализацияЛокализация.ИспользуетсяВнешнийСервисВставкиШтампаЭП();
	
КонецФункции

// Возвращает массив грифов доступа для внешнего сервиса вставки ЭП. Если пусто , то любые допустимы.
//
// Возвращаемое значение:
//   Массив из СправочникССылка.ГрифыДоступа
//
Функция ГрифыДоступаДляВнешнегоСервиса() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	МассивГрифов = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивГрифов,
		ВизуализацияЛокализация.ГрифыДоступаДляВнешнегоСервиса());
	
	Возврат МассивГрифов;
	
КонецФункции

// Возвращает массив видов документов для внешнего сервиса вставки ЭП. Если пусто , то любые допустимы.
//
// Возвращаемое значение:
//   Массив из СправочникССылка.ВидыДокументов
//
Функция ВидыДокументовДляВнешнегоСервиса() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	МассивВидов = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидов,
		ВизуализацияЛокализация.ВидыДокументовДляВнешнегоСервиса());
	
	Возврат МассивВидов;
	
КонецФункции

// Возвращает вариант вставки штампа "Раздвигая текст,  Над текстом"
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ВариантыВставкиШтампа
//
Функция ВариантВставкиШтампа() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ВариантВставкиШтампа.Получить();
	
КонецФункции

#КонецОбласти
