#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Обновляет значение константы:
// Если включены механизмы, использующие отметки, константа включается, иначе выключается.
// 
Процедура ОбновитьЗначение() Экспорт
	
	ИспользоватьКОД = Ложь;

	ИспользоватьОтметкиВремени =
		Константы.ИнтеграцияС1САрхивом.Получить() = Истина
			Или Константы.ПереходСтадия.Получить() > 0
			Или ИспользоватьКОД = Истина;
	
	Если Получить() <> ИспользоватьОтметкиВремени Тогда
		Установить(ИспользоватьОтметкиВремени);
	КонецЕсли;
	
КонецПроцедуры

// Выполняеи включение регламентного задания ОтметкиВремени.Обработка
//
Процедура ВключитьРегламентноеЗадание() Экспорт
	
	РегламентныеЗаданияСервер.УстановитьИспользованиеРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ОтметкиВремениОбработка, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли