#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.РеестрМоихДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.ДокументПредприятия.Установить(ДокументПредприятия);
	
	Если Не ПометкаУдаления Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Пользователь = Пользователь;
		НоваяЗапись.ДатаСортировки = ДатаСортировки;
		НоваяЗапись.ДокументПредприятия = ДокументПредприятия;
		НоваяЗапись.БезОтвета = БезОтвета;
		НоваяЗапись.ВидДокумента = ВидДокумента;
		НоваяЗапись.ДобавленВручную = ДобавленВручную;
		НоваяЗапись.БезОтвета = БезОтвета;
		НоваяЗапись.Истекает = Истекает;
		НоваяЗапись.НазначенаЗадачаМне = НазначенаЗадачаМне;
		НоваяЗапись.ОтправленаЗадачаОтМеня = ОтправленаЗадачаОтМеня;
		НоваяЗапись.ПредставлениеДокумента = ПредставлениеДокумента;
		НоваяЗапись.Проект = Проект;
		НоваяЗапись.Просрочен = Просрочен;
		НоваяЗапись.ЯвляюсьАвторомДокумента = ЯвляюсьАвторомДокумента;
		НоваяЗапись.ЯвляюсьАвторомУтвержденияДокумента = ЯвляюсьАвторомУтвержденияДокумента;
		НоваяЗапись.ЯвляюсьОтветственнымЗаДокумент = ЯвляюсьОтветственнымЗаДокумент;
		НоваяЗапись.ЯвляюсьПодписантомДокумента = ЯвляюсьПодписантомДокумента;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.КоличествоМоихДокументов.Записывать = Истина;
	Движение = Движения.КоличествоМоихДокументов.Добавить();
	Движение.Период = Дата;
	Движение.ДобавленВручную = ДобавленВручную;
	Движение.НазначенаЗадачаМне = НазначенаЗадачаМне;
	Движение.ОтправленаЗадачаОтМеня = ОтправленаЗадачаОтМеня;
	Движение.Пользователь = Пользователь;
	Движение.Проект = Проект;
	Движение.ЯвляюсьАвторомДокумента = ЯвляюсьАвторомДокумента;
	Движение.ЯвляюсьАвторомУтвержденияДокумента = ЯвляюсьАвторомУтвержденияДокумента;
	Движение.ЯвляюсьОтветственнымЗаДокумент = ЯвляюсьОтветственнымЗаДокумент;
	Движение.ЯвляюсьПодписантомДокумента = ЯвляюсьПодписантомДокумента;
	Движение.БезОтвета = ?(БезОтвета, 1, 0);
	Движение.Всего = 1;
	Движение.Истекающих = ?(Истекает, 1, 0);
	Движение.Просроченных = ?(Просрочен, 1, 0);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли