&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)    
	
	ИспользованиеВстроеннойИЛегкойПочтыНастройка = ВстроеннаяПочтаКлиент.ВстроеннаяИлиЛегкаяПочтаИспользуется();
	ВстроеннаяИлиЛегкаяПочтаДоступна = ВстроеннаяПочтаКлиент.ВстроеннаяИлиЛегкаяПочтаДоступна(ИспользованиеВстроеннойИЛегкойПочтыНастройка);
	
	Если Не ВстроеннаяИлиЛегкаяПочтаДоступна Тогда
		ТекстСообщения = НСтр("ru = 'Для отправки письма включите персональную настройку ""Встроенная"" или ""Легкая почта"".'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ИспользованиеВстроеннойИЛегкойПочтыНастройка.ИспользованиеВстроеннойПочты Тогда	
		
		ВстроеннаяПочтаКлиент.СоздатьПисьмоНаОснованииФайлов(ПараметрКоманды);
		
	ИначеЕсли ИспользованиеВстроеннойИЛегкойПочтыНастройка.ИспользованиеЛегкойПочты Тогда
		
		ПараметрОбъекты = Новый Массив;
		Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
			ПараметрОбъекты = ПараметрКоманды;
		Иначе
			ПараметрОбъекты.Добавить(ПараметрКоманды);
		КонецЕсли;	

		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Объекты", ПараметрОбъекты);
		
		ОткрытьФорму(
			"Обработка.ПочтовоеСообщение.Форма.Форма",
			ПараметрыОткрытия,,
			Новый УникальныйИдентификатор);
	КонецЕсли;	
	
КонецПроцедуры
