// Переопределяемые методы для механизма "Очереди заданий"

// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Число потоков быстрых массовых заданий. Эти задания вызываются редко, но их сразу создается много. Поэтому крайне
// не рекомендуется сильно увеличивать значение по умолчанию - это будет сильно мешать основной очереди разовых заданий.
// 
// Возвращаемое значение:
//  Число -
Функция ЧислоПотоковБыстрыхМассовыхЗаданий() Экспорт
	
	Возврат 1;
	
КонецФункции

// Число потоков быстрых массовых заданий. Эти задания вызываются редко, но их сразу создается много. Поэтому крайне
// не рекомендуется сильно увеличивать значение по умолчанию - это будет сильно мешать основной очереди разовых заданий.
// 
// Возвращаемое значение:
//  Число -
Функция ЧислоПотоковДолгихМассовыхЗаданий() Экспорт
	
	Возврат 1;
	
КонецФункции

#КонецОбласти

