&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИспользованиеЛегкойПочты = Ложь;
	ИмяПараметраИспользованиеЛегкойПочты = "Почта.ИспользованиеЛегкойПочты";
	Если ПараметрыПриложения[ИмяПараметраИспользованиеЛегкойПочты] = Неопределено Тогда
		
		ИспользованиеЛегкойПочты = ВстроеннаяПочтаСервер.ЛегкаяПочтаИспользуется();
		ПараметрыПриложения[ИмяПараметраИспользованиеЛегкойПочты] = ИспользованиеЛегкойПочты;
		
	Иначе
		
		ИспользованиеЛегкойПочты = ПараметрыПриложения[ИмяПараметраИспользованиеЛегкойПочты];
		
	КонецЕсли;	

	Если Не ИспользованиеЛегкойПочты Тогда
		ТекстСообщения = НСтр("ru = 'Для загрузки почты включите персональную настройку ""Легкая почта"".'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	#Если ВебКлиент Тогда
		ПараметрыФормы.Вставить("ВебКлиент", Истина);
	#КонецЕсли
	ОткрытьФорму("Обработка.ЗагрузкаЭлектроннойПочты.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
