
#Область ПрограммныйИнтерфейс

// См. ОбзорСпискаДокументовКлиент.ОбновитьМиникарточку
Процедура ОбновитьМиникарточку(Форма, ДанныеМиникарточки) Экспорт

	// Локализация
	Если ТипЗнч(ДанныеМиникарточки.ВидДокументаКэш) = Тип("Структура") Тогда
		Форма.ВидДокументаКэш = Новый Структура;
		Форма.ВидДокументаКэш = ДанныеМиникарточки.ВидДокументаКэш;
		ВидимостьКомандСервиса1CShare = ИнтеграцияShareДокументооборотКлиентСервер.ВидимостьКомандСервиса1CShare(Форма,
			Форма.ВидДокументаКэш);
		Если ВидимостьКомандСервиса1CShare.ИспользоватьСервис1CShare Тогда
			Форма.Элементы.ОбщаяКомандаПоделитьсяДокументомShare.Видимость = ВидимостьКомандСервиса1CShare.Видимость;
		КонецЕсли;
	КонецЕсли;
	// Локализация Конец
	
КонецПроцедуры

#КонецОбласти
