// @strict-types


#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из ОстановитьПродолжитьОбработку общего модуля ОбработкиОбъектов
// Процедура приводит к перезаписи обработки документов.
// Параметры:
//  Обработка - СправочникСсылка.ОбработкиОбъектов
//  СостояниеОбработки -  ПеречислениеСсылка.СостоянияОбработкиОбъектов
//  ДействияОбработкиССостояниями - ТаблицаЗначений
//
Процедура ОстановитьПродолжитьОбработку(Знач Обработка, СостояниеОбработки, ДействияОбработкиССостояниями) Экспорт

// Локализация		
	МассивДействий = ДействияОбработкиССостояниями.ВыгрузитьКолонку("Действие");
	РаботаСВнешнимПодписанием.ОбработатьОстановкуПродолжениеВыполненияДействий(МассивДействий, СостояниеОбработки);
// Локализация Конец	
	
КонецПроцедуры	

#КонецОбласти