#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает типы  документов, которые не должны учитываться как проверяемые. По ним данные могут храниться в инф. базе,
// но более они не учитываются.
// 
// Параметры:
// 	ТолькоБезВозможностиИзменения - Булево - принак того, что необходимо вернуть только те документы,
// 		настройки по которым не задаются вручную пользователем (нужно, когда результат функции используется в запросе
// 		с отдельным получением данных по таблице исключений). Значение по умолчанию - Ложь.
//
// Возвращаемое значение:
//	Массив Из Тип - Типы документов, которые не должны проверяться.
//
Функция ИсключаемыеТипыДокументовДляПроверки(ТолькоБезВозможностиИзменения = Ложь) Экспорт
	
	МассивВозврата = Новый Массив;
	
	Если Не ТолькоБезВозможностиИзменения Тогда
		
		МассивВозврата = ТаблицаИсключаемыхДокументов().ВыгрузитьКолонку("Тип");
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВозврата, ИсключаемыеТипыДляПроверкиБезВозможностиИзменения());
	
	Возврат МассивВозврата;
	
КонецФункции

// Получает имена  документов, которые не должны учитываться как проверяемые. По ним данные могут храниться в инф. базе,
// но более они не учитываются.
// 
// Параметры:
// 	ТолькоБезВозможностиИзменения - Булево - принак того, что необходимо вернуть только те документы,
// 	настройки по которым не задаются вручную пользователем (нужно, когда результат функции используется в запросе
// 	с отдельным получением данных по таблице исключений). Значение по умолчанию - Ложь.
//
// Возвращаемое значение:
//	Массив Из Строка - Имена документов, которые не должны проверяться.
//
Функция ИсключаемыеДокументыДляПроверки(ТолькоБезВозможностиИзменения = Ложь) Экспорт
	
	МассивВозврата = Новый Массив;
	
	Если Не ТолькоБезВозможностиИзменения Тогда
		
		МассивВозврата = ТаблицаИсключаемыхДокументов().ВыгрузитьКолонку("ИмяДокумента");
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВозврата, ИсключаемыеДокументыДляПроверкиБезВозможностиИзменения());
	
	Возврат МассивВозврата;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИсключаемыеТипыДляПроверкиБезВозможностиИзменения()
	
	МассивВозврата = Новый Массив;
	
	Для каждого ИмяИсключаемогоДокумента Из ИсключаемыеДокументыДляПроверкиБезВозможностиИзменения() Цикл
		МассивВозврата.Добавить(Тип("ДокументСсылка." + ИмяИсключаемогоДокумента));
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

Функция ИсключаемыеДокументыДляПроверкиБезВозможностиИзменения()
	
	МассивВозврата = Новый Массив;
	МДокументы = Метаданные.Документы;
	
	МассивВозврата.Добавить(МДокументы.ВводОстатков.Имя);
	МассивВозврата.Добавить(МДокументы.ВводОстатковВзаиморасчетов.Имя);
	МассивВозврата.Добавить(МДокументы.ВводОстатковДенежныхСредств.Имя);
	МассивВозврата.Добавить(МДокументы.ВводОстатковОПродажахЗаПрошлыеПериоды.Имя);
	МассивВозврата.Добавить(МДокументы.ВводОстатковПоФинансовымИнструментам.Имя);
	МассивВозврата.Добавить(МДокументы.ВводОстатковПрочиеРасходы.Имя);
	МассивВозврата.Добавить(МДокументы.ВводОстатковПрочихАктивовПассивов.Имя);
	МассивВозврата.Добавить(МДокументы.ВводОстатковРасчетовПоЭквайрингу.Имя);
	МассивВозврата.Добавить(МДокументы.ВводОстатковСПодотчетниками.Имя);
	МассивВозврата.Добавить(МДокументы.ВводОстатковТоваров.Имя);
	МассивВозврата.Добавить(МДокументы.ИсправлениеРазвернутогоСальдоТоваровОрганизаций.Имя);
	МассивВозврата.Добавить(МДокументы.РаспределениеДоходовПоНаправлениямДеятельности.Имя);
	МассивВозврата.Добавить(МДокументы.РаспределениеНДС.Имя);
	МассивВозврата.Добавить(МДокументы.РаспределениеПрочихЗатрат.Имя);
	МассивВозврата.Добавить(МДокументы.РасчетКурсовыхРазниц.Имя);
	МассивВозврата.Добавить(МДокументы.РасчетПроцентныхРасходовДисконтирования.Имя);
	МассивВозврата.Добавить(МДокументы.РасчетСебестоимостиТоваров.Имя);
	МассивВозврата.Добавить(МДокументы.РегистраторРасчетаСебестоимости.Имя);
	МассивВозврата.Добавить(МДокументы.РегистраторРасчетов.Имя);
	МассивВозврата.Добавить(МДокументы.КорректировкаГрафикаВзаиморасчетов.Имя);
	//++ НЕ УТ
	МассивВозврата.Добавить(МДокументы.АмортизацияНМА2_4.Имя);
	МассивВозврата.Добавить(МДокументы.АмортизацияОС2_4.Имя);
	МассивВозврата.Добавить(МДокументы.НачислениеПроцентовПоАренде.Имя);
	МассивВозврата.Добавить(МДокументы.НачислениеСписаниеРезервовПоСомнительнымДолгам.Имя);
	МассивВозврата.Добавить(МДокументы.РасчетРезервовПодОбесценениеЗапасов.Имя);
	//-- НЕ УТ

	//++ НЕ УТКА
	МассивВозврата.Добавить(МДокументы.РегламентнаяОперацияМеждународныйУчет.Имя);
	//-- НЕ УТКА
	
	ПроверкаДокументовЛокализация.ДополнитьИсключаемыеДокументыДляПроверки(МассивВозврата);
	
	Возврат МассивВозврата;
	
КонецФункции

Функция ТаблицаИсключаемыхДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Данные.Имя КАК ИмяДокумента,
	|	ТИПЗНАЧЕНИЯ(Данные.ЗначениеПустойСсылки) КАК Тип
	|ИЗ
	|	РегистрСведений.НастройкиИсключенийПроверкиДокументов КАК НастройкиИсключений
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК Данные
	|	ПО НастройкиИсключений.ВидДокумента = Данные.Ссылка
	|	И НЕ Данные.ПометкаУдаления
	|ГДЕ
	|	НЕ НастройкиИсключений.Проверяется";
	
	ТаблицаВозврата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаВозврата;
	
КонецФункции

#КонецОбласти

#КонецЕсли