
#Область ПрограммныйИнтерфейс

// См. Справочник.ВидыДокументов.Форма.ФормаЭлемента.УстановитьДоступностьОпций
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура УстановитьДоступностьОпций_ФормаЭлемента(Форма) Экспорт
// Локализация
	Объект = Форма.Объект;
	ВидыДокументовКлиентСервер.УстановитьДоступностьОпции(Форма, "ИспользоватьЭДО" , ЗначениеЗаполнено(Объект.ФормаДокумента)
		И Объект.ФормаДокумента <> ПредопределенноеЗначение("Перечисление.ВариантыФормДокументов.Бумажная"));
	ВидыДокументовКлиентСервер.УстановитьДоступностьОпции(Форма, "ГруппаОтправлятьПоЭДОКак" , Объект.ИспользоватьЭДО);
	ВидыДокументовКлиентСервер.УстановитьДоступностьОпции(Форма, "ГруппаНастройкиПоОтправителюПолучателю" , Объект.ИспользоватьЭДО);
	
	ВидыДокументовКлиентСервер.УстановитьДоступностьОпции(Форма, "ЯвляетсяОбращениемОтГраждан",
	Не Объект.ЯвляетсяДоговором
	И Не Объект.ЯвляетсяКомплектомДокументов
	И Не Объект.ЯвляетсяИсходящейКорреспонденцией
	И Объект.ЯвляетсяВходящейКорреспонденцией);
// Локализация Конец
КонецПроцедуры

#КонецОбласти
