
&НаСервере
Процедура СформироватьНаСервере()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Макет = Отчеты.Расш1_Номенклатура_по_видамработ.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура.Ссылка КАК ОсновноеИзделиеНоменклатураСсылка,
		|	РесурсныеСпецификации.Трудозатраты.(
		|		ВидРабот.Ссылка КАК ВидРаботСсылка
		|	) КАК Трудозатраты
		|ИЗ
		|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
		|ГДЕ
		|	РесурсныеСпецификации.Трудозатраты.ВидРабот.Ссылка В(&ВидРабот)";
	
	Запрос.УстановитьПараметр("ВидРабот", Отчет.Видывработ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	ТрудозатратыОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ТрудозатратыШапкаТаблицы");
	ТрудозатратыОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ТрудозатратыПодвалТаблицы");
	ТрудозатратыОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("ТрудозатратыДетали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	
	//	ТабДок.НачатьГруппуСтрок();
	//	ТабДок.Вывести(ТрудозатратыОбластьШапкаТаблицы);
	//	ТабДок.НачатьАвтогруппировкуСтрок();
	//
	//	ТрудозатратыВыборкаДетальныеЗаписи = ВыборкаДетальныеЗаписи.Трудозатраты.Выбрать();
	//
	//	Пока ТрудозатратыВыборкаДетальныеЗаписи.Следующий() Цикл
	//		ТрудозатратыОбластьДетальныхЗаписей.Параметры.Заполнить(ТрудозатратыВыборкаДетальныеЗаписи);
	//		ТабДок.Вывести(ТрудозатратыОбластьДетальныхЗаписей, ТрудозатратыВыборкаДетальныеЗаписи.Уровень());
	//	КонецЦикла;
	//
	//	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	//	ТабДок.Вывести(ТрудозатратыОбластьПодвалТаблицы);
	//	ТабДок.ЗакончитьГруппуСтрок();
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА







КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
