////////////////////////////////////////////////////////////////////////////////
// Контроль (вызов сервера)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Снимает с контроля.
// 
// Параметры:
//  КонтрольСсылка - СправочникСсылка.Контроль
// 
// Возвращаемое значение:
//  См. КонтрольКлиентСервер.ПараметрыОповещения
// 
Функция СнятьСКонтроля(Знач КонтрольСсылка) Экспорт
	
	КонтрольОбъект = КонтрольСсылка.ПолучитьОбъект();
	КонтрольОбъект.СнятСКонтроля = Истина;
	КонтрольОбъект.ДатаСнятияСКонтроля = ТекущаяДатаСеанса();
	
	Для Каждого Строка Из КонтрольОбъект.Исполнители Цикл
		Если Не Строка.Проконтролировано Тогда 
			Строка.Проконтролировано = Истина;
			Строка.ДатаКонтроля = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЦикла;
	
	КонтрольОбъект.Записать();
	
	ПараметрыОповещения = КонтрольКлиентСервер.ПараметрыОповещения(КонтрольОбъект);
	
	Возврат ПараметрыОповещения;
	
КонецФункции

// Переносит срок.
// 
// Параметры:
//  КонтрольСсылка - СправочникСсылка.Контроль
//  НовыйСрок - Дата
// 
// Возвращаемое значение:
//  См. КонтрольКлиентСервер.ПараметрыОповещения
// 
Функция ПеренестиСрок(Знач КонтрольСсылка, Знач НовыйСрок) Экспорт
	
	КонтрольОбъект = КонтрольСсылка.ПолучитьОбъект();
	КонтрольОбъект.СрокИсполнения = НовыйСрок;
	КонтрольОбъект.Записать();
	
	ПараметрыОповещения = КонтрольКлиентСервер.ПараметрыОповещения(КонтрольОбъект);
	
	Возврат ПараметрыОповещения;
	
КонецФункции

#КонецОбласти