#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаШтрихкодирование.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьШтрихкоды");
	Элементы.ГруппаЭП.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныеПодписи")
		Или ПолучитьФункциональнуюОпцию("ИспользоватьШифрование");
	
	Элементы.ГруппаВстроеннаяПочта.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьВстроеннуюПочту");
	
	Элементы.ГруппаУведомления.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьУведомленияПользователя");
	
	// МобильныйКлиент
	МК_НастроитьЭлементыФормы();
	// Конец МобильныйКлиент

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КартинкаЗадачиНажатие(Элемент)
	
	ОткрытьПерсональныйНастройкиЗадач();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийЗадачиНажатие(Элемент)
	
	ОткрытьПерсональныйНастройкиЗадач();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуМобильногоКлиента(Команда)

	ОткрытьФорму(
		"Обработка.ПерсональныеНастройки.Форма.МобильныйКлиент", ,
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Разное(Команда)
	
	ОткрытьФорму(
		"Обработка.ПерсональныеНастройки.Форма.Разное",,
		ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетВремени(Команда)
	
	ОткрытьФорму(
		"Обработка.ПерсональныеНастройки.Форма.УчетВремени",,
		ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура Документы(Команда)
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	ИдентификаторКлиента = СистемнаяИнформация.ИдентификаторКлиента;
	
	ПараметрыФормы = Новый Структура("ИдентификаторКлиента", 
		ИдентификаторКлиента);
	
	ОткрытьФорму(
		"Обработка.ПерсональныеНастройки.Форма.Документы", 
		ПараметрыФормы,
		ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)
	
	ЭтоВебКлиент = Ложь;
	#Если ВебКлиент Тогда
		ЭтоВебКлиент = Истина;
	#КонецЕсли
	СистемнаяИнформация = Новый СистемнаяИнформация();
	ИдентификаторКлиента = СистемнаяИнформация.ИдентификаторКлиента;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭтоВебКлиент", ЭтоВебКлиент);
	ПараметрыФормы.Вставить("ИдентификаторКлиента", ИдентификаторКлиента);
	
	ОткрытьФорму(
		"Обработка.ПерсональныеНастройки.Форма.Файлы",
		ПараметрыФормы,
		ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛегкаяПочта(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПоказатьУправлениеФО", Истина);
	ОткрытьФорму(
		"Обработка.НастройкаПочты.Форма.НастройкиЛегкойПочты",
		ПараметрыФормы,
		ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ВстроеннаяПочта(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПоказатьУправлениеФО", Истина);
	ОткрытьФорму(
		"Обработка.НастройкаПочты.Форма.НастройкиВстроеннойПочты",
		ПараметрыФормы,
		ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура Штрихкодирование(Команда)
	
	ОткрытьФорму(
		"Обработка.ПерсональныеНастройки.Форма.Штрихкодирование",,
		ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭП(Команда)
	
	ЭлектроннаяПодписьКлиент.ОткрытьНастройкиЭлектроннойПодписиИШифрования();
	
КонецПроцедуры

&НаКлиенте
Процедура Уведомления(Команда)
	
	ОткрытьФорму(
		"ОбщаяФорма.ПодпискиПользователя",,
		ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьПерсональныйНастройкиЗадач()
	
	ОткрытьФорму("Документ.Задача.Форма.НастройкиЗадач");
	
КонецПроцедуры

&НаСервере
Процедура МК_НастроитьЭлементыФормы()

	Элементы.ГруппаМобильныйКлиент.Видимость = Не ПараметрыСеанса.ЭтоМобильныйКлиент;

КонецПроцедуры

#КонецОбласти