// @strict-types
#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеПаспортаФизЛица(ФизЛицо) Экспорт
	
	// ++ Локализация
	ДанныеПаспорта = Новый Структура;
	ДанныеПаспорта.Вставить("Серия", Неопределено);
	ДанныеПаспорта.Вставить("Номер", Неопределено);
	ДанныеПаспорта.Вставить("КемВыдан", Неопределено);
	ДанныеПаспорта.Вставить("ДатаВыдачи", Неопределено);
	ДанныеПаспорта.Вставить("КодПодразделения", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.Серия,
		|	ДокументыФизическихЛицСрезПоследних.Номер,
		|	ДокументыФизическихЛицСрезПоследних.КемВыдан,
		|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи,
		|	ДокументыФизическихЛицСрезПоследних.КодПодразделения
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(, Физлицо = &ФизЛицо
		|	И ВидДокумента = &ВидДокумента) КАК ДокументыФизическихЛицСрезПоследних";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеПаспорта, Выборка);
	КонецЕсли;
	
	Возврат ДанныеПаспорта;
	// -- Локализация

КонецФункции

#КонецОбласти
