&ИзменениеИКонтроль("ВычислитьЗначенияЦеныПоДаннымИБ")
Процедура Расш1_ВычислитьЗначенияЦеныПоДаннымИБ(Форма,
	                                      ТаблицаНоменклатуры,
	                                      СтрокаВидЦены,
	                                      ТолькоНезаполненные,
	                                      НастройкиКомпоновкиДанных,
	                                      КэшДанных)
	
	Форма.Модифицированность = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТаблицаНоменклатуры.Количество() > 0 Тогда
		
		Если СтрокаВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБ
			Или СтрокаВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПриПоступлении
			Или СтрокаВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаЦенуПоступления 
			Или СтрокаВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаЦенуВводаОстатков
			Или СтрокаВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПоКонкурентам 
			Или СтрокаВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПоПоставщикам 
			Или СтрокаВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПоСебестоимости Тогда
			
			// Копирование схемы компоновки данных
			Если ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") Тогда
				
				Схема = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СтрокаВидЦены.АдресСхемыКомпоновкиДанных));
				СхемаКомпоновкиДанных = Схема.Получить();
				
			ИначеЕсли ТипЗнч(Форма) = Тип("Структура") Тогда
				
				Схема = Новый ХранилищеЗначения(СтрокаВидЦены.СхемаКомпоновкиДанных);
				СхемаКомпоновкиДанных = Схема.Получить();
				
			КонецЕсли;
			
			ПроверкаСКДПройдена = Ценообразование.ПроверитьСхемуКомпоновкиДанных(СхемаКомпоновкиДанных,
				СтрЗаменить(НСтр("ru = 'Вид цены ""%ВидЦены%""';
								|en = 'Price type ""%ВидЦены%""'"),
					"%ВидЦены%",
					СтрокаВидЦены.Ссылка));
			
			Если ПроверкаСКДПройдена Тогда
				
				// Заполнение набора данных ТаблицаНоменклатуры
				РабочийНаборДанных = СхемаКомпоновкиДанных.НаборыДанных[0];
				
				ТекстЗапроса = РабочийНаборДанных.Запрос;
				ТекстЗапроса = СтрЗаменить(
					ТекстЗапроса, 
					"&ТекстЗапросаКоэффициентУпаковки1", 
					Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
						"ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка", 
						"ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура"));
				
				ТекстЗапроса = СтрЗаменить(
					ТекстЗапроса, 
					"&ТекстЗапросаКоэффициентУпаковки2", 
					Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
						"ТоварыДокумента.Упаковка", 
						"ТоварыДокумента.Номенклатура"));
					
				ТекстЗапроса = СтрЗаменить(
					ТекстЗапроса, 
					"&ТекстЗапросаКоэффициентУпаковки3", 
					Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
						"ТоварыДокументаВводНаОсновании.Упаковка", 
						"ТоварыДокументаВводНаОсновании.Номенклатура"));
					
				РабочийНаборДанных.Запрос = ТекстЗапроса;
				
				НаборДанныхНоменклатура                = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
				НаборДанныхНоменклатура.Имя            = "ТаблицаНоменклатуры";
				НаборДанныхНоменклатура.ИмяОбъекта     = "ТаблицаНоменклатуры";
				НаборДанныхНоменклатура.ИсточникДанных = РабочийНаборДанных.ИсточникДанных;
				
				ДобавитьПолеНабораДанныхСКД(НаборДанныхНоменклатура, "Номенклатура", "СправочникСсылка.Номенклатура");
				Если Форма.ИспользоватьХарактеристикиНоменклатуры Тогда
					ДобавитьПолеНабораДанныхСКД(НаборДанныхНоменклатура, "Характеристика", "СправочникСсылка.ХарактеристикиНоменклатуры");
				КонецЕсли;
				
				СхемаКомпоновкиДанных.СвязиНаборовДанных.Очистить();
				ДобавитьСвязьНаборовДанныхСКД(СхемаКомпоновкиДанных, НаборДанныхНоменклатура, РабочийНаборДанных, "Номенклатура");
				
				Если Форма.ИспользоватьХарактеристикиНоменклатуры Тогда
					ДобавитьСвязьНаборовДанныхСКД(СхемаКомпоновкиДанных, НаборДанныхНоменклатура, РабочийНаборДанных, "Характеристика");
				КонецЕсли;
				
				// Подготовка компоновщика макета компоновки данных, загрузка настроек
				КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
				КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
				
				Если НастройкиКомпоновкиДанных <> Неопределено Тогда
					КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
					КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
				Иначе
					
					Если ЗначениеЗаполнено(СтрокаВидЦены.АдресНастроекСхемыКомпоновкиДанных) Тогда
						НастройкиИзВидаЦены = ПолучитьИзВременногоХранилища(СтрокаВидЦены.АдресНастроекСхемыКомпоновкиДанных);
						КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиИзВидаЦены);
						КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
					Иначе
						КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
					КонецЕсли;
					
				КонецЕсли;
				
				// Заполнение структуры отчета и выбранных полей.
				КомпоновщикНастроек.Настройки.Структура.Очистить();
				
				ГруппировкаДетальныеЗаписи = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
				ГруппировкаДетальныеЗаписи.Использование = Истина;
				
				КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
				ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "Номенклатура");
				
				Если Форма.ИспользоватьХарактеристикиНоменклатуры Тогда
					ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "Характеристика");
				КонецЕсли;
				
				Если Форма.ИспользоватьУпаковкиНоменклатуры Тогда
					ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "Упаковка");
					ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "Коэффициент");
				КонецЕсли;
				
				ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "Цена");
				ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "Валюта");
				
				ПараметрыКомпоновки = КомпоновщикНастроек.настройки.параметрыДанных.Элементы;
				Если ЭтоУстановкаЦенНоменклатуры(Форма) Тогда
					Параметр = ПараметрыКомпоновки.Найти("Основание");
					Если Параметр <> Неопределено Тогда
						Параметр.Значение = Форма.Объект.ДокументОснование;
						Параметр.Использование = ЗначениеЗаполнено(Параметр.Значение);
					КонецЕсли;
					Параметр = ПараметрыКомпоновки.Найти("ЭтоВводНаОсновании");
					Если Параметр <> Неопределено Тогда
						Параметр.Значение = ЗначениеЗаполнено(Форма.Объект.ДокументОснование);
						Параметр.Использование = ЗначениеЗаполнено(Параметр.Значение);
					КонецЕсли;
				КонецЕсли;
				Параметр = ПараметрыКомпоновки.Найти("ИсключаемыеХозОперации");
				Если Параметр <> Неопределено Тогда
					Параметр.Значение = РасчетСебестоимостиПрикладныеАлгоритмы.ХозяйственныеОперацииПеремещений();
					Параметр.Использование = ЗначениеЗаполнено(Параметр.Значение);
				КонецЕсли;
				Параметр = ПараметрыКомпоновки.Найти("ДатаДокумента");
				Если Параметр <> Неопределено Тогда
					Параметр.Значение = ДатаДокумента(Форма);
					Параметр.Использование = ЗначениеЗаполнено(Параметр.Значение);
				КонецЕсли;
				Параметр = ПараметрыКомпоновки.Найти("ВидЦены");
				Если Параметр <> Неопределено Тогда
					Параметр.Значение = СтрокаВидЦены.Ссылка;
					Параметр.Использование = ЗначениеЗаполнено(Параметр.Значение);
				КонецЕсли;
				Параметр = ПараметрыКомпоновки.Найти("Валюта");
				Если Параметр <> Неопределено Тогда
					Параметр.Значение = СтрокаВидЦены.Валюта;
					Параметр.Использование = ЗначениеЗаполнено(Параметр.Значение);
				КонецЕсли;
				
				// Компоновка макета и исполнение запроса.
				КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
				СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(КомпоновщикНастроек);
				МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"), Ложь);
				
				ВнешниеНаборыДанных = Новый Структура;
				ВнешниеНаборыДанных.Вставить("ТаблицаНоменклатуры", ТаблицаНоменклатуры.Скопировать(, "Номенклатура, Характеристика"));
				
				ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
				ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,,Истина);
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

				ДанныеОтчета = Новый ТаблицаЗначений();
				ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
				ДанныеОтчета = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
				
				Если Форма.ИспользоватьУпаковкиНоменклатуры Тогда
					ТаблицаКоэффициентовУпаковокНоменклатуры = КоэффициентыУпаковокНоменклатурыДереваТоваров(Форма);
				Иначе
					ТаблицаКоэффициентовУпаковокНоменклатуры = Неопределено;
				КонецЕсли;
				
				СтруктураПараметров = Новый Структура();
				СтруктураПараметров.Вставить("ТолькоНезаполненные",  ТолькоНезаполненные);
				СтруктураПараметров.Вставить("ПрименитьОкругление",  Истина);
				#Удаление
				СтруктураПараметров.Вставить("ЗагружатьУпаковку",    Ложь);
				#КонецУдаления
				#Вставка
				СтруктураПараметров.Вставить("ЗагружатьУпаковку",    Истина);
				#КонецВставки
				СтруктураПараметров.Вставить("АвтоматическийРасчет", Истина);

				Если СтрокаВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаЦенуПоступления 
					Или СтрокаВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаЦенуВводаОстатков
					Или СтрокаВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПоКонкурентам 
					Или СтрокаВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПоПоставщикам 
					Или СтрокаВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПоСебестоимости Тогда
					
					СтруктураПараметров.Вставить("Наценивать", Истина);
					ЗагрузитьЦеныИзТаблицыЗначений(
						Форма,
						ДанныеОтчета,
						ТаблицаКоэффициентовУпаковокНоменклатуры,
						КэшДанных,
						СтрокаВидЦены,
						СтруктураПараметров);
					
				Иначе
					
					СтруктураПараметров.Вставить("Наценивать", Ложь);
					ЗагрузитьЦеныИзТаблицыЗначений(Форма,
						ДанныеОтчета,
						#Удаление
						ТаблицаКоэффициентовУпаковокНоменклатуры,
						#КонецУдаления
						#Вставка
						Неопределено,
						#КонецВставки
						КэшДанных,
						СтрокаВидЦены,
						СтруктураПараметров);
					
				КонецЕсли;
				
			Иначе
				
				ТекстОшибки = СтрШаблон(ШаблонОшибкиВычисленияЦеныПоДаннымИБ(),
					СтрокаВидЦены.Ссылка);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
