
#Область ПрограммныйИнтерфейс

Процедура УстановитьДоступностьКоманды(Форма, Команда, Доступность) Экспорт
	
	Если Форма.ДоступныеПоля = "" Тогда
		Команда.Доступность = Доступность;
	ИначеЕсли ТипЗнч(Форма.ДоступныеПоля) = Тип("Структура") Тогда
		Если Форма.ДоступныеПоля.Свойство(Команда.Имя) 
			Или Не Форма.НедоступныеПоля.Свойство(Команда.Имя) Тогда
			Команда.Доступность = Доступность;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВидимостьКоманды(Форма, Команда, Видимость) Экспорт
	Команда.Видимость = Видимость;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
