//&ИзменениеИКонтроль("НастроитьВариантыОтчетов")  
//Процедура Расш1_НастроитьВариантыОтчетов(Настройки) Экспорт
//	//
//	////++ НЕ ГОСИС
//	//
//	//ВариантыОтчетовУТПереопределяемый.НастроитьВариантыОтчетов(Настройки);
//	//ВариантыОтчетовЛокализация.НастроитьВариантыОтчетов(Настройки);
//	//
//	//ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.Расш1_Плановая_калькуляция_сквозная);
//	//ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
//	//
//	////-- НЕ ГОСИС
//	
//КонецПроцедуры

