
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбработчикиОбновления

// Монопольный обработчик обновления, заполняет регистр для перехода на новый формат прав доступа.
Процедура ЗаполнитьПользователяДляПереходаНаНовуюВерсию() Экспорт
	
	// Обработчик монопольный, пишем как можно быстрее, без установок блокировок.
	
	// Оббегаем пары дескриптор + сотрудник
	// Меняем только те записи, где у Сотрудника есть Пользователь, остальные оставляем с пустым пользователем:
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РегистрПрав.Сотрудник,
		|	МАКСИМУМ(СотрудникиПользователей.Пользователь) КАК Пользователь
		|ИЗ
		|	РегистрСведений.ПраваПоДескрипторамДоступаРегистров КАК РегистрПрав
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.СотрудникиПользователей КАК СотрудникиПользователей
		|		ПО СотрудникиПользователей.Сотрудник = РегистрПрав.Сотрудник
		|ГДЕ
		|	РегистрПрав.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	РегистрПрав.Сотрудник");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НадоЗаписать = Ложь;
		Набор = Неопределено;
		Попытка
			Набор = СоздатьНаборЗаписей();
			Набор.Отбор.Сотрудник.Установить(Выборка.Сотрудник);
			Набор.Прочитать();
			
			Для Каждого Запись Из Набор Цикл
				Если ЗначениеЗаполнено(Запись.Пользователь) Тогда
					Продолжить; // Возможно, весь набор не придется перезаписывать.
				КонецЕсли;
				
				Запись.Пользователь = Выборка.Пользователь;
				НадоЗаписать = Истина;
			КонецЦикла;
			
			Если НадоЗаписать Тогда
				Набор.ДополнительныеСвойства.Вставить("ПропуститьОпределениеДескриптораДоступаИПроверкуПрав", Истина);
				Набор.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
				ОбновлениеИнформационнойБазыДокументооборот.ЗаписатьДанные(Набор);
			КонецЕсли;
			
			НадоЗаписать = Ложь; // Записали с 1-ой попытки.
		Исключение
			Инфо = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Если НадоЗаписать И Набор <> Неопределено Тогда
				// Перестраховка. Будет 2-я попытка.
			Иначе
				ВызватьИсключение Инфо;
			КонецЕсли;
		КонецПопытки;
		
		// Попытка №2. Иногда может придти набор с неуникальными записями. Это ненормальная ситуация, но возможная.
		// Пробуем записать набор еще раз, свернув:
		Если НадоЗаписать И Набор <> Неопределено Тогда
			Попытка
				ТаблицаНабора = Набор.Выгрузить();
				ТаблицаНабора.Свернуть(
					"Дескриптор, Пользователь, Сотрудник, ОбъектОснование",
					"Добавление, Изменение, Удаление, УправлениеПравами, Чтение");
				Набор.Загрузить(ТаблицаНабора);
				ОбновлениеИнформационнойБазыДокументооборот.ЗаписатьДанные(Набор);
			Исключение
				Инфо = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ВызватьИсключение Инфо;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиОбновления

#КонецОбласти // ДляВызоваИзДругихПодсистем

#КонецОбласти

#КонецЕсли
