
// Локализация
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает вариант отправки по ЭДО.
// 
// Возвращаемое значение:
//  Строка
//
Функция ВариантОтправкиПоЭДО() Экспорт
	
	Возврат "ОтправитьПоЭДО";
	
КонецФункции

// Возвращает вариант отправки через 1С:Share.
// 
// Возвращаемое значение:
//  Строка
//
Функция ВариантОтправкиЧерез1СShare() Экспорт
	
	Возврат "ОтправитьЧерез1СShare";
	
КонецФункции

// Проверяет, что переданный вариант является вариантом отправки по ЭДО.
//
// Параметры:
//  Вариант - Произвольный - вариант помощника.
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоВариантОтправкиПоЭДО(Вариант) Экспорт
	
	Возврат Вариант = ВариантОтправкиПоЭДО();
	
КонецФункции	

// Проверяет, что переданный вариант является вариантом отправки через 1С:Share.
//
// Параметры:
//  Вариант - Произвольный - вариант помощника.
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоВариантОтправкиЧерез1СShare(Вариант) Экспорт
	
	Возврат Вариант = ВариантОтправкиЧерез1СShare();
	
КонецФункции

#КонецОбласти
// Локализация Конец