#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("ПометкаУдаления") И Не Параметры.Отбор.ПометкаУдаления Тогда 
		Элементы.ПоказыватьУдаленные.Видимость = Ложь;
	Иначе 
		ПоказыватьУдаленные = Ложь;
		ПоказыватьУдаленныеСервер();
	КонецЕсли;
	
	Делопроизводство.СписокДокументовУсловноеОформлениеПомеченныхНаУдаление(Список);
	
	РаботаСоСпискамиКонтрагентов.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаКоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	КонтрагентыЛокализация.ПриСозданииНаСервереФормаВыбора(Список);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСоСпискамиКонтрагентов.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаботаСоСпискамиКонтрагентовКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ГруппаКонтрагентов" Тогда
		РаботаСоСпискамиКонтрагентовКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
		РаботаСоСпискамиКонтрагентовКлиент.ЗаполнитьГруппы(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	КлючеваяОперация = РаботаСКонтрагентамиДокументооборотКлиентСервер.КлючеваяОперацияСозданиеКонтрагента();
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
	ПараметрыОткрытия = Новый Структура;
	Если ЗначениеЗаполнено(ТекущаяГруппа) И ТипЗнч(ТекущаяГруппа) = Тип("СправочникСсылка.Контрагенты") Тогда
		ПараметрыОткрытия.Вставить("Группа", ТекущаяГруппа);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыОткрытия, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючеваяОперация = РаботаСКонтрагентамиДокументооборотКлиентСервер.КлючеваяОперацияОткрытиеКонтрагента();
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", ТекущиеДанные.Ссылка);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыОткрытия, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГруппы

&НаКлиенте
Процедура ГруппыПриАктивизацииСтроки(Элемент)
	
	РаботаСоСпискамиКонтрагентовКлиент.ГруппыПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	РаботаСоСпискамиКонтрагентовКлиент.ГруппыНачалоПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания,
		Выполнение);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	РаботаСоСпискамиКонтрагентовКлиент.ГруппыПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания,
		СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	РаботаСоСпискамиКонтрагентовКлиент.ГруппыПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания,
		СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	РаботаСоСпискамиКонтрагентовКлиент.ГруппыПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель,
		ЭтоГруппа, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПередУдалением(Элемент, Отказ)
	
	РаботаСоСпискамиКонтрагентовКлиент.ГруппыПередУдалением(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПередНачаломИзменения(Элемент, Отказ)
	
	РаботаСоСпискамиКонтрагентовКлиент.ГруппыПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьУдаленные(Команда)
	
	РаботаСоСпискамиКонтрагентовКлиент.ПоказыватьУдаленные(ЭтотОбъект, Команда);
	ПоказыватьУдаленныеСервер();
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПоказыватьПодчиненные(Команда)
	
	РаботаСоСпискамиКонтрагентовКлиент.ПоказыватьПодчиненные(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПросмотраСписком(Команда)
	
	РаботаСоСпискамиКонтрагентовКлиент.РежимПросмотраСписком(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПросмотраПоГруппам(Команда)
	
	РаботаСоСпискамиКонтрагентовКлиент.РежимПросмотраПоГруппам(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьГруппы(Команда)
	
	РаботаСоСпискамиКонтрагентовКлиент.СвернутьГруппы(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьГруппы(Команда)
	
	РаботаСоСпискамиКонтрагентовКлиент.РазвернутьГруппы(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчеты(Команда)
	
	Раздел = ПредопределенноеЗначение("Перечисление.РазделыОтчетов.КонтрагентыСписок");
	
	ЗаголовокФормы = НСтр("ru = 'Отчеты по контрагентам'");
	
	ПараметрыФормы = Новый Структура("Раздел, ЗаголовокФормы, НеОтображатьИерархию",
		Раздел, ЗаголовокФормы, Истина);
	
	ОткрытьФорму("Обработка.ВсеОтчеты.Форма.ФормаПоКатегориям", ПараметрыФормы, ЭтотОбъект, "КонтрагентыСписок");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГруппы(Команда)
	
	РаботаСоСпискамиКонтрагентовКлиент.ОбновитьГруппы(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказыватьУдаленныеСервер()
	
	РаботаСоСпискамиКонтрагентов.УстановитьОтборПомеченныхНаУдаление(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

