////////////////////////////////////////////////////////////////////////////////
// Контроль объектов
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует срок контроля в днях.
//
// Параметры:
//  СрокИсполнения - Дата - Срок, указанный в контрольной карточке.
//
// Возвращаемое значение:
//  Число - Число дней до срока контроля.
//
Функция СрокКонтроля(СрокИсполнения) Экспорт
	
	#Если ТонкийКлиент Или ВебКлиент Или МобильныйКлиент Тогда
		ТекущаяДата = ТекущаяДата();
	#Иначе
		ТекущаяДата = ТекущаяДатаСеанса();
	#КонецЕсли
	СрокКонтроля = (НачалоДня(СрокИсполнения) - НачалоДня(ТекущаяДата)) / (24 * 3600);
	
	Возврат СрокКонтроля;
	
КонецФункции

// Формирует параметры оповещения.
// 
// Параметры:
//  КонтрольДанные - СправочникОбъект.Контроль
//                 - ДанныеФормыСтруктура:
//   * Ссылка - СправочникСсылка.Контроль
//   * Предмет - см. Справочник.Контроль.Предмет
//   * Контролер - см. Справочник.Контроль.Контролер
// 
// Возвращаемое значение:
//  Структура:
//   * Ссылка - СправочникСсылка.Контроль
//   * Предмет - см. Справочник.Контроль.Предмет
//   * Контролер - см. Справочник.Контроль.Контролер
// 
Функция ПараметрыОповещения(КонтрольДанные) Экспорт
	
	ПараметрыОповещения = Новый Структура;
#Если Не ВнешнееСоединение Тогда
	ПараметрыОповещения.Вставить("Ссылка", КонтрольДанные.Ссылка);
	ПараметрыОповещения.Вставить("Предмет", КонтрольДанные.Предмет);
	ПараметрыОповещения.Вставить("Контролер", КонтрольДанные.Контролер);
#Иначе
	ВызватьИсключение НСтр("ru = 'Метод ПараметрыОповещения не доступен во внешнем соединении.'");
#КонецЕсли
	
	Возврат ПараметрыОповещения;
	
КонецФункции

// Формирует имя ключевой операции "КонтрольЗаписьКонтроля".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияЗаписьКонтроля() Экспорт
	
	КлючеваяОперация = "КонтрольЗаписьКонтроля";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "КонтрольВыполнениеКомандыКонтроль".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияВыполнениеКомандыКонтроль() Экспорт
	
	КлючеваяОперация = "КонтрольВыполнениеКомандыКонтроль";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "КонтрольПостановкаНаКонтроль".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияПостановкаНаКонтроль() Экспорт
	
	КлючеваяОперация = "КонтрольПостановкаНаКонтроль";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "КонтрольОткрытиеФормыНаКонтроле".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияОткрытиеФормыНаКонтроле() Экспорт
	
	КлючеваяОперация = "КонтрольОткрытиеФормыНаКонтроле";
	
	Возврат КлючеваяОперация;
	
КонецФункции

#КонецОбласти