
#Область ПрограммныйИнтерфейс

// Формирует имя ключевой операции "КонтрагентыЗаписьКонтрагента".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияЗаписьКонтрагента() Экспорт
	
	КлючеваяОперация = "КонтрагентыЗаписьКонтрагента";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "КонтрагентыОткрытиеКонтрагента".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияОткрытиеКонтрагента() Экспорт
	
	КлючеваяОперация = "КонтрагентыОткрытиеКонтрагента";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "КонтрагентыОткрытиеСпискаКонтрагентов".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияОткрытиеСпискаКонтрагентов() Экспорт
	
	КлючеваяОперация = "КонтрагентыОткрытиеСпискаКонтрагентов";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "КонтрагентыОткрытиеФормыВыбораКонтрагентаКонтактногоЛицаВИсходящемДокументе".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияткрытиеФормыВыбораКонтрагентаКонтактногоЛицаВИсходящемДокументе() Экспорт
	
	КлючеваяОперация = "КонтрагентыОткрытиеФормыВыбораКонтрагентаКонтактногоЛицаВИсходящемДокументе";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "КонтрагентыОткрытиеФормыВыбораКонтрагента".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияОткрытиеФормыВыбораКонтрагента() Экспорт
	
	КлючеваяОперация = "КонтрагентыОткрытиеФормыВыбораКонтрагента";
	
	Возврат КлючеваяОперация;
	
КонецФункции

// Формирует имя ключевой операции "КонтрагентыСозданиеКонтрагента".
// 
// Возвращаемое значение:
//  Строка
// 
Функция КлючеваяОперацияСозданиеКонтрагента() Экспорт
	
	КлючеваяОперация = "КонтрагентыСозданиеКонтрагента";
	
	Возврат КлючеваяОперация;
	
КонецФункции


#КонецОбласти
