#Область ПрограммныйИнтерфейс

Функция ПрочитатьДанныеГрафикаИзРегистра(Календарь, НомерГода) Экспорт 
	
	Возврат Справочники.Календари.ПрочитатьДанныеГрафикаИзРегистра(Календарь, НомерГода);
	
КонецФункции   

Функция ПолучитьДатуОкончанияСек(ГрафикРаботы, Знач ДатаНачала, ДлительностьСек = 0) Экспорт 
	Возврат ГрафикиРаботы.ПолучитьДатуОкончанияСек(ГрафикРаботы, ДатаНачала, ДлительностьСек);
КонецФункции	

Функция ПолучитьДлительностьПериодаСек(ГрафикРаботы, ДатаНачала, ДатаОкончания) Экспорт 
	Возврат ГрафикиРаботы.ПолучитьДлительностьПериодаСек(ГрафикРаботы, ДатаНачала, ДатаОкончания);
КонецФункции	

// Определяет календарь графика работы.
//
// Параметры:
//  ГрафикРаботы - СправочникСсылка.ГрафикиРаботы
// 
// Возвращаемое значение:
//  СправочникСсылка.Календари
//
Функция КалендарьГрафикаРаботы(ГрафикРаботы) Экспорт
	
	Календарь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГрафикРаботы, "Календарь");
	
	Возврат Календарь;
	
КонецФункции

#КонецОбласти