#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	СтароеЗначение = Константы.ДокументооборотИспользоватьОграничениеПравДоступа.Получить();
	ДополнительныеСвойства.Вставить("СтароеЗначение", СтароеЗначение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка
			И Не ОбщегоНазначенияДокументооборот.ЭтоЗагрузкаОбъекта(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияДокументооборот.ЭтоЗагрузкаОбъекта(ЭтотОбъект) Тогда
		Значение = Константы.ДокументооборотИспользоватьОграничениеПравДоступа.Получить();
		Если Константы.ОграничиватьДоступНаУровнеЗаписей.Получить() <> Значение Тогда
			Константы.ОграничиватьДоступНаУровнеЗаписей.Установить(Значение);
		КонецЕсли;
	Иначе
		Если Значение И Не ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
			Менеджер = Константы.ДокументооборотИспользоватьОтложенноеОбновлениеПравДоступа.СоздатьМенеджерЗначения();
			Менеджер.Значение = Истина;
			ОбновлениеИнформационнойБазыДокументооборот.ЗаписатьДанные(Менеджер);
			
			ДокументооборотПраваДоступа.ВключитьОбработкуОперативнойОчереди();
			ДокументооборотПраваДоступа.ВключитьОбработкуДолгойОчереди();
		КонецЕсли;
	КонецЕсли;
	
	Если Значение И ПараметрыСеанса.ЗагрузкаОбработанныхДанныхИзДругойСистемы Тогда
		РегистрыСведений.СоставСубъектовПравДоступа.ОбновитьВсеДанные(Истина);
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
