#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НоменклатураДел = Параметры.ЗначениеОтбора;
	Список.Параметры.УстановитьЗначениеПараметра("ЗначениеОтбора", НоменклатураДел);
	
	УстановитьВидимостьФормыДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ДелаХраненияДокументов" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьФормыДокументов()
	
	ФормаДокументовНоменклатурыДел = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		НоменклатураДел, "ФормаДокументов");
	Элементы.ФормаДокументов.Видимость =
		ФормаДокументовНоменклатурыДел = Перечисления.ВариантыФормДокументов.БумажнаяИлиЭлектронная;
	
КонецПроцедуры

#КонецОбласти