// @strict-types

#Область ПрограммныйИнтерфейс

#Область МодульМенеджера

// Вызывается из "ЗаполнитьДанныеНаФормеДокумента" модуля менеджера документа Корреспонденция
// 
// Параметры:
//  Шаблон - Строка
//  	   - СправочникСсылка.ШаблоныДокументов
//
// Возвращаемое значение:
//  - Структура
Функция ДополнитьЗаполняемыеРеквизиты(Шаблон) Экспорт
	
// Локализация
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Шаблон, "АдресатВходящейКорреспонденции, ВидОбращения, Способ, Контрагенты");	
// Локализация Конец

КонецФункции

#КонецОбласти

#КонецОбласти