#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КлючеваяОперация = РаботаСПроектамиКлиентСервер.КлючеваяОперацияОткрытиеСпискаПроектов();
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	ОткрытьФорму("Справочник.Проекты.ФормаСписка",,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти