
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак использования обновленной архитектуры адресной книги.
//
// Возвращаемое значение:
//	Булево - Истина, если используется обновленная аритектура адресной книги.
//
Функция ИспользоватьОбновленнуюАрхитектуру() Экспорт
	
	Возврат Константы.ПараметрыОбновленияАдреснойКниги.ИспользоватьОбновленнуюАрхитектуруАдреснойКниги();
	
КонецФункции

// Возвращает признак использования отложенного обновления адресной книги.
//
// Возвращаемое значение:
//	Булево - Истина, если используется отложенное обновление адресной книги.
//
Функция ИспользоватьОтложенноеОбновление() Экспорт
	
	Возврат Константы.ПараметрыОбновленияАдреснойКниги.ОтложенноеОбновлениеАдреснойКниги();
	
КонецФункции

#КонецОбласти
