
#Область ПрограммныйИнтерфейс

// См. Делопроизводство.ЗаполнитьСписокФайловДокумента
// Позволяет дополнить заполнение списка файлов на форме документа
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  МассивКомбинацийРолей - Массив
//  ИмяСписка - Строка - Имя списка с файлами на форме, который заполняется
//  ЗаполнитьПризнакОригинал - Булево - Заполнить признак оригинал
//  ЭтоСписок - Булево - Это список
//  ОтметитьЗахваченныеФайлы - Булево - Отметить захваченные файлы
Процедура ЗаполнитьСписокФайловДокумента(Форма, МассивКомбинацийРолей, ИмяСписка, ЗаполнитьПризнакОригинал = Ложь,
	ЭтоСписок = Ложь, ОтметитьЗахваченныеФайлы = Ложь) Экспорт
	
	// Локализация
	// установим отображение списком, если отключены роли файлов и нет ЭДО
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРолиФайлов") Или МассивКомбинацийРолей.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Справочник.ДокументыПредприятия.Форма.ФормаЭлемента" Тогда
		ЕстьЭДО = Форма.СвязанныеДокументыЭДО.Количество() > 0;
	ИначеЕсли Форма.ИмяФормы = "ОбщаяФорма.СозданиеИсходящегоЭДВРучномРежиме" Тогда
		ЕстьЭДО = Истина;
	Иначе
		ЕстьЭДО = Ложь;
	КонецЕсли;
	
	Если Не ЕстьЭДО Тогда
		Форма.Элементы[ИмяСписка].Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	// Локализация Конец
	
КонецПроцедуры

// См. Делопроизводство.КэшВидаДокумента
// Позволяет дополнить список реквизитов вида документа, хранимых в кеше в форме документа
// Параметры:
//  ИменаРеквизитов - Строка
Процедура ДополнитьИменаРеквизитовДляКешаВидаДокумента(ИменаРеквизитов) Экспорт
	
	// Локализация
	ИменаРеквизитов = ИменаРеквизитов + ",
		|ИспользоватьЭДО,
		|ЯвляетсяОбращениемОтГраждан";
	// Локализация Конец
	
КонецПроцедуры

// См. Делопроизводство.ЗарегистрироватьПредмет
Процедура ПриРегистрацииПредмета(Предмет, СообщениеОбОшибке, ПредметОбъект, РегистрационныйНомер = "", 
			ДополнительныеПараметры = Неопределено, ЗаписыватьПредмет = Истина) Экспорт
	
	// Локализация
	// Зарегистрировать состояние для МЭДО, если это документ МЭДО:
	Направление = Перечисления.НаправленияСообщенийМЭДО.ПустаяСсылка();
	Если ДелопроизводствоКлиентСервер.ЭтоВходящийДокумент(ПредметОбъект) Тогда
		Направление = Перечисления.НаправленияСообщенийМЭДО.Входящее;
	ИначеЕсли ДелопроизводствоКлиентСервер.ЭтоИсходящийДокумент(ПредметОбъект) Тогда
		Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее;
	КонецЕсли;
	МЭДОПереопределяемый.ПриРегистрацииДокумента(ПредметОбъект, Направление);
	// Локализация Конец
	
КонецПроцедуры

Процедура ДополнитьНовыйКэшВидаДокумента(ВидДокументаКэш) Экспорт

// Локализация
	ВидДокументаКэш.Вставить("ИспользоватьЭДО", Ложь);
	ВидДокументаКэш.Вставить("ЯвляетсяОбращениемОтГраждан", Ложь);
// Локализация Конец

КонецПроцедуры

#КонецОбласти