
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазбиваемыйТекст = СтрШаблон("<html><body contentEditable=true>%1</body></html>", Параметры.Текст);
	ДобавляемыйТекст = "<html><body contentEditable=true></body></html>";
	ОсновнойСпикер = Параметры.Спикер;
	Элементы.НовыйСпикер.СписокВыбора.ЗагрузитьЗначения(Параметры.Спикеры.ВыгрузитьЗначения());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(НовыйСпикер) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Укажите спикера, которому неободимо скопировать текст.'"),,
			"НовыйСпикер");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДобавляемыйТекст) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите переносимый текст.'"),, "ДобавляемыйТекст");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура("ИзмененныйТекст, НовыйТекст, НовыйСпикер",
		Элементы.РазбиваемыйТекст.Документ.body.innerHTML, Элементы.ДобавляемыйТекст.Документ.body.innerHTML, НовыйСпикер);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти
