

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)
	Тогда
		Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		НалогообложениеНДСПриИзмененииСервер();
		
		Объект.ЦенаВключаетНДС = Истина;
			
		Объект.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
		СтатусПриИзмененииСервер();	
		
		СвойствоСчетДействителенВТечение = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ЗаказКлиентаСчетДействителенВТечение");
		Если Не СвойствоСчетДействителенВТечение.Пустая() И
			Объект.ДополнительныеРеквизиты.НайтиСтроки( Новый Структура("Свойство", СвойствоСчетДействителенВТечение ) ).Количество() = 0
		Тогда
			СТЧ = Объект.ДополнительныеРеквизиты.Добавить();
			СТЧ.Свойство = СвойствоСчетДействителенВТечение;
			СТЧ.Значение = 10;
		КонецЕсли;
		
		СвойствоГрузоваяКомпания = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ЗаказКлиентаГрузоваяКомпания" );
		ГрузоваяКомпанияПоУмолчанию = Справочники.Партнеры.НайтиПоНаименованию("ДЕЛОВЫЕ ЛИНИИ ООО");
		Если НЕ СвойствоГрузоваяКомпания.Пустая()
			И Объект.Партнер.Пустая() //Новое и не скопированное
			И НЕ ГрузоваяКомпанияПоУмолчанию.Пустая()
		Тогда
			СТЧ = Объект.ДополнительныеРеквизиты.Добавить();
			СТЧ.Свойство = СвойствоГрузоваяКомпания;
			СТЧ.Значение = ГрузоваяКомпанияПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

