#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьУчастников(Процесс) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.УчастникиПроцессов.СоздатьНаборЗаписей();
	Набор.Отбор.Процесс.Установить(Процесс);
	Набор.Прочитать();
	Возврат Набор.Выгрузить();
	
КонецФункции

// Записывает набор участников переданного процесса по переданной таблице участников.
//
// Параметры:
//   Процесс - БизнесПроцессСсылка - процесс, участников которого нужно записать.
//   ТаблицаИсточникОригинал - ТаблицаЗначений - участники, имена колонок соответствуют регистру.
//   Замещать - Булево - Истина, если набор следует записать с замещением.
//
Процедура ЗаписатьНаборПоПроцессу(Процесс, Знач ТаблицаИсточникОригинал, Замещать = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Процесс) Тогда
		Возврат;
	КонецЕсли;
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Процесс.Установить(Процесс);
	
	ТаблицаИсточник = ТаблицаИсточникОригинал.Скопировать();
	
	// Локализация
	Если ТаблицаИсточник.Колонки.Найти("УдалитьОтметкиВремениИдентификаторНабораЗаписей") <> Неопределено Тогда
		ТаблицаИсточник.Колонки.Удалить("УдалитьОтметкиВремениИдентификаторНабораЗаписей");
	КонецЕсли;
	// Локализация Конец
	
	Если ТаблицаИсточник.Колонки.Найти("ИдентификаторОтметкиВремени") <> Неопределено Тогда
		ТаблицаИсточник.Колонки.Удалить("ИдентификаторОтметкиВремени");
	КонецЕсли;
	
	Для каждого ИсточникСтрока Из ТаблицаИсточник Цикл
		
		Если Не ЗначениеЗаполнено(ИсточникСтрока.Участник) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ИсточникСтрока.Участник) = Тип("СправочникСсылка.Пользователи") Тогда
			ИсточникСтрока.Участник = СотрудникиВызовСервера.ОсновнойСотрудникПользователя(ИсточникСтрока.Участник);
		КонецЕсли;
		
	КонецЦикла;
	
	ИменаКолонок = "";
	Для Каждого Стр Из ТаблицаИсточник.Колонки Цикл
		Если ИменаКолонок <> "" Тогда
			ИменаКолонок = ИменаКолонок + ", ";
		КонецЕсли;	
		ИменаКолонок = ИменаКолонок + Стр.Имя;
	КонецЦикла;	
	ТаблицаИсточник.Свернуть(ИменаКолонок);
	
	Для каждого ИсточникСтрока Из ТаблицаИсточник Цикл
		
		Если Не ЗначениеЗаполнено(ИсточникСтрока.Участник) Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ИсточникСтрока);
		Запись.Процесс = Процесс;
		
	КонецЦикла;
	
	Набор.Записать(Замещать);
	
	ИнтеграцияЗадач.ПриИзмененииПравИсточника(Процесс);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
