
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра(
		"СмещениеВремени", ТекущаяДатаСеанса() - ТекущаяУниверсальнаяДата());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлючПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор);
	
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, , "ОтборИдентификаторКлюча");
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, , "ОтборОбъект");
	ИначеЕсли ЭтоНавигационнаяСсылка(Ключ) Тогда
		//e1cib/data/Справочник.ВнутренниеДокументы?ref=80ca0050569f612611ee69e7840348df
		ОписаниеКлюча = ОписаниеКлючаПоНавигационнойСсылке(Ключ);
		
		Если ТипЗнч(ОписаниеКлюча) = Тип("Структура") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				Список.Отбор,
				"ИдентификаторКлюча",
				ОписаниеКлюча.ИдентификаторКлюча,,
				"ОтборИдентификаторКлюча",,
				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				Список.Отбор,
				"ТипКлюча",
				ОписаниеКлюча.Объект,,
				"ОтборОбъект",,
				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		КонецЕсли;
	ИначеЕсли СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Ключ) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"ИдентификаторКлюча",
			Новый УникальныйИдентификатор(Ключ),,
			"ОтборИдентификаторКлюча",,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючОчистка(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, , "ОтборИдентификаторКлюча");
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, , "ОтборОбъект");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ПоказатьЗначение(, СсылочныйОбъектПоПараметрамКлюча(
		ТекущиеДанные.ИдентификаторКлюча, ТекущиеДанные.ТипКлюча));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ЭтоНавигационнаяСсылка(Ссылка)
	
	Возврат СтрНайти(Ссылка, "e1cib/data/") > 0;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОписаниеКлючаПоНавигационнойСсылке(Ссылка)
	
	ОписаниеКлюча = Новый Структура(
		"ИдентификаторКлюча, Объект",
		ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор(), Неопределено);
	
	Попытка
		ЧастиСсылки = СтрРазделить(Ссылка, "=");
		ЧастиПутиКИмениОбъекта = СтрРазделить(Лев(ЧастиСсылки[0], СтрНайти(ЧастиСсылки[0], "?") - 1), "/");
		ИмяОбъекта = ЧастиПутиКИмениОбъекта[ЧастиПутиКИмениОбъекта.ВГраница()];
		
		ОписаниеКлюча.ИдентификаторКлюча = Новый УникальныйИдентификатор(
			Прав(ЧастиСсылки[1], 8) +
			"-" + Сред(ЧастиСсылки[1], 21, 4) +
			"-" + Сред(ЧастиСсылки[1], 17, 4) +
			"-" + Лев(ЧастиСсылки[1], 4) +
			"-" + Сред(ЧастиСсылки[1], 5, 12));
		ОписаниеКлюча.Объект = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ИмяОбъекта);
	Исключение
		ОписаниеКлюча = Неопределено;
	КонецПопытки;
	
	Возврат ОписаниеКлюча;
	
КонецФункции

&НаСервереБезКонтекста
Функция СсылочныйОбъектПоПараметрамКлюча(Идентификатор, Объект)
	
	Менеджер = ОтметкиВремениПовтИсп.МенеджерОбъектаПоИдентификатору(Объект);
	Если Менеджер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Менеджер.ПолучитьСсылку(Идентификатор);
	
КонецФункции

#КонецОбласти

