#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокаОтправленные = "";
	СтрокаНеОтправленные = "";
	
	Для Каждого ОтправленныйФайл Из Параметры.Отправленные Цикл
		СтрокаОтправленные = СтрокаОтправленные + Символы.ПС + ОтправленныйФайл;
	КонецЦикла;
	
	Для Каждого НеОтправленныйФайл Из Параметры.НеОтправленные Цикл
		СтрокаНеОтправленные = СтрокаНеОтправленные + Символы.ПС + НеОтправленныйФайл;
	КонецЦикла;
	
	КоличествоОтправленных = Параметры.Отправленные.Количество();
	КоличествоНеОтправленных = Параметры.НеОтправленные.Количество();
	СообщениеДляВыводаОтправленные = "";
	СообщениеДляВыводаНеОтправленные = "";
	
	Если КоличествоОтправленных > 0 Тогда
		
		СообщениеДляВыводаОтправленные = "Файлы отправлены. Время ожидания от 1 до нескольких минут. 
		|Статус обработки можно посмотреть в колонке ""Распознавание"" формы списка документов."
		 + Символы.ПС + СтрокаОтправленные;
		 
	КонецЕсли;
	
	Если КоличествоНеОтправленных > 0 Тогда
		
		СообщениеДляВыводаНеОтправленные = Символы.ПС + СтрокаНеОтправленные;
		
	КонецЕсли;
	
	СообщениеДляВывода = "";
	Если КоличествоОтправленных > 0 И КоличествоНеОтправленных > 0 Тогда
		СообщениеДляВывода = НСтр("ru = '%1
		|
		|Не удалось отправить файлы: %2'", ОбщегоНазначения.КодОсновногоЯзыка());
		Элементы.ПодсказкаЗаголовок1.Заголовок = 
			СтрШаблон(СообщениеДляВывода, СообщениеДляВыводаОтправленные , СообщениеДляВыводаНеОтправленные);
	ИначеЕсли КоличествоОтправленных > 0 Тогда
		СообщениеДляВывода = НСтр("ru = '%1'", ОбщегоНазначения.КодОсновногоЯзыка());
		Элементы.ПодсказкаЗаголовок1.Заголовок = 
			СтрШаблон(СообщениеДляВывода, СообщениеДляВыводаОтправленные);
	ИначеЕсли КоличествоНеОтправленных > 0 Тогда
		СообщениеДляВывода = НСтр("ru = 'Не удалось отправить файлы: %1'", ОбщегоНазначения.КодОсновногоЯзыка());
		Элементы.ПодсказкаЗаголовок1.Заголовок = 
			СтрШаблон(СообщениеДляВывода, СообщениеДляВыводаНеОтправленные);
	Иначе
		Элементы.ПодсказкаЗаголовок1.Заголовок = СообщениеДляВывода;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы  

&НаКлиенте
Процедура ПродолжитьДействие(Команда)
	
	Если БольшеНеПоказывать = Истина Тогда
		
		ПоказыватьСообщениеОбОтправкеФайлаВСервисРаспознавания = Не БольшеНеПоказывать;
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("НастройкиПрограммы", 
			"ПоказыватьСообщениеОбОтправкеФайлаВСервисРаспознавания", 
				ПоказыватьСообщениеОбОтправкеФайлаВСервисРаспознавания,,, Истина);
				
	КонецЕсли;
	
	Закрыть(); 
	
КонецПроцедуры  

#КонецОбласти
