
&НаСервере
Функция ОчиститьВсеНаСервере(ДопРеквизит)
	ИмяОбработки = РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя();
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры(); 
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, ИмяОбработки+".ОчиститьВсеФоново", ДопРеквизит);
КонецФункции

&НаКлиенте
Процедура ОчиститьВсе(Команда)  
	Возврат; //затычка
	ФоноваяПроцедура = ОчиститьВсеНаСервере(Объект.ДопРеквизит);  
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
    ПараметрыОжидания.Интервал = 2;
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоноваяПроцедура, 
		Новый ОписаниеОповещения("ОчиститьВсеЗавершение", ЭтотОбъект), ПараметрыОжидания);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсеЗавершение(Результат, ДопПараметр) Экспорт
	Успешно = Ложь;
    Если Результат = Неопределено Тогда
        Возврат;
    ИначеЕсли Результат.Статус = "Ошибка" Тогда
        ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	ИначеЕсли Результат.Статус = "Выполнено" Тогда 
		Успешно = Истина;
	КонецЕсли;
	Заг = "Очистка реквизита"; 
	Если Успешно тогда
		Стр = "Реквизит очищен";
	Иначе
		Стр = "Ошибка очистки реквизита";
	КонецЕсли;
    ПоказатьПредупреждение(,Стр,,Заг);
КонецПроцедуры

