&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВстроеннаяПочтаИспользуется = ВстроеннаяПочтаКлиент.ВстроеннаяПочтаИспользуется();
	
	Если Не ВстроеннаяПочтаИспользуется Тогда
		ТекстСообщения = НСтр("ru = 'Чтобы открыть почту, включите персональную настройку ""Встроенная почта"".'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	КлючеваяОперация = "ПочтаОткрытиеФормыСписка";
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
	ИмяФормы = "ЖурналДокументов.ЭлектроннаяПочта.ФормаСписка";
#Если МобильныйКлиент Тогда
	ИмяФормы = "ЖурналДокументов.ЭлектроннаяПочта.Форма.МК_ФормаСписка";
#КонецЕсли
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму(
		ИмяФормы,
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		Ложь,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
