//&После("ПередЗаписью")  
//Процедура Расш1_ПоменятьДействиеВТоварах()  
//	Попытка
//		Документ = ЭтотОбъект;
//		Если Документ.Склад = Справочники.Склады.НайтиПоНаименованию("Склад № 20 (комплектующие)") 
//			ИЛИ Документ.Склад = Справочники.Склады.НайтиПоНаименованию("Склад № 21 (метизы)") Тогда 
//			//ИЛИ Документ.Склад = Справочники.Склады.НайтиПоНаименованию("Детальная кладовая") Тогда 
//			КоличествоСтрокТЧ = Документ.Товары.Количество(); 
//			Для Счетчик= -(КоличествоСтрокТЧ - 1) по 0 Цикл
//				СтрокаТЧ = Документ.Товары[-Счетчик]; 
//				Действие = СтрокаТЧ.ВариантОбеспечения;
//				Если НЕ (Действие = Перечисления.ВариантыОбеспечения.Отгрузить 
//					ИЛИ Действие = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления 
//					ИЛИ Действие = Перечисления.ВариантыОбеспечения.НеТребуется
//					ИЛИ Действие = Перечисления.ВариантыОбеспечения.СоСклада) Тогда
//					СтрокаТЧ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления;
//				КонецЕсли;
//			КонецЦикла; 
//		КонецЕсли;
//	Исключение
//		Сооб = Новый СообщениеПользователю;
//		Сооб.Текст =  "Не удалось обработать документ";
//		Сооб.Сообщить();
//	КонецПопытки;
//КонецПроцедуры 