#Область ПрограммныйИнтерфейс

// Отправить файл документа на распознавание.
// 
// Параметры:
//  Файл - СправочникСсылка.Файлы
Процедура ОтправитьФайлДокументаНаРаспознавание(Файл) Экспорт
	
	РаспознаваниеДокументов.ОтправитьФайлДокументаНаРаспознавание(Файл);
	
КонецПроцедуры

// Прервать распознавание документа.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ОписаниеОшибки - Строка
Процедура ПрерватьРаспознаваниеДокумента(ДокументСсылка, ОписаниеОшибки = "") Экспорт
	
	РаспознаваниеДокументов.ПрерватьРаспознаваниеДокумента(ДокументСсылка, ОписаниеОшибки);
	
КонецПроцедуры

// Возращает признак возможности использования сервиса.
// 
// Параметры:
//  СРасшифровкой - Булево - С расшифровкой
// 
// Возвращаемое значение:
//  Булево - см. РаспознаваниеДокументов.ИспользованиеДоступно
Функция ИспользованиеДоступно(СРасшифровкой = Ложь) Экспорт
	
	Возврат РаспознаваниеДокументов.ИспользованиеДоступно(СРасшифровкой);
	
КонецФункции

#КонецОбласти



