
#Область ПрограммныйИнтерфейс

Процедура ДобавитьСтрокуДокументаВФайлыПриНеобходимости(Форма) Экспорт
	
	Если Не Форма.ИспользоватьПредпросмотрФайлов Тогда
		Возврат;
	КонецЕсли;
	
	ФайлыЭлементы = Форма.Файлы.ПолучитьЭлементы();
	
	НаименованиеДокумента = НСтр("ru = 'Документ'");
	
	РольФайла = Неопределено;
	Если ФайлыЭлементы.Количество() <> 0 Тогда
		Строка1 = ФайлыЭлементы.Получить(0);
		
		Если Строка1.Наименование = НаименованиеДокумента Тогда
			Возврат;
		КонецЕсли;
		
		РольФайла = Строка1.РольФайла;
	КонецЕсли;
	
	НовСтр = ФайлыЭлементы.Вставить(0);
	НовСтр.ЭтоДокумент = Истина;
	НовСтр.Наименование = НаименованиеДокумента;
	НовСтр.ИндексКартинки = 10;
	НовСтр.СтатусПроверкиЭП = -1;
	Если Форма.Объект.ПодписанЭП Тогда
		НовСтр.СтатусПроверкиЭП = 3;
	КонецЕсли;
	НовСтр.РольФайла = РольФайла;
	
КонецПроцедуры

#КонецОбласти
