
&После("ЗаполнитьШапкуДокументаПоЗаказу")
Процедура Расш1_ЗаполнитьШапкуДокументаПоЗаказу(Объект, ПараметрыЗаполнения, МассивЗаказов)
	// Добавляет в Основание название и количество изделий
	Попытка
		Если ЗначениеЗаполнено(Объект.ЗаказПереработчику) И  
				Объект.ЗаказПереработчику.Продукция.Количество() = 1 тогда
			Врем = Объект.ЗаказПереработчику.Продукция[0];   
			Если ЗначениеЗаполнено(Врем.Упаковка) тогда
				Врем1 = Врем.Упаковка
			Иначе
				Врем1 = Врем.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;
			Объект.Основание = Объект.Основание + ", на " + Врем.Номенклатура + ", " + Врем.КоличествоУпаковок + " " + Врем1;
		КонецЕсли;
	Исключение КонецПопытки;
КонецПроцедуры
