// @strict-types


#Область ПрограммныйИнтерфейс

// Вызывается из ПриЗаписи модуля набора записей регистра сведений ИсполителиРолей
// 
// Параметры:
//  СтарыеСоставыКонтейнеров - Соответствие  из КлючИЗначение:
//   * Ключ - СправочникСсылка.ПолныеРоли
//   * Значение - Массив из СправочникСсылка.Сотрудники
//  НовыеСоставыКонтейнеров - Соответствие  из КлючИЗначение:
//   * Ключ - СправочникСсылка.ПолныеРоли
//   * Значение - Массив из СправочникСсылка.Сотрудники
//  Отказ - Булево
//  Замещение - Булево
Процедура ПриЗаписи(СтарыеСоставыКонтейнеров, НовыеСоставыКонтейнеров, Отказ, Замещение) Экспорт

// Локализация

	РаботаСВнешнимПодписанием.ИсполнителиРолейПриЗаписи(СтарыеСоставыКонтейнеров, НовыеСоставыКонтейнеров, Отказ);

// Локализация Конец

КонецПроцедуры	

#КонецОбласти