#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДатаСеанса();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.КадроваяИсторияСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаЗаписи Из Записи Цикл
		Движение = Движения.КадроваяИсторияСотрудников.Добавить();
		Движение.Период = ТекСтрокаЗаписи.ДатаСобытия;
		Движение.СотрудникИС = ТекСтрокаЗаписи.СотрудникИС;
		Движение.ФизическоеЛицо = ТекСтрокаЗаписи.ФизическоеЛицо;
		Движение.ВидСобытия = ТекСтрокаЗаписи.ВидСобытия;
		Движение.ДействуетДо = ТекСтрокаЗаписи.ДействуетДо;
		Движение.Должность = ТекСтрокаЗаписи.Должность;
		Движение.Подразделение = ТекСтрокаЗаписи.Подразделение;
		Движение.ЭтоГоловнойСотрудник = ТекСтрокаЗаписи.ЭтоГоловнойСотрудник;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли