////////////////////////////////////////////////////////////////////////////////
// Кэши на время взова, для оптимизации работы (сервер, повторное использование).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует кеш области просмотра.
// 
// Возвращаемое значение:
//  Структура - Кеш области просмотра:
//   *  Заполнен - Булево.
//   *  Задача - ДокументСсылка.Задача.
//   *  ЗадачаОбъект - ДокументОбъект.Задача, Неопределено - Задача.
//   *  ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи.
//   *  РеквизитыДействияЗадачи - Структура, Неопределено - Реквизиты действия задачи.
//   *  ДанныеДействияЗадачи - СтрокаТаблицыЗначений
//                           - Неопределено
//   *  ДанныеОбзораДокумента - ВыборкаИзРезультатаЗапроса
//                            - Неопределено
//   *  ЗадачаПроцесса - ЗадачаСсылка.ЗадачаИсполнителя
//   *  РеквизитыЗадачиПроцесса - Структура
//                              - Неопределено
//   *  Процесс - БизнесПроцессСсылка
//              - Неопределено
//   *  РеквизитыПроцесса - Структура
//                        - Неопределено
//   *  ДействиеОбработки - см. ОпределяемыйТип.Действия
//   *  РеквизитыДействияОбработки - Структура
//                                 - Неопределено
//   *  ОбработкаОбъекта - СправочникСсылка.ОбработкиОбъектов
//   *  РеквизитыОбработкиОбъекта - Структура
//                                - Неопределено
//   *  ВидДействия - СправочникСсылка.ВидыДействий
//   *  РеквизитыВидаДействия - Структура
//                            - Неопределено
//
Функция КэшЗадачаОбластьПросмотра() Экспорт
	
	КэшОбластиПросмотра = Новый Структура;
	КэшОбластиПросмотра.Вставить("Заполнен", Ложь);
	КэшОбластиПросмотра.Вставить("Задача", Документы.Задача.ПустаяСсылка());
	КэшОбластиПросмотра.Вставить("ЗадачаОбъект", Неопределено);
	КэшОбластиПросмотра.Вставить("ДействиеЗадачи", Документы.ДействиеЗадачи.ПустаяСсылка());
	КэшОбластиПросмотра.Вставить("РеквизитыДействияЗадачи", Неопределено);
	КэшОбластиПросмотра.Вставить("ДанныеДействияЗадачи", Неопределено);
	КэшОбластиПросмотра.Вставить("ДанныеОбзораДокумента", Неопределено);
	КэшОбластиПросмотра.Вставить("ЗадачаПроцесса", Задачи.ЗадачаИсполнителя.ПустаяСсылка());
	КэшОбластиПросмотра.Вставить("РеквизитыЗадачиПроцесса", Неопределено);
	КэшОбластиПросмотра.Вставить("Процесс", Неопределено);
	КэшОбластиПросмотра.Вставить("РеквизитыПроцесса", Неопределено);
	КэшОбластиПросмотра.Вставить("ДействиеОбработки", Неопределено);
	КэшОбластиПросмотра.Вставить("РеквизитыДействияОбработки", Неопределено);
	КэшОбластиПросмотра.Вставить("ОбработкаОбъекта", Справочники.ОбработкиОбъектов.ПустаяСсылка());
	КэшОбластиПросмотра.Вставить("РеквизитыОбработкиОбъекта", Неопределено);
	КэшОбластиПросмотра.Вставить("ВидДействия", Справочники.ВидыДействий.ПустаяСсылка());
	КэшОбластиПросмотра.Вставить("РеквизитыВидаДействия", Неопределено);
	
	Возврат КэшОбластиПросмотра;
	
КонецФункции

// Кэш для формы элементы справочника документы предприятия.
// 
// Возвращаемое значение:
//  Структура - Кэш для формы элементы справочника документы предприятия:
//   * Инициализирован - Булево - Кэш инициализирован.
//   * КэшДокумента - Структура - Кэш документа:
//     ** Ссылка - СправочникСсылка.ДокументыПредприятия.
//     ** ВидДокумента - СправочникСсылка.ВидыДокументов.
//     ** Шаблон - СправочникСсылка.ШаблоныДокументов.
//     ** ЕстьФайлыШаблона - Булево.
//     ** Контрагент - СправочникСсылка.Контрагенты.
//     ** ПодписалОтКонтрагента - СправочникСсылка.КонтактныеЛица.
//     ** ДатаСоздания - Дата.
//     ** ДатаРегистрации - Дата.
//     ** Стороны - ТабличнаяЧасть.
//   * КэшВидаДокумента - Структура - Кэш вида документа. См. Делопроизводство.КэшВидаДокумента.
//   * УчастникиРабочейГруппы - См. РегистрыСведений.РабочиеГруппы.ПолучитьУчастниковПоОбъекту.
//   * ВсеСостоянияДокумента - См. Делопроизводство.ПолучитьВсеСостоянияДокумента.
//   * КэшОбработки - Структура - Кэш обработки:
//     ** Ссылка - СправочникСсылка.ОбработкиОбъектов.
//     ** ДатаСоздания - Дата.
//     ** Состояние - ПеречислениеСсылка.СостоянияОбработкиОбъектов.
//     ** ДатаИзмененияСостояния - Дата.
//     ** ДатаНачала - Дата.
//
Функция КэшДокументыПредприятияФормаЭлемента() Экспорт
	
	КэшДокументыПредприятияФормаЭлемента = Новый Структура;
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("Инициализирован", Ложь);
	
	КэшДокумента = Новый Структура;
	КэшДокумента.Вставить("Ссылка");
	КэшДокумента.Вставить("ВидДокумента");
	КэшДокумента.Вставить("Шаблон");
	КэшДокумента.Вставить("ЕстьФайлыШаблона");
	КэшДокумента.Вставить("Контрагент");
	КэшДокумента.Вставить("ПодписалОтКонтрагента");
	КэшДокумента.Вставить("ДатаСоздания");
	КэшДокумента.Вставить("ДатаРегистрации");
	КэшДокумента.Вставить("Стороны");
	КэшДокументыПредприятияФормаЭлемента.Вставить("КэшДокумента", КэшДокумента);
	
	КэшВидаДокумента = Делопроизводство.КэшВидаДокумента(Справочники.ВидыДокументов.ПустаяСсылка());
	КэшДокументыПредприятияФормаЭлемента.Вставить("КэшВидаДокумента", КэшВидаДокумента);
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("УчастникиРабочейГруппы", Новый ТаблицаЗначений);
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("ВсеСостоянияДокумента", Новый ТаблицаЗначений);
	
	КэшОбработки = Новый Структура;
	КэшОбработки.Вставить("Ссылка");
	КэшОбработки.Вставить("ДатаСоздания");
	КэшОбработки.Вставить("Состояние");
	КэшОбработки.Вставить("ДатаИзмененияСостояния");
	КэшОбработки.Вставить("ДатаНачала");
	КэшДокументыПредприятияФормаЭлемента.Вставить("КэшОбработки", КэшОбработки); 
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("ТекущиеДействияПодписания", Новый ТаблицаЗначений);
	КэшДокументыПредприятияФормаЭлемента.Вставить("ТекущиеДействияУтверждения", Новый ТаблицаЗначений);
	
	Возврат КэшДокументыПредприятияФормаЭлемента;
	
КонецФункции

// Получает цвет стиля по имени.
//
// Параметры:
//  ИмяЦветаСтиля - Строка
// 
// Возвращаемое значение:
//  Цвет
//
Функция ЦветСтиля(ИмяЦветаСтиля) Экспорт
	
	Возврат ЦветаСтиля[ИмяЦветаСтиля];
	
КонецФункции

// Кэш графиков работы отчета "Сводка работ".
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - СправочникСсылка.Сотрудники
//   * Значение - СправочникСсылка.ГрафикиРаботы
//
Функция КэшГрафиковРаботы() Экспорт
	
	КэшГрафиковРаботы = Новый Соответствие;
	
	Возврат КэшГрафиковРаботы;
	
КонецФункции

// Кэш рабочих дней отчета "Сводка работ".
//
// Параметры:
//  ГрафикРаботы - СправочникСсылка.ГрафикиРаботы
// 
// Возвращаемое значение:
//  Структура:
//   * ЗаполненныеГода - Соответствие из КлючИЗначение:
//    ** Ключ - Число - Год.
//    ** Значение - Булево - Истина, если заполнено.
//   * РабочиеДни - Соответствие из КлючИЗначение:
//    ** Ключ - Дата - Начало дня.
//    ** Значение - Булево - Это рабочий день.
//   * КоличествоРабочихДней - Соответствие из КлючИЗначение:
//    ** Ключ - Дата - Начало дня.
//    ** Значение - Число - Количество рабочих дней относительно начала отсчёта.
//   * НачалоОтсчета - Дата.
//
Функция КэшРабочихДней(ГрафикРаботы) Экспорт
	
	КэшРабочихДней = Новый Структура;
	КэшРабочихДней.Вставить("ЗаполненныеГода", Новый Соответствие);
	КэшРабочихДней.Вставить("РабочиеДни", Новый Соответствие);
	КэшРабочихДней.Вставить("КоличествоРабочихДней", Новый Соответствие);
	КэшРабочихДней.Вставить("НачалоОтсчета", Дата(1, 1, 1));
	
	Возврат КэшРабочихДней;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирует кэш обзора документа.
// 
// Возвращаемое значение:
//  Структура:
//   * Заполнен - Булево
//   * Документ - СправочникСсылка.ДокументыПредприятия
//   * РеквизитыДокумента - Структура
//                        - Неопределено
//   * ВидДокумента - СправочникСсылка.ВидыДокументов
//   * КэшВидаДокумента - Структура
//                      - Неопределено
// 
Функция КэшОбзораДокумента() Экспорт
	
	КэшОбзораДокумента = Новый Структура;
	КэшОбзораДокумента.Вставить("Заполнен", Ложь);
	КэшОбзораДокумента.Вставить("Документ", Справочники.ДокументыПредприятия.ПустаяСсылка());
	КэшОбзораДокумента.Вставить("РеквизитыДокумента", Неопределено);
	КэшОбзораДокумента.Вставить("ВидДокумента", Справочники.ВидыДокументов.ПустаяСсылка());
	КэшОбзораДокумента.Вставить("КэшВидаДокумента", Делопроизводство.НовыйКэшВидаДокумента());
	
	Возврат КэшОбзораДокумента;
	
КонецФункции

#КонецОбласти