#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МножителиПартийИПолуфабрикатов.Период КАК ДатаПотребности,
		|	МножителиПартийИПолуфабрикатов.Калькуляция,
		|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции,
		|	МножителиПартийИПолуфабрикатов.Продукция,
		|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции,
		|	МножителиПартийИПолуфабрикатов.Назначение,
		|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката,
		|	МножителиПартийИПолуфабрикатов.КлючПартия КАК КлючПартия,
		|	МножителиПартийИПолуфабрикатов.Полуфабрикат,
		|	МножителиПартийИПолуфабрикатов.Порядок,
		|	МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката
		|ИЗ
		|	РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
		|ГДЕ
		|	МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
		|	И НЕ МножителиПартийИПолуфабрикатов.РасчетЗавершен
		|";
	
	Запрос.УстановитьПараметр("Калькуляция", Отбор.Калькуляция.Значение);
	
	ТаблицаОчередь = Запрос.Выполнить().Выгрузить();
	Если ТаблицаОчередь.Количество() > 0 Тогда
		РегистрыСведений.ОчередьРасчетаПлановыхКалькуляций.ЗаписатьОчередь(ТаблицаОчередь, Отбор.Калькуляция.Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
