
&НаСервере
Процедура СдвинутьСтроку(ИндексСтроки, Смещение)
	Объект.Товары.Сдвинуть(ИндексСтроки, Смещение);
	Если ИспользоватьУпаковочныеЛисты Тогда
		УпаковочныеЛистыСервер.ПеренумероватьСтроки(ЭтотОбъект, Объект.Товары);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПереместитьВверхПосле(Команда)  
	Инд = Элементы.Товары.ТекущиеДанные.НомерСтроки -1;
	Если Инд >0 тогда                                
		СдвинутьСтроку(Инд, -1);
		//Элементы.Товары.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПереместитьВнизПосле(Команда)
	Инд = Элементы.Товары.ТекущиеДанные.НомерСтроки -1;
	Если Инд < Объект.Товары.Количество()-1 тогда
		СдвинутьСтроку(Инд, 1);
	КонецЕсли;
КонецПроцедуры

