// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из СхемыПроцессовКлиентСервер.ОбновитьНастройкиПоСхеме, дополняет структуру локализуемыми данными
// 
// Параметры:
//  ИменаПоложительныхЛинийУсловий - Соответствие из КлючИЗначение:
//		Ключ - строка - слово "Да" на различных языках
//		Значение - Булево
// Пример: ИменаПоложительныхЛинийУсловий["Да"] = Истина;
// 
Процедура ДополнитьИменаПоложительныхЛинийУсловий(ИменаПоложительныхЛинийУсловий) Экспорт
	ИменаПоложительныхЛинийУсловий["Да"] = Истина;
КонецПроцедуры	

#КонецОбласти