// @strict-types

#Область ПрограммныйИнтерфейс

// Возвращает структуру прав доступа к указанному объекту для указанного пользователя.
// Если пользователь не указан, то используется текущий пользователь.
//
// Параметры:
//	ОбъектДоступа - ЛюбаяСсылка - Ссылка на объект, чьи права нужно получить.
//	Пользователь - СправочникСсылка.Пользователи -
//		 		 - Неопределено - Тогда вычисляются права текущего пользователя.
//	КешДанных - см. ОбработкаЗапросовXDTOБизнесПроцессыИЗадачи.ДополнитьДанныеЗадачИСформироватьКешДанных
//
// Возвращаемое значение:
//	См. ДокументооборотПраваДоступа.ПраваПользователяПоОбъекту
Функция ПраваПользователяПоОбъекту(ОбъектДоступа, Пользователь = Неопределено, КешДанных = Неопределено) Экспорт
	
	Возврат ДокументооборотПраваДоступа.ПраваПользователяПоОбъекту(ОбъектДоступа, Пользователь, КешДанных);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьПраваВсехДанных(Немедленно = Неопределено) Экспорт
	
	ДокументооборотПраваДоступа.ОбновитьПраваВсехДанных(Немедленно);
	
КонецПроцедуры

#КонецОбласти