
&Вместо("СформироватьЭтапыВнутриЗамераВремени")
Функция Расш1_СформироватьЭтапыВнутриЗамераВремени(Параметры) 
	Для Каждого Распоряжение из Параметры.Распоряжения
	Цикл
		СпецификацияТребуетПроверки = Расш1_ОбщийМодуль1.СпецификацияТребуетПроверкиСлужбамиСКБиОГТ(Распоряжение);  
		Если СпецификацияТребуетПроверки Тогда 
			Результат = Новый Структура;			
			Результат.Вставить("ЕстьОшибка", Ложь);
			Результат.Вставить("ОшибкаТекст", Неопределено);
			Результат.Вставить("ОшибкаСсылка", Неопределено);			
			Результат.Вставить("СформированоДокументов", 0);			
			Результат.Вставить("Распоряжения", Параметры.Распоряжения);
			
			Возврат Результат; 
		КонецЕсли;
	КонецЦикла;	
	Результат = ПродолжитьВызов(Параметры);
	Обработки.НастроитьЭтапыПослеСоздания.ВыполнитьНастройкуЭтапов(Параметры);
	Возврат Результат; 
КонецФункции
