#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// Определяет ставку налога на прибыль, подлежащего зачислению в федеральный бюджет, указанную в п. 1 ст. 284 НК РФ.
//
// Параметры:
// 	Период - Дата - Период действия ставки.
//
// Возвращаемое значение:
// 	Ставка - Число - Значение ставки по умолчанию.
//
Функция ЗначениеПоУмолчаниюФедеральныйБюджет(Период) Экспорт
	
	Если Действует176ФЗ(Период) Тогда
		Если ПрименяютсяВременныеСтавкиНалога(Период) Тогда
			Возврат 8;
		КонецЕсли;
		
		Возврат 7;				
	Иначе	
		Если ПрименяютсяВременныеСтавкиНалога(Период) Тогда
			Возврат 3;
		КонецЕсли;
		
		Возврат 2;		
	КонецЕсли;
	
КонецФункции

// Определяет ставку налога на прибыль, подлежащего зачислению в бюджеты субъектов Российской Федерации, указанную в п.
// 1 ст. 284 НК РФ.
//
// Параметры:
// 	Период - Дата - Период действия ставки.
//
// Возвращаемое значение:
// 	Ставка - Число - Значение ставки по умолчанию.
//
Функция ЗначениеПоУмолчаниюРегиональныйБюджет(Период) Экспорт
	
	Если ПрименяютсяВременныеСтавкиНалога(Период) Тогда
		Возврат 17;
	КонецЕсли;
	
	Возврат 18;
	
КонецФункции

// Определяет, попадает ли указанный период в интервал, на который установлены особые ставки налога на прибыль (от 21.11.2022 N 443-ФЗ (ред. от 31.07.2023))
//
// Параметры:
// 	Период - Дата - Период проверки.
//
// Возвращаемое значение:
// 	Результат - Булево - Признак примерения временной ставки.
//
Функция ПрименяютсяВременныеСтавкиНалога(Период) Экспорт
	
	Возврат (НачалоГода(Период) >= '2017-01-01' 
		И НачалоГода(Период) <= '2030-01-01');
	
КонецФункции

// Возвращает дату начала действия редакции 1 ст. 284 НК РФ в ред. Федерального закона от 12.07.2024 N 176-ФЗ
//
// Возвращаемое значение:
// 	Дата - Дата начала действия редакции.
//
Функция ДатаНачалаДействия176ФЗ() Экспорт
	
	Возврат Дата('2025-01-01');
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Определяет, попадает ли указанный период в период действия редакции 1 ст. 284 НК РФ в ред. Федерального закона от 12.07.2024 N 176-ФЗ
//
// Параметры:
// 	Период - Дата - Период проверки.
//
// Возвращаемое значение:
// 	Булево - Признак действия редакции ставки.
//
Функция Действует176ФЗ(Знач Период)

	Возврат (НачалоГода(Период) >= НачалоГода(ДатаНачалаДействия176ФЗ()));	

КонецФункции

#Область ОбновлениеИнформационнойБазы

Функция ДобавитьНастройкиСНовымиСтавками() Экспорт
	
	ДобавитьНастройкиСНовымиСтавками = Ложь;
	
	Если НалоговыйУчет.ПрименяютсяРазныеСтавкиНалогаНаПрибыль() Тогда
		Возврат ДобавитьНастройкиСНовымиСтавками;
	КонецЕсли;
	
	ДатаНачалаДействияНовыхСтавок = ДатаНачалаДействия176ФЗ();
	СтавкаНалогаФБПоУмолчанию = ЗначениеПоУмолчаниюФедеральныйБюджет(ДатаНачалаДействияНовыхСтавок - 1);
	СтавкаСубъектРФПоУмолчанию = ЗначениеПоУмолчаниюРегиональныйБюджет(ДатаНачалаДействияНовыхСтавок - 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_ДобавитьНастройкиСНовымиСтавками();
	Запрос.УстановитьПараметр("КонецМесяцаНачалаДействияНовыхСтавок", КонецМесяца(ДатаНачалаДействияНовыхСтавок));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() <> 1 Тогда
		Возврат ДобавитьНастройкиСНовымиСтавками;		
	КонецЕсли;
	
	Выборка.Следующий();
	
	Если НЕ (Выборка.ВариантНалогообложенияПрибыли <> Справочники.ВариантыНалогообложенияПрибыли.ПустаяСсылка()
		ИЛИ Выборка.Период >= ДатаНачалаДействияНовыхСтавок
		ИЛИ Выборка.СтавкаФБ <> СтавкаНалогаФБПоУмолчанию
		ИЛИ Выборка.СтавкаСубъектРФ <> СтавкаСубъектРФПоУмолчанию) Тогда
	
		ДобавитьНастройкиСНовымиСтавками = Истина;		
	КонецЕсли;
	
	Возврат ДобавитьНастройкиСНовымиСтавками;
	
КонецФункции

Функция ТекстЗапроса_ДобавитьНастройкиСНовымиСтавками()
	
	Текст = "
	|ВЫБРАТЬ
	|	СтавкиНалогаНаПрибыльДляВсехОрганизацийСрезПоследних.ВариантНалогообложенияПрибыли КАК ВариантНалогообложенияПрибыли,
	|	СтавкиНалогаНаПрибыльДляВсехОрганизацийСрезПоследних.СтавкаФБ КАК СтавкаФБ,
	|	СтавкиНалогаНаПрибыльДляВсехОрганизацийСрезПоследних.СтавкаСубъектРФ КАК СтавкаСубъектРФ,
	|	СтавкиНалогаНаПрибыльДляВсехОрганизацийСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.СтавкиНалогаНаПрибыльДляВсехОрганизаций.СрезПоследних(&КонецМесяцаНачалаДействияНовыхСтавок,) КАК
	|		СтавкиНалогаНаПрибыльДляВсехОрганизацийСрезПоследних
	|ГДЕ
	|	НЕ ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			Документ.РегламентнаяОперация КАК РегламентнаяОперация
	|		ГДЕ
	|			РегламентнаяОперация.Проведен
	|			И РегламентнаяОперация.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыРегламентныхОпераций.РасчетНалогаНаПрибыль)
	|			И РегламентнаяОперация.Дата >= НАЧАЛОПЕРИОДА(&КонецМесяцаНачалаДействияНовыхСтавок, МЕСЯЦ))";	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли


