
#Область ПрограммныйИнтерфейс

Функция ОбработкаПереходаПоНавигационнойСсылке(ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка,
	СсылкаДляПерехода, БазоваяСсылкаДляПерехода, ПараметрыСсылки) Экспорт

	// Локализация
	Если ПараметрыСсылки[ИнтеграцияShareДокументооборотКлиентСервер.ПараметрОшибкиПравДоступа()] <> Неопределено Тогда
		СсылкаДляПерехода = СтрЗаменить(СсылкаДляПерехода,
		ИнтеграцияShareДокументооборотКлиентСервер.УсловиеОшибкиПравДоступа(), "");
		ИнтеграцияShareДокументооборотКлиент.ВывестиОписаниеОшибкиДоступа(Неопределено, СсылкаДляПерехода);
		Возврат Истина;
	КонецЕсли;
	// Локализация Конец
	
	Возврат Ложь;
	
КонецФункции

Процедура ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска) Экспорт
	
	// Локализация
	// СервисShare
	ИнтеграцияShareКлиент.ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска);
	// Конец СервисShare
	// Локализация Конец

КонецПроцедуры

Процедура ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка) Экспорт

	// Локализация
	// СервисShare
	ИнтеграцияShareКлиент.ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка);
	// Конец СервисShare
	// Локализация Конец

КонецПроцедуры

#КонецОбласти