
&НаСервере
Процедура Расш1_ПриЧтенииНаСервереПеред(ТекущийОбъект)
	Если Параметры.Свойство("НесохраненныйДокумент") Тогда
		ЭТП.ВзятьОбъектИзХранилища(Объект, Параметры.НесохраненныйДокумент);
		Модифицированность = Истина;                 
	КонецЕсли;
	Если Параметры.Свойство("АРМ_ЛокальныйДиспетчер") Тогда
		Модифицированность = Ложь;                 
		АРМ_ЛокальныйДиспетчер = Истина; 
		Элементы.ФормаПровести.Доступность = Ложь;                  
		Элементы.ФормаПровестиИЗакрыть.Доступность = Ложь;
		//Команды.ЗаписатьДокумент.ИзменяетСохраняемыеДанные = Ложь;
	КонецЕсли; 
КонецПроцедуры


&НаСервере
Функция СохранитьДокументВХранилище(Адрес0)
	Док = РеквизитФормыВЗначение("Объект");
	Возврат ЭТП.СохранитьОбъектВХранилище(Док, Адрес0);
КонецФункции

&НаКлиенте
Процедура Расш1_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Если АРМ_ЛокальныйДиспетчер тогда  
		Если Модифицированность тогда
			ИзмДокумент = Новый Структура;
			ИзмДокумент.Вставить("Адрес", СохранитьДокументВХранилище(ВладелецФормы.УникальныйИдентификатор));
			ИзмДокумент.Вставить("Ссылка", Объект.Ссылка);
			Оповестить("АРМ_ЛокальныйДиспетчерИзменениеДокумента", ИзмДокумент);
			Модифицированность = Ложь;
		КонецЕсли;                    
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
