
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Т1 
	|	ПО Т.АналитикаУчетаПоПартнерам = Т1.КлючАналитики
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Т1.Организация)
	|	И ЗначениеРазрешено(Т1.Партнер)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// При определении доступных видов оповещений пользователей.
// 
// Параметры:
//  ОписаниеВидовОповещений - см. ОповещенияПользователейОСобытиях.ОписаниеВидовОповещенийПользователей
Процедура ПриОпределенииДоступныхВидовОповещенийПользователей(ОписаниеВидовОповещений) Экспорт
	
	ГруппаВидаОповещенийВзаиморасчеты = ОповещенияПользователейОСобытиях.ГруппаВидаОповещений("ВзаиморасчетыСПоставщиками");
	
	НовыйВидОповещений = ОповещенияПользователейОСобытиях.ДобавитьОписаниеВидаОповещенийПользователей(ОписаниеВидовОповещений);
	НовыйВидОповещений.ГруппаВидаОповещений = ГруппаВидаОповещенийВзаиморасчеты;
	НовыйВидОповещений.Идентификатор = "fd23450d-ba3c-40c5-a543-a567e536d497";
	НовыйВидОповещений.Наименование = НСтр("ru = 'Просрочена оплата до подтверждения';
											|en = 'Overdue payment before confirmation'", ОбщегоНазначения.КодОсновногоЯзыка());
	НовыйВидОповещений.ТипОповещения = Перечисления.ТипыОповещенийПользователей.Неоперативное;
	НовыйВидОповещений.ИмяШаблонаСКД = Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланОплат.Макеты.Оповещения_АвансПросрочено.ПолноеИмя();
	НовыйВидОповещений.ШаблонТекстаОповещения = "ru = 'Просрочена оплата до подтверждения [Сумма] [Валюта].';
												|en = 'The payment before confirmation of [Сумма] [Валюта] is overdue.'"; // @NStr-1
	НовыйВидОповещений.ТекстСгруппированногоОповещения = "ru = 'Просрочена оплата до подтверждения.';
														|en = 'The payment before confirmation is overdue.'"; // @NStr-1
	
	НовыйВидОповещений = ОповещенияПользователейОСобытиях.ДобавитьОписаниеВидаОповещенийПользователей(ОписаниеВидовОповещений);
	НовыйВидОповещений.ГруппаВидаОповещений = ГруппаВидаОповещенийВзаиморасчеты;
	НовыйВидОповещений.Идентификатор = "89a85149-1099-4f5d-bcc7-694c518533bb";
	НовыйВидОповещений.Наименование = НСтр("ru = 'Приближение срока оплаты до подтверждения';
											|en = 'Approaching payment due date before confirmation'", ОбщегоНазначения.КодОсновногоЯзыка());
	НовыйВидОповещений.ТипОповещения = Перечисления.ТипыОповещенийПользователей.Неоперативное;
	НовыйВидОповещений.ИмяШаблонаСКД = Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланОплат.Макеты.Оповещения_АвансПриближается.ПолноеИмя();
	НовыйВидОповещений.ШаблонТекстаОповещения = "ru = 'Приближается срок оплаты до подтверждения на сумму [Сумма] [Валюта].';
												|en = 'The payment due date before confirmation in the amount of [Сумма] [Валюта] is coming.'"; // @NStr-1
	НовыйВидОповещений.ТекстСгруппированногоОповещения = "ru = 'Приближается срок оплаты до подтверждения.';
														|en = 'The payment due date before confirmation is coming.'"; // @NStr-1
	
	НовыйВидОповещений = ОповещенияПользователейОСобытиях.ДобавитьОписаниеВидаОповещенийПользователей(ОписаниеВидовОповещений);
	НовыйВидОповещений.ГруппаВидаОповещений = ГруппаВидаОповещенийВзаиморасчеты;
	НовыйВидОповещений.Идентификатор = "6f0797a9-cfc4-4917-b3cc-13849ea928b8";
	НовыйВидОповещений.Наименование = НСтр("ru = 'Просрочена оплата до поступления';
											|en = 'Overdue payment before receipt'", ОбщегоНазначения.КодОсновногоЯзыка());
	НовыйВидОповещений.ТипОповещения = Перечисления.ТипыОповещенийПользователей.Неоперативное;
	НовыйВидОповещений.ИмяШаблонаСКД = Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланОплат.Макеты.Оповещения_ПредоплатаПросрочено.ПолноеИмя();
	НовыйВидОповещений.ШаблонТекстаОповещения = "ru = 'Просрочена оплата до поступления [Сумма] [Валюта].';
												|en = 'The payment before receipt of [Сумма] [Валюта] is overdue.'"; // @NStr-1
	НовыйВидОповещений.ТекстСгруппированногоОповещения = "ru = 'Просрочена оплата до поступления.';
														|en = 'The payment before receipt is overdue.'"; // @NStr-1
	
	НовыйВидОповещений = ОповещенияПользователейОСобытиях.ДобавитьОписаниеВидаОповещенийПользователей(ОписаниеВидовОповещений);
	НовыйВидОповещений.ГруппаВидаОповещений = ГруппаВидаОповещенийВзаиморасчеты;
	НовыйВидОповещений.Идентификатор = "ba505486-f040-4f25-8d59-179876323905";
	НовыйВидОповещений.Наименование = НСтр("ru = 'Приближение срока оплаты до поступления';
											|en = 'Approaching payment due date before receipt'", ОбщегоНазначения.КодОсновногоЯзыка());
	НовыйВидОповещений.ТипОповещения = Перечисления.ТипыОповещенийПользователей.Неоперативное;
	НовыйВидОповещений.ИмяШаблонаСКД = Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланОплат.Макеты.Оповещения_ПредоплатаПриближается.ПолноеИмя();
	НовыйВидОповещений.ШаблонТекстаОповещения = "ru = 'Приближается срок оплаты до поступления на сумму [Сумма] [Валюта].';
												|en = 'The payment due date before receipt in the amount of [Сумма] [Валюта] is coming.'"; // @NStr-1
	НовыйВидОповещений.ТекстСгруппированногоОповещения = "ru = 'Приближается срок оплаты до поступления.';
														|en = 'The payment due date before receipt is coming.'"; // @NStr-1
	НовыйВидОповещений = ОповещенияПользователейОСобытиях.ДобавитьОписаниеВидаОповещенийПользователей(ОписаниеВидовОповещений);
	
	НовыйВидОповещений.Идентификатор = "69c089ef-8853-4fe7-a15c-d30a2b8f2fb7";
	НовыйВидОповещений.ГруппаВидаОповещений = ГруппаВидаОповещенийВзаиморасчеты;
	НовыйВидОповещений.Наименование = НСтр("ru = 'Просрочена оплата поставщику';
											|en = 'Overdue payment to vendor'", ОбщегоНазначения.КодОсновногоЯзыка());
	НовыйВидОповещений.ТипОповещения = Перечисления.ТипыОповещенийПользователей.Неоперативное;
	НовыйВидОповещений.ИмяШаблонаСКД = Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланОплат.Макеты.Оповещения_КредитПросрочено.ПолноеИмя();
	НовыйВидОповещений.ШаблонТекстаОповещения = "ru = 'Просрочена оплата [Сумма] [Валюта].';
												|en = 'The payment of [Сумма] [Валюта] is overdue.'"; // @NStr-1
	НовыйВидОповещений.ТекстСгруппированногоОповещения = "ru = 'Просрочена оплата после поступления.';
														|en = 'The payment after receipt is overdue.'"; // @NStr-1
	
	НовыйВидОповещений = ОповещенияПользователейОСобытиях.ДобавитьОписаниеВидаОповещенийПользователей(ОписаниеВидовОповещений);
	НовыйВидОповещений.ГруппаВидаОповещений = ГруппаВидаОповещенийВзаиморасчеты;
	НовыйВидОповещений.Идентификатор = "0ca6e8bf-6067-450c-b881-d8a21b95e363";
	НовыйВидОповещений.Наименование = НСтр("ru = 'Приближение срока оплаты поставщику';
											|en = 'Approaching due date of payment to vendor'", ОбщегоНазначения.КодОсновногоЯзыка());
	НовыйВидОповещений.ТипОповещения = Перечисления.ТипыОповещенийПользователей.Неоперативное;
	НовыйВидОповещений.ИмяШаблонаСКД = Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланОплат.Макеты.Оповещения_КредитПриближается.ПолноеИмя();
	НовыйВидОповещений.ШаблонТекстаОповещения = "ru = 'Приближается срок оплаты на сумму [Сумма] [Валюта].';
												|en = 'The payment due date in the amount of [Сумма] [Валюта] is coming.'"; // @NStr-1
	НовыйВидОповещений.ТекстСгруппированногоОповещения = "ru = 'Приближается срок оплаты.';
														|en = 'The payment due date is coming.'"; // @NStr-1
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли