
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак использования обновленной архитектуры адресной книги.
//
// Возвращаемое значение:
//	Булево - Истина, если используется обновленная аритектура адресной книги.
//
Функция ИспользоватьОбновленнуюАрхитектуру() Экспорт
	
	Возврат Константы.ПараметрыОбновленияАдреснойКниги.ИспользоватьОбновленнуюАрхитектуруАдреснойКниги();
	
КонецФункции

// Возвращает признак использования отложенного обновления адресной книги.
//
// Возвращаемое значение:
//	Булево - Истина, если используется отложенное обновление адресной книги.
//
Функция ИспользоватьОтложенноеОбновление() Экспорт
	
	Возврат Константы.ПараметрыОбновленияАдреснойКниги.ОтложенноеОбновлениеАдреснойКниги();
	
КонецФункции

// Возвращает список полных имен объектов-источников адресной книги.
//
// Возвращаемое значение:
//	Массив Из Строка.
//
Функция МассивИменОбъектовАдреснойКниги() Экспорт
	
	Возврат Справочники.АдреснаяКнига.МассивИменОбъектовАдреснойКниги();
	
КонецФункции

// Возвращает соответствие полных имен объектов-источников адресной книги их типам.
//
// Возвращаемое значение:
//	Соответствие Из КлючИЗначение:
//		Ключ - Тип.
//		Значение - Строка.
//
Функция ИменаТиповОбъектовАдреснойКниги() Экспорт
	
	Возврат Справочники.АдреснаяКнига.ИменаТиповОбъектовАдреснойКниги();
	
КонецФункции

// Возвращает список типов, которые поддерживают обновление данных адресной книги.
//
// Возвращаемое значение:
//	ОписаниеТипов - Список типов, которые поддерживают обновление адресной книги.
//
Функция ТипыОбъектовПоддерживающихОбновлениеДанныхАдреснойКниги() Экспорт
	
	Возврат Справочники.АдреснаяКнига.ТипыОбъектовПоддерживающихОбновлениеДанныхАдреснойКниги();
	
КонецФункции

#КонецОбласти
