////////////////////////////////////////////////////////////////////////////////
// Мои документы (вызов сервера)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет переданный документ в регистр "Мои документы"  для текущего пользователя.
//
// Параметры:
//   МассивДокументов - Массив из СправочникСсылка.ДокументыПредприятия
//
Процедура ДобавитьВМоиДокументы(Знач МассивДокументов) Экспорт 
	
	Причина = Перечисления.ПричиныДобавленияВМоиДокументы.ДобавленВручную;
	Сотрудник = ПараметрыСеанса.ОсновнойСотрудник;
	ИсточникПричины = Неопределено;
	ОтразитьНемедленно = Истина;
	Для Каждого Документ Из МассивДокументов Цикл 
		Если Не ДелопроизводствоКлиентСервер.ЭтоДокумент(Документ) Тогда 
			Продолжить;
		КонецЕсли;
		МоиДокументы.ДобавитьЗаписьВМоиДокументы(
			Документ,
			Причина,
			Сотрудник,
			ИсточникПричины,
			ОтразитьНемедленно);
	КонецЦикла;
	
КонецПроцедуры

// Удаляет все записи по документам из регистра "Мои документы" для текущего пользователя.
// 
// Параметры:
//  МассивДокументов - Массив из СправочникСсылка.ДокументыПредприятия
// 
Процедура УдалитьИзМоихДокументов(Знач МассивДокументов) Экспорт
	
	СотрудникиПользователя = ПараметрыСеанса.СотрудникиПользователя;
	ОтразитьНемедленно = Истина;
	Для Каждого Документ Из МассивДокументов Цикл 
		МоиДокументы.УдалитьИзМоихДокументов(Документ, СотрудникиПользователя, ОтразитьНемедленно);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти