#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДляПравилЗагрузки") И Параметры.ДляПравилЗагрузки Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Согласующий);
		ДанныеВыбора.Добавить(ОбрабатывающийРезультат);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДляПравилЗагрузки") И Параметры.ДляПравилЗагрузки Тогда
		
		МассивДоступныхЗначений = Новый Массив;
		МассивДоступныхЗначений.Добавить(Согласующий);
		МассивДоступныхЗначений.Добавить(ОбрабатывающийРезультат);
		Параметры.Отбор.Вставить("Ссылка", МассивДоступныхЗначений);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли