#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет наличие записей в регистре сведений "КадроваяИсторияСотрудников" для указанного физического лица.
//
// Параметры:
//   ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - Физическое лицо, для которого необходимо проверить
//     наличие записей.
//
// Возвращаемое значение:
//   Булево - Истина, если записи для указанного физического лица есть, иначе Ложь.
//
Функция ВедетсяКадроваяИстория(ФизическоеЛицо) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КадроваяИсторияСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		|ГДЕ
		|	КадроваяИсторияСотрудников.ФизическоеЛицо = &ФизическоеЛицо");
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли