#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ПараметрПодразделение = Настройки.ПараметрыДанных.Элементы.Найти("Подразделение");
	ПараметрИсполнители = Настройки.ПараметрыДанных.Элементы.Найти("Исполнители");
	ПараметрВидыПриложений = Настройки.ПараметрыДанных.Элементы.Найти("ВидыПриложений");
	ПараметрТолькоМоиСотрудники = Настройки.ПараметрыДанных.Элементы.Найти("ТолькоМоиСотрудники");
	
	Если ПараметрИсполнители.Использование = Ложь
		И ПараметрПодразделение.Использование
		И ЗначениеЗаполнено(ПараметрПодразделение.Значение) Тогда
		
		// Явно указано подразделение - построим отчет по его сотрудникам.
		ТолькоДействующие = Ложь;
		Исполнители = Сотрудники.СотрудникиПодразделения(
			ПараметрПодразделение.Значение,
			ТолькоДействующие);
		
		ПараметрИсполнители.Использование = Истина;
		ПараметрИсполнители.Значение = Новый СписокЗначений;
		ПараметрИсполнители.Значение.ЗагрузитьЗначения(Исполнители);
		
	ИначеЕсли ПараметрТолькоМоиСотрудники.Использование И ПараметрТолькоМоиСотрудники.Значение Тогда
		
		// Только мои сотрудники.
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		ТолькоДействующие = Ложь;
		Исполнители = Сотрудники.СотрудникиПользователя(ТекущийПользователь, ТолькоДействующие);
		
		ПараметрИсполнители.Использование = Истина;
		ПараметрИсполнители.Значение = Новый СписокЗначений;
		ПараметрИсполнители.Значение.ЗагрузитьЗначения(Исполнители);
		
	КонецЕсли;
	
	Если ПараметрВидыПриложений.Использование = Истина Тогда
		
		ВидыПриложений = Новый Массив;
		
		Если ТипЗнч(ПараметрВидыПриложений.Значение) = Тип("СписокЗначений") Тогда
			
			Для Каждого ВидПриложения Из ПараметрВидыПриложений.Значение.ВыгрузитьЗначения() Цикл
				
				ВидыПриложений.Добавить(ВидПриложения);
				
				Если ТипЗнч(ВидПриложения) <> Тип("СправочникСсылка.ВидыДокументов") Тогда
					Продолжить;
				КонецЕсли;
				
				НайденныеВидыДокументов = Справочники.ВидыДокументов.НайтиПоГруппе(ВидПриложения);
				
				Для Каждого НайденныйВидДокументов Из НайденныеВидыДокументов Цикл
					
					ВидыПриложений.Добавить(НайденныйВидДокументов);
					
				КонецЦикла;
				
			КонецЦикла;
			
		Иначе
			
			ВидПриложения = ПараметрВидыПриложений.Значение;
			
			ВидыПриложений.Добавить(ВидПриложения);
			
			Если ТипЗнч(ВидПриложения) = Тип("СправочникСсылка.ВидыДокументов") Тогда
				
				НайденныеВидыДокументов = Справочники.ВидыДокументов.НайтиПоГруппе(ВидПриложения);
				
				Для Каждого НайденныйВидДокументов Из НайденныеВидыДокументов Цикл
					
					ВидыПриложений.Добавить(НайденныйВидДокументов);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПараметрВидыПриложений.Значение = Новый СписокЗначений;
		ПараметрВидыПриложений.Значение.ЗагрузитьЗначения(ВидыПриложений);
		
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ВестиУчетФактическихТрудозатрат") Тогда
		
		СкрытьПоле("ПотериТрудозатрат");
		СкрытьПоле("ОтклонениеТрудозатратАбсолютное");
		СкрытьПоле("ТрудоемкостьОт");
		СкрытьПоле("ТрудоемкостьДо");
		СкрытьПоле("Трудозатраты");
		СкрытьПоле("ОтклонениеТрудозатрат");
		СкрытьПоле("КоличествоБезТрудозатрат");
		СкрытьПоле("Трудоемкость");
		СкрытьПоле("ОшибкаТрудозатрат");
		СкрытьПоле("ТрудозатратыСумма");
		
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(9);
	
	ОбщегоНазначенияДокументооборот.УстановитьЦветаДиаграмм(ДокументРезультат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Скрывает поле в схеме компоновки данных.
// 
// Параметры:
//  ИмяПоля - Строка
//
Процедура СкрытьПоле(ИмяПоля)
	
	НайденноеПоле =
		СхемаКомпоновкиДанных.НаборыДанных.ЗадачиПоИсполнителям.Поля.Найти(ИмяПоля);
	Если НайденноеПоле = Неопределено Тогда
		НайденноеПоле =
			СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти(ИмяПоля);
	КонецЕсли;
	
	Если НайденноеПоле = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденноеПоле.ОграничениеИспользования.Группировка = Истина;
	НайденноеПоле.ОграничениеИспользования.Поле = Истина;
	НайденноеПоле.ОграничениеИспользования.Порядок = Истина;
	НайденноеПоле.ОграничениеИспользования.Условие = Истина;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли