
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.СрокХраненияЗавершенныхЗаданий.Доступность = НаборКонстант.ХранитьЗавершенныеЗадания;
	

КонецПроцедуры

&НаКлиенте
Процедура ХранитьЗавершенныеЗаданияПриИзменении(Элемент)
	
	Элементы.СрокХраненияЗавершенныхЗаданий.Доступность = НаборКонстант.ХранитьЗавершенныеЗадания;
	Если Не НаборКонстант.ХранитьЗавершенныеЗадания Тогда
		НаборКонстант.СрокХраненияЗавершенныхЗаданий = 0;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДиспетчерОбработкиОчередиЗаданийПолныеПрава.СбросНомераПотокаДляЗаданийСБольшимНомером();
	
КонецПроцедуры


