
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Протокол = РегистрыСведений.ПротоколВыполненияЗаданий.ПрочитатьЛог(Объект.Ссылка);
	
	ОписаниеТипа = Перечисления.ТипыЗаданий.ОписаниеТипаЗадания(Объект.Тип);
	ТипОчереди = Перечисления.ТипыЗаданий.СинонимТипаОчереди(ОписаниеТипа.ТипОчереди);
	Сеанс = ОписаниеТипа.Сеанс;
	

КонецПроцедуры

#КонецОбласти
