////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции, вызываемые с клиента, для работы механизма
// выполнения задач по почте
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует уведомление и помещает его в очередь на отправку по задаче.
// Возвращает Истину, если доступно формирование уведомления и уведомление сформировано.
//
// Параметры:
//  ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи
//
// Возвращаемое значение:
//  Булево
//
Функция СформироватьУведомлениеПоЗадаче(Знач ДействиеЗадачи) Экспорт
	
	Возврат ВыполнениеЗадачПоПочтеСервер.СформироватьУведомлениеПоЗадаче(ДействиеЗадачи);
	
КонецФункции

#КонецОбласти