
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = Сотрудники.ОсновнойСотрудникПользователя(
			Пользователи.ТекущийПользователь());
	КонецЕсли;	
	
	Если Параметры.Свойство("РодительскаяТема") Тогда
		Объект.Родитель = Параметры.РодительскаяТема;
	КонецЕсли;	
	
	ЭтоМобильныйКлиент = ПараметрыСеанса.ЭтоМобильныйКлиент;
	Если ЭтоМобильныйКлиент Тогда
		МК_НастроитьЭлементыФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Оповестить("Запись_НоваяТемаЗаметок");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункции_МобильныйКлиент

#Область СлужебныеПроцедурыИФункции_МобильныйКлиент

&НаСервере
Процедура МК_НастроитьЭлементыФормы()

	МК.УстановитьОбщиеСвойстваФормы(ЭтотОбъект);
	
	Элементы.МК.Видимость = Истина;
	МК.ОформитьАкцентнуюКнопку(Элементы.МК_ЗаписатьИЗакрыть);

КонецПроцедуры
	
#КонецОбласти

#КонецОбласти

#КонецОбласти
