#Область ПрограммныйИнтерфейс

// См.ФизическиеЛицаКлиент.ОпределитьПолПоОтчеству
Функция ОпределитьПолПоОтчеству(ОтчествоРаботника) Экспорт
	
	// ++ Локализация
	Если Прав(ОтчествоРаботника, 2) = "ич" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской");
	ИначеЕсли Прав(ОтчествоРаботника, 2) = "на" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский");
	КонецЕсли;
	
	// -- Локализация
	Возврат Неопределено;

КонецФункции // ОпределитьПолПоОтчеству()

#КонецОбласти