////////////////////////////////////////////////////////////////////////////////
// Работа с реестрами (клиент-сервер).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет параметры формы по описанию реестра.
// 
// Параметры:
//  ПараметрыФормы - Структура
//  ОписаниеРеестра - Структура
// 
Процедура ЗаполнитьПараметрыФормы(ПараметрыФормы, ОписаниеРеестра) Экспорт
	
	ПараметрыФормы.Вставить("Заголовок", ОписаниеРеестра.Заголовок);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", ОписаниеРеестра.КлючНазначенияИспользования);
	ПараметрыФормы.Вставить("НавигационнаяСсылка", ПолучитьНавигационнуюСсылку(ОписаниеРеестра.Реестр));
	
	Если ОписаниеРеестра.ДанныеРеестра = ПредопределенноеЗначение("Перечисление.ДанныеРеестров.ДокументыПредприятия") Тогда
		
		ДоступныеВидыДокументов = Новый СписокЗначений;
		ДоступныеВидыДокументов.ЗагрузитьЗначения(ОписаниеРеестра.ВидыЭлементовРеестра);
		ПараметрыФормы.Вставить("ДоступныеВидыДокументов", ДоступныеВидыДокументов);
		ПараметрыФормы.Вставить("Реестр", ОписаниеРеестра.Реестр);
		
	ИначеЕсли ОписаниеРеестра.ДанныеРеестра = ПредопределенноеЗначение("Перечисление.ДанныеРеестров.Мероприятия") Тогда
		
		ДоступныеВидыМероприятий = Новый СписокЗначений;
		ДоступныеВидыМероприятий.ЗагрузитьЗначения(ОписаниеРеестра.ВидыЭлементовРеестра);
		ПараметрыФормы.Вставить("ДоступныеВидыМероприятий", ДоступныеВидыМероприятий);
		
	Иначе
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестные данные реестра %1'"), ОписаниеРеестра.ДанныеРеестра);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
