//12.09.23 конф 2.5.11.56 близкие изменения внесены в конфигурацию
//&ИзменениеИКонтроль("ЗаполнитьСтоимостьТрудозатрат")
//Процедура Расш1_ЗаполнитьСтоимостьТрудозатрат(Калькуляция, МенеджерВТ)

//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ПлановыеТрудозатраты.ВидРабот КАК ВидРабот,
//		|	ПлановыеТрудозатраты.Период КАК Период
//		|ПОМЕСТИТЬ ВидыРабот
//		|ИЗ
//		|	РегистрНакопления.ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
//		|ГДЕ
//		|	ПлановыеТрудозатраты.Калькуляция = &Калькуляция
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ПлановыеТрудозатраты.Период,
//		|	ПлановыеТрудозатраты.ВидРабот
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВидыРабот.ВидРабот КАК ВидРабот,
//		|	ВидыРабот.Период КАК Период,
//		|	МАКСИМУМ(РасценкиРаботСотрудников.Период) КАК ПериодРасценки
//		|ПОМЕСТИТЬ ДатыРасценок
//		|ИЗ
//		|	ВидыРабот КАК ВидыРабот
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиРаботСотрудников КАК РасценкиРаботСотрудников
//		|		ПО (РасценкиРаботСотрудников.ВидРабот = ВидыРабот.ВидРабот)
//		|			И (РасценкиРаботСотрудников.Период <= ВидыРабот.Период)
//		#Вставка
//		|           И (РасценкиРаботСотрудников.КвалификационныйРазряд = ВидыРабот.ВидРабот.КвалификационныйРазряд)
//		#КонецВставки
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ВидыРабот.ВидРабот,
//		|	ВидыРабот.Период
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДатыРасценок.ВидРабот КАК ВидРабот,
//		|	ДатыРасценок.Период КАК Период,
//		|	ЕСТЬNULL(РасценкиРаботСотрудников.Расценка, 0) КАК Расценка
//		|ПОМЕСТИТЬ Расценки
//		|ИЗ
//		|	ДатыРасценок КАК ДатыРасценок
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиРаботСотрудников КАК РасценкиРаботСотрудников
//		|		ПО ДатыРасценок.ВидРабот = РасценкиРаботСотрудников.ВидРабот
//		|			И ДатыРасценок.ПериодРасценки = РасценкиРаботСотрудников.Период 
//		#Вставка
//		|			И ДатыРасценок.ВидРабот.КвалификационныйРазряд = РасценкиРаботСотрудников.КвалификационныйРазряд
//		#КонецВставки
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	ВидРабот,
//		|	Период
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ПлановыеТрудозатраты.Калькуляция КАК Калькуляция,
//		|	ПлановыеТрудозатраты.ПартияСпецификация КАК ПартияСпецификация,
//		|	ПлановыеТрудозатраты.Подразделение КАК Подразделение,
//		|	ПлановыеТрудозатраты.СтатьяКалькуляции КАК СтатьяКалькуляции,
//		|	ПлановыеТрудозатраты.ВидРабот КАК ВидРабот,
//		|	ПлановыеТрудозатраты.Период КАК Период,
//		|	ПлановыеТрудозатраты.Количество КАК Количество,
//		|	ПлановыеТрудозатраты.Количество * Расценки.Расценка * ВЫБОР
//		|		КОГДА КурсыВалютРасценок.Валюта = КурсыВалютУУ.Валюта
//		|			ТОГДА 1
//		|		ИНАЧЕ ВЫБОР
//		|				КОГДА КурсыВалютРасценок.КурсЗнаменатель * КурсыВалютУУ.КурсЧислитель = 0
//		|					ТОГДА 1
//		|				ИНАЧЕ КурсыВалютРасценок.КурсЧислитель * КурсыВалютУУ.КурсЗнаменатель / (КурсыВалютРасценок.КурсЗнаменатель * КурсыВалютУУ.КурсЧислитель)
//		|			КОНЕЦ
//		|	КОНЕЦ КАК Стоимость,
//		|	ПлановыеТрудозатраты.ПериодЗатрат КАК ПериодЗатрат,
//		|	ПлановыеТрудозатраты.Количество * Расценки.Расценка * ВЫБОР
//		|		КОГДА КурсыВалютРасценок.Валюта = КурсыВалютБУ.Валюта
//		|			ТОГДА 1
//		|		ИНАЧЕ ВЫБОР
//		|				КОГДА КурсыВалютРасценок.КурсЗнаменатель * КурсыВалютБУ.КурсЧислитель = 0
//		|					ТОГДА 1
//		|				ИНАЧЕ КурсыВалютРасценок.КурсЧислитель * КурсыВалютБУ.КурсЗнаменатель / (КурсыВалютРасценок.КурсЗнаменатель * КурсыВалютБУ.КурсЧислитель)
//		|			КОНЕЦ
//		|	КОНЕЦ КАК СтоимостьРегл
//		|ПОМЕСТИТЬ ПлановыеТрудозатратыБезСтраховыхВзносов
//		|ИЗ
//		|	РегистрНакопления.ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Расценки КАК Расценки
//		|		ПО (Расценки.ВидРабот = ПлановыеТрудозатраты.ВидРабот)
//		|			И (Расценки.Период = ПлановыеТрудозатраты.Период)
//		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалютРасценок
//		|		ПО (КурсыВалютРасценок.ВидВалюты = ""ВалютаРасценокВидовРабот"")
//		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалютУУ
//		|		ПО (КурсыВалютУУ.ВидВалюты = ""ВалютаУпрУчета"")
//		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалютБУ
//		|		ПО (КурсыВалютБУ.ВидВалюты = ""ВалютаРеглУчета"")
//		|ГДЕ
//		|	ПлановыеТрудозатраты.Калькуляция = &Калькуляция
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВложенныйЗапрос.ГодЗатрат КАК ГодЗатрат,
//		|	ВложенныйЗапрос.Организация КАК Организация
//		|ПОМЕСТИТЬ ПериодыЗатратПоОрганизации
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		НАЧАЛОПЕРИОДА(ПлановыеТрудозатраты.ПериодЗатрат, ГОД) КАК ГодЗатрат,
//		|		ПлановыеТрудозатраты.Калькуляция.Организация КАК Организация
//		|	ИЗ
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов КАК ПлановыеТрудозатраты
//		|	
//		|	СГРУППИРОВАТЬ ПО
//		|		НАЧАЛОПЕРИОДА(ПлановыеТрудозатраты.ПериодЗатрат, ГОД),
//		|		ПлановыеТрудозатраты.Калькуляция.Организация) КАК ВложенныйЗапрос
//		|;
//		|
//		//++ Локализация
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВложенныйЗапрос.ГодЗатрат КАК ГодЗатрат,
//		|	ВложенныйЗапрос.Организация КАК Организация,
//		|	ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа КАК ВидТарифа
//		|ПОМЕСТИТЬ ПрименяемыеТарифыПоПериодам
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ПериодыЗатратПоОрганизации.ГодЗатрат КАК ГодЗатрат,
//		|		ПериодыЗатратПоОрганизации.Организация КАК Организация,
//		|		МАКСИМУМ(ПрименяемыеТарифыСтраховыхВзносов.Период) КАК Период,
//		|		ПрименяемыеТарифыСтраховыхВзносов.ГоловнаяОрганизация КАК ГоловнаяОрганизация
//		|	ИЗ
//		|		РегистрСведений.ПрименяемыеТарифыСтраховыхВзносов КАК ПрименяемыеТарифыСтраховыхВзносов
//		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыЗатратПоОрганизации КАК ПериодыЗатратПоОрганизации
//		|			ПО (ПрименяемыеТарифыСтраховыхВзносов.ГоловнаяОрганизация = ПериодыЗатратПоОрганизации.Организация
//		|					ИЛИ ПрименяемыеТарифыСтраховыхВзносов.ГоловнаяОрганизация = ПериодыЗатратПоОрганизации.Организация.ГоловнаяОрганизация)
//		|				И ПрименяемыеТарифыСтраховыхВзносов.Период <= ПериодыЗатратПоОрганизации.ГодЗатрат
//		|	
//		|	СГРУППИРОВАТЬ ПО
//		|		ПериодыЗатратПоОрганизации.Организация,
//		|		ПериодыЗатратПоОрганизации.ГодЗатрат,
//		|		ПрименяемыеТарифыСтраховыхВзносов.ГоловнаяОрганизация) КАК ВложенныйЗапрос
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрименяемыеТарифыСтраховыхВзносов КАК ПрименяемыеТарифыСтраховыхВзносов
//		|		ПО ВложенныйЗапрос.Период = ПрименяемыеТарифыСтраховыхВзносов.Период
//		|			И ВложенныйЗапрос.ГоловнаяОрганизация = ПрименяемыеТарифыСтраховыхВзносов.ГоловнаяОрганизация
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВложенныйЗапрос.ГодЗатрат КАК ГодЗатрат,
//		|	ВложенныйЗапрос.Организация КАК Организация,
//		|	ТарифыСтраховыхВзносов.ПФР КАК ПФР,
//		|	ТарифыСтраховыхВзносов.ФСС КАК ФСС,
//		|	ТарифыСтраховыхВзносов.ФФОМС + ТарифыСтраховыхВзносов.ТФОМС КАК ФОМС
//		|ПОМЕСТИТЬ ПрименяемыеТарифыСтраховыхВзносов
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ПрименяемыеТарифыПоПериодам.ГодЗатрат КАК ГодЗатрат,
//		|		ПрименяемыеТарифыПоПериодам.ВидТарифа КАК ВидТарифа,
//		|		МАКСИМУМ(ТарифыСтраховыхВзносов.Период) КАК Период,
//		|		ПрименяемыеТарифыПоПериодам.Организация КАК Организация
//		|	ИЗ
//		|		ПрименяемыеТарифыПоПериодам КАК ПрименяемыеТарифыПоПериодам
//		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыСтраховыхВзносов КАК ТарифыСтраховыхВзносов
//		|			ПО ПрименяемыеТарифыПоПериодам.ГодЗатрат >= ТарифыСтраховыхВзносов.Период
//		|				И ПрименяемыеТарифыПоПериодам.ВидТарифа = ТарифыСтраховыхВзносов.ВидТарифа
//		|	
//		|	СГРУППИРОВАТЬ ПО
//		|		ПрименяемыеТарифыПоПериодам.ГодЗатрат,
//		|		ПрименяемыеТарифыПоПериодам.ВидТарифа,
//		|		ПрименяемыеТарифыПоПериодам.Организация) КАК ВложенныйЗапрос
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыСтраховыхВзносов КАК ТарифыСтраховыхВзносов
//		|		ПО ВложенныйЗапрос.ВидТарифа = ТарифыСтраховыхВзносов.ВидТарифа
//		|			И ВложенныйЗапрос.Период = ТарифыСтраховыхВзносов.Период
//		|;
//		|
//		//-- Локализация
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	РасчетСтраховыхВзносов.Калькуляция КАК Калькуляция,
//		|	РасчетСтраховыхВзносов.ПартияСпецификация КАК ПартияСпецификация,
//		|	РасчетСтраховыхВзносов.Подразделение КАК Подразделение,
//		|	РасчетСтраховыхВзносов.СтатьяКалькуляции КАК СтатьяКалькуляции,
//		|	РасчетСтраховыхВзносов.ВидРабот КАК ВидРабот,
//		|	РасчетСтраховыхВзносов.Период КАК Период,
//		|	СУММА(РасчетСтраховыхВзносов.Стоимость) КАК Стоимость,
//		|	РасчетСтраховыхВзносов.ПериодЗатрат КАК ПериодЗатрат,
//		|	СУММА(РасчетСтраховыхВзносов.Количество) КАК Количество,
//		|	СУММА(РасчетСтраховыхВзносов.СтоимостьРегл) КАК СтоимостьРегл
//		|ПОМЕСТИТЬ ПлановыеТрудозатраты
//		|ИЗ (
//		//++ Локализация
//		|	ВЫБРАТЬ
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.Калькуляция КАК Калькуляция,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.ПартияСпецификация КАК ПартияСпецификация,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.Подразделение КАК Подразделение,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.СтатьяКалькуляции КАК СтатьяКалькуляции,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.ВидРабот КАК ВидРабот,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.Период КАК Период,
//		|		ВЫРАЗИТЬ((ПлановыеТрудозатратыБезСтраховыхВзносов.Стоимость * ЕСТЬNULL(ПрименяемыеТарифыСтраховыхВзносов.ФОМС, 0)
//		|					+ ПлановыеТрудозатратыБезСтраховыхВзносов.Стоимость * ЕСТЬNULL(ПрименяемыеТарифыСтраховыхВзносов.ПФР, 0)
//		|					+ ПлановыеТрудозатратыБезСтраховыхВзносов.Стоимость * ЕСТЬNULL(ПрименяемыеТарифыСтраховыхВзносов.ФСС, 0))/ 100 КАК ЧИСЛО(31,2)) КАК Стоимость,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.ПериодЗатрат КАК ПериодЗатрат,
//		|		0 КАК Количество,
//		|		ВЫРАЗИТЬ((ПлановыеТрудозатратыБезСтраховыхВзносов.СтоимостьРегл * ЕСТЬNULL(ПрименяемыеТарифыСтраховыхВзносов.ФОМС, 0)
//		|					+ ПлановыеТрудозатратыБезСтраховыхВзносов.СтоимостьРегл * ЕСТЬNULL(ПрименяемыеТарифыСтраховыхВзносов.ПФР, 0)
//		|					+ ПлановыеТрудозатратыБезСтраховыхВзносов.СтоимостьРегл * ЕСТЬNULL(ПрименяемыеТарифыСтраховыхВзносов.ФСС, 0))/ 100 КАК ЧИСЛО(31,2)) КАК СтоимостьРегл
//		|	ИЗ
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов КАК ПлановыеТрудозатратыБезСтраховыхВзносов
//		|			ЛЕВОЕ СОЕДИНЕНИЕ ПрименяемыеТарифыСтраховыхВзносов КАК ПрименяемыеТарифыСтраховыхВзносов
//		|			ПО (НАЧАЛОПЕРИОДА(ПлановыеТрудозатратыБезСтраховыхВзносов.ПериодЗатрат, ГОД) = ПрименяемыеТарифыСтраховыхВзносов.ГодЗатрат)
//		|				И ПлановыеТрудозатратыБезСтраховыхВзносов.Калькуляция.Организация = ПрименяемыеТарифыСтраховыхВзносов.Организация
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		//-- Локализация
//		|	
//		|	ВЫБРАТЬ
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.Калькуляция,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.ПартияСпецификация,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.Подразделение,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.СтатьяКалькуляции,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.ВидРабот,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.Период,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.Стоимость,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.ПериодЗатрат,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.Количество,
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов.СтоимостьРегл
//		|	ИЗ
//		|		ПлановыеТрудозатратыБезСтраховыхВзносов КАК ПлановыеТрудозатратыБезСтраховыхВзносов) КАК РасчетСтраховыхВзносов
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	РасчетСтраховыхВзносов.Период,
//		|	РасчетСтраховыхВзносов.Подразделение,
//		|	РасчетСтраховыхВзносов.Калькуляция,
//		|	РасчетСтраховыхВзносов.ВидРабот,
//		|	РасчетСтраховыхВзносов.СтатьяКалькуляции,
//		|	РасчетСтраховыхВзносов.ПериодЗатрат,
//		|	РасчетСтраховыхВзносов.ПартияСпецификация
//		|
//		|ИМЕЮЩИЕ
//		|	СУММА(РасчетСтраховыхВзносов.Количество) > 0
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Калькуляция,
//		|	ПартияСпецификация
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|УНИЧТОЖИТЬ ВидыРабот
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|УНИЧТОЖИТЬ ДатыРасценок
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|УНИЧТОЖИТЬ Расценки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|УНИЧТОЖИТЬ ПлановыеТрудозатратыБезСтраховыхВзносов
//		|;
//		//++ Локализация
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|УНИЧТОЖИТЬ ПрименяемыеТарифыПоПериодам
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|УНИЧТОЖИТЬ ПрименяемыеТарифыСтраховыхВзносов
//		|;
//		//-- Локализация
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|УНИЧТОЖИТЬ ПериодыЗатратПоОрганизации";

//	Запрос.УстановитьПараметр("Калькуляция", Калькуляция);

//	УстановитьПривилегированныйРежим(Истина);
//	Запрос.Выполнить();
//	УстановитьПривилегированныйРежим(Ложь);

//КонецПроцедуры
