////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры и функции для работы механизма выполнения задач по почте
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует уведомление о назначении задачи. При формировании уведомления происходит проверка
// возможности отправить уведомление исполнителю задачи уведомление. Если данная возможность
// существует, то пользователю выводится соответствующий текст о состоянии. Иначе ничего
// не выводится.
//
// Параметры:
//  - ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи
//
Процедура СформироватьУведомлениеДляИсполненияЗадачиПоПочте(ДействиеЗадачи) Экспорт
	
	Если ВыполнениеЗадачПоПочтеВызовСервера.СформироватьУведомлениеПоЗадаче(ДействиеЗадачи) Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Направлена по почте'"),
			ПолучитьНавигационнуюСсылку(ДействиеЗадачи),
			Строка(ДействиеЗадачи),
			БиблиотекаКартинок.ДиалогИнформация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти