#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область НастройкиОтчетаПоУмолчанию

// Выполняет заполнение категорий и разделов в зависимости от варианта отчета
// Параметры:
//	КлючВариантаОтчета - Строка - Строковое название варианта отчета:
//	СписокКатегорий - СписокЗначений Из СправочникСсылка.КатегорииОтчетов - в список добавляются необходимые категории
//	СписокРазделов - СписокЗначений Из перечислениеСсылка.РазделыОтчетов - в список добавляются необходимые категории
Процедура ЗаполнитьСписокКатегорийИРазделовОтчета(КлючВариантаОтчета, СписокКатегорий, СписокРазделов) Экспорт
		
	СписокРазделов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
			Метаданные.Подсистемы.ДокументыИФайлы));
	СписокРазделов.Добавить(Перечисления.РазделыОтчетов.КонтрагентыСписок);
	СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоКонтрагентам);
	
КонецПроцедуры

#КонецОбласти // НастройкиОтчетаПоУмолчанию

#КонецОбласти // ДляВызоваИзДругихПодсистем

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли
