
Процедура Расш_ЗаполнитьПоЗаказуКлиента( ЗаказКлиента )
	
	НаименованиеГрузоотправителя = ЗаказКлиента.Грузоотправитель.Наименование;
	Если СтрНайти(НаименованиеГрузоотправителя, "ЭТП-ТРЕЙДИНГ") <> 0
	Тогда
		//ЗАОПОЭТП = Справочники.Организации.НайтиПоРеквизиту("ИНН", "5506052891");
		БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.НайтиПоНаименованию("ЭТП-ТРЕЙДИНГ (основной)",,, );
	КонецЕсли;
	РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
	Комментарий = "# " + НаименованиеГрузоотправителя + ", счет " + ЗаказКлиента.БанковскийСчетГрузоотправителя;
	
КонецПроцедуры

//не работает!
&После("ОбработкаЗаполнения")
Процедура Расш1_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента")
	Тогда
	
		НаименованиеГрузоотправителя = ДанныеЗаполнения.Грузоотправитель.Наименование;
		Если СтрНайти(НаименованиеГрузоотправителя, "ЭТП-ТРЕЙДИНГ") <> 0
	        Тогда
			ЗАОПОЭТП = Справочники.Организации.НайтиПоРеквизиту("ИНН", "5506052891");
			БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаОрганизаций.НайтиПоНаименованию("ЭТП-ТРЕЙДИНГ",,,ЗАОПОЭТП );
		КонецЕсли;
		РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
		Комментарий = "# " + НаименованиеГрузоотправителя + ", счет " + ДанныеЗаполнения.БанковскийСчетГрузоотправителя;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И
			ДанныеЗаполнения.Свойство("Основание")
	Тогда
	
		Если ТипЗнч( ДанныеЗаполнения.Основание ) = Тип("Массив")
	        Тогда
		
			ЗаказКлиента = ДанныеЗаполнения.Основание[0].ЗаказКлиента;
			Расш_ЗаполнитьПоЗаказуКлиента( ЗаказКлиента );
			
		КонецЕсли;
		
	ИначеЕсли РасшифровкаПлатежа.Количество() > 0
	Тогда
	
		ЗаказКлиента = РасшифровкаПлатежа[0].ОбъектРасчетов;
//		ЗаказКлиента = РасшифровкаПлатежа[0].ОснованиеПлатежа;
		Если ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента")
		Тогда
			Расш_ЗаполнитьПоЗаказуКлиента( ЗаказКлиента );
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
