//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает общий текст запроса который используется
//  в отчетах: ПлановаяСебестоимостьПродукции, СравнениеПлановыхКалькуляций
//  и в печатной форме документа ПлановаяКалькуляция2_2 - ПФ_MXL_ПлановаяКалькуляция.
// Параметры:
//  ФормироватьВТРассчитанноеКоличество - Булево - От переданного значения зависит будет ли формироваться,
//  в данном тексте запроса, ВТ - РассчитанноеКоличество.
//  Например в отчете ПлановаяСебестоимостьПродукции данная ВТ формируется другим запросом.
//
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапроса_ДанныеПлановыхКалькуляций(ФормироватьВТРассчитанноеКоличество) Экспорт
	
	ТекстыЗапросов = Новый Массив();
	Если ФормироватьВТРассчитанноеКоличество Тогда
		ТекстЗапроса = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДД.Калькуляция КАК Калькуляция,
			|	ДД.Продукция КАК Продукция,
			|	ДД.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
			|	ДД.Назначение КАК Назначение,
			|	СУММА(ДД.КоличествоПолуфабриката) КАК ВсегоКоличество
			|ПОМЕСТИТЬ РассчитанноеКоличество
			|ИЗ
			|	РегистрСведений.МножителиПартийИПолуфабрикатов КАК ДД
			|ГДЕ
			|	ДД.Калькуляция В (&ПлановыеКалькуляции)
			|	И ДД.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	ДД.Калькуляция,
			|	ДД.Продукция,
			|	ДД.ХарактеристикаПродукции,
			|	ДД.Назначение
			|";
		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КалькуляцияПродукцииОбъектыКалькуляции.Объект КАК ОбъектКалькуляции,
	|	РассчитанноеКоличество.Продукция КАК Продукция,
	|	РассчитанноеКоличество.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	РассчитанноеКоличество.Назначение КАК Назначение,
	|	РассчитанноеКоличество.Калькуляция КАК Калькуляция,
	|	КалькуляцияПродукцииОбъектыКалькуляции.Количество / РассчитанноеКоличество.ВсегоКоличество КАК ДоляСтоимости
	|ПОМЕСТИТЬ ДолиСтоимостиОтРассчитанногоКоличества
	|ИЗ
	|	РассчитанноеКоличество КАК РассчитанноеКоличество
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановаяКалькуляция2_2.ОбъектыКалькуляции КАК КалькуляцияПродукцииОбъектыКалькуляции
	|		ПО РассчитанноеКоличество.Калькуляция = КалькуляцияПродукцииОбъектыКалькуляции.Ссылка
	|			И РассчитанноеКоличество.Продукция = КалькуляцияПродукцииОбъектыКалькуляции.Номенклатура
	|			И РассчитанноеКоличество.ХарактеристикаПродукции = КалькуляцияПродукцииОбъектыКалькуляции.Характеристика
	|			И РассчитанноеКоличество.Назначение = КалькуляцияПродукцииОбъектыКалькуляции.Назначение
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановаяКалькуляция2_2 КАК КалькуляцияПродукции
	|		ПО РассчитанноеКоличество.Калькуляция = КалькуляцияПродукции.Ссылка
	|ГДЕ
	|	КалькуляцияПродукции.ОбъектКалькуляции = ЗНАЧЕНИЕ(Перечисление.ОбъектыКалькуляции.РесурснаяСпецификация)
	|{ГДЕ
	|	КалькуляцияПродукцииОбъектыКалькуляции.Объект КАК ОбъектКалькуляции}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КалькуляцияПродукцииОбъектыКалькуляции.Объект,
	|	РассчитанноеКоличество.Продукция,
	|	РассчитанноеКоличество.ХарактеристикаПродукции,
	|	РассчитанноеКоличество.Назначение,
	|	РассчитанноеКоличество.Калькуляция,
	|
	|	КалькуляцияПродукцииОбъектыКалькуляции.Количество / РассчитанноеКоличество.ВсегоКоличество
	|ИЗ
	|	РассчитанноеКоличество КАК РассчитанноеКоличество
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановаяКалькуляция2_2.ОбъектыКалькуляции КАК КалькуляцияПродукцииОбъектыКалькуляции
	|		ПО РассчитанноеКоличество.Калькуляция = КалькуляцияПродукцииОбъектыКалькуляции.Ссылка
	|			И РассчитанноеКоличество.Продукция = КалькуляцияПродукцииОбъектыКалькуляции.Номенклатура
	|			И РассчитанноеКоличество.ХарактеристикаПродукции = КалькуляцияПродукцииОбъектыКалькуляции.Характеристика
	|			И РассчитанноеКоличество.Назначение = КалькуляцияПродукцииОбъектыКалькуляции.Назначение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановаяКалькуляция2_2 КАК КалькуляцияПродукции
	|		ПО РассчитанноеКоличество.Калькуляция = КалькуляцияПродукции.Ссылка
	|ГДЕ
	|	НЕ КалькуляцияПродукции.ОбъектКалькуляции = ЗНАЧЕНИЕ(Перечисление.ОбъектыКалькуляции.РесурснаяСпецификация)
	|{ГДЕ
	|	КалькуляцияПродукцииОбъектыКалькуляции.Объект КАК ОбъектКалькуляции}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДолиСтоимости.ОбъектКалькуляции КАК ОбъектКалькуляции,
	|	МножителиПартийИПолуфабрикатов.Калькуляция КАК Калькуляция,
	|	МножителиПартийИПолуфабрикатов.Продукция КАК Продукция,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
	|	МножителиПартийИПолуфабрикатов.Полуфабрикат КАК Полуфабрикат,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.КлючПартия КАК КлючПартия,
	|	МножителиПартийИПолуфабрикатов.Знаменатель КАК Знаменатель,
	|	МножителиПартийИПолуфабрикатов.ПартияВыпущена КАК ПартияВыпущена,
	|	МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК ЭтоПродукция,
	|	МножителиПартийИПолуфабрикатов.Назначение КАК Назначение,
	|	СУММА(МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката * ДолиСтоимости.ДоляСтоимости) КАК КоличествоПолуфабриката,
	|	СУММА(МножителиПартийИПолуфабрикатов.Числитель * ДолиСтоимости.ДоляСтоимости) КАК Числитель,
	|	СУММА(ДолиСтоимости.ДоляСтоимости) КАК ДоляСтоимости,
	|	МИНИМУМ(МножителиПартийИПолуфабрикатов.Порядок) КАК Порядок
	|ПОМЕСТИТЬ ОбщиеМножители
	|ИЗ
	|	ДолиСтоимостиОтРассчитанногоКоличества КАК ДолиСтоимости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
	|		ПО (МножителиПартийИПолуфабрикатов.Калькуляция = ДолиСтоимости.Калькуляция)
	|			И (МножителиПартийИПолуфабрикатов.Продукция = ДолиСтоимости.Продукция)
	|			И (МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции = ДолиСтоимости.ХарактеристикаПродукции)
	|			И (МножителиПартийИПолуфабрикатов.Назначение = ДолиСтоимости.Назначение)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолиСтоимости.ОбъектКалькуляции,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции,
	|	МножителиПартийИПолуфабрикатов.Продукция,
	|	МножителиПартийИПолуфабрикатов.Калькуляция,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.Полуфабрикат,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.ПартияВыпущена,
	|	МножителиПартийИПолуфабрикатов.Знаменатель,
	|	МножителиПартийИПолуфабрикатов.Назначение,
	|	МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	МножителиПартийИПолуфабрикатов.КлючПартия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбщиеМножители.ОбъектКалькуляции КАК ОбъектКалькуляции,
	|	ОбщиеМножители.Калькуляция КАК Калькуляция,
	|	ОбщиеМножители.Продукция КАК Продукция,
	|	ОбщиеМножители.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	ОбщиеМножители.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
	|	ОбщиеМножители.Полуфабрикат КАК Полуфабрикат,
	|	ОбщиеМножители.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
	|	ОбщиеМножители.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
	|	ОбщиеМножители.КлючПартия КАК КлючПартия,
	|	Себестоимость.Количество КАК КоличествоПолуфабриката,
	|	ОбщиеМножители.Числитель КАК Числитель,
	|	ОбщиеМножители.Знаменатель КАК Знаменатель,
	|	ОбщиеМножители.ПартияВыпущена КАК ПартияВыпущена,
	|	ОбщиеМножители.ЭтоПродукция КАК ЭтоПродукция,
	|	ОбщиеМножители.Назначение КАК Назначение,
	|	ОбщиеМножители.ДоляСтоимости КАК ДоляСтоимости,
	|	Себестоимость.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ОбщиеМножители.Порядок КАК Порядок
	|ПОМЕСТИТЬ ОбщиеМножителиСАналитикойПартии
	|ИЗ
	|	ОбщиеМножители КАК ОбщиеМножители
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитики
	|		ПО (Аналитики.Номенклатура = ОбщиеМножители.Продукция)
	|			И (Аналитики.Характеристика = ОбщиеМножители.ХарактеристикаПродукции)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|		ПО (Себестоимость.АналитикаУчетаНоменклатуры = Аналитики.Ссылка)
	|			И (Себестоимость.Партия = ОбщиеМножители.ПартияСпецификацияПродукции)
	|			И (Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|			И (Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции))
	|			И (Себестоимость.Количество > 0)
	|			И (Себестоимость.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка))
	|ГДЕ
	|	ОбщиеМножители.ПартияВыпущена
	|	И ОбщиеМножители.ЭтоПродукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Множители.ЭтоПродукция КАК ЭтоПродукция,
	|	Множители.ОбъектКалькуляции КАК ОбъектКалькуляции,
	|	Множители.Калькуляция КАК Калькуляция,
	|	Множители.Продукция КАК Продукция,
	|	Множители.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	Множители.КоличествоПолуфабриката КАК КоличествоПолуфабриката,
	|	ПлановыеМатериальныеЗатраты.Подразделение КАК Подразделение,
	|	ПлановыеМатериальныеЗатраты.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ПлановыеМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	ПлановыеМатериальныеЗатраты.Характеристика КАК Характеристика,
	|	СУММА(ПлановыеМатериальныеЗатраты.Количество / Множители.Знаменатель * Множители.Числитель) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|				ТОГДА ПлановыеМатериальныеЗатраты.Стоимость
	|			КОГДА &ДанныеПоСебестоимости = 2
	|				ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьБезНДС
	|			ИНАЧЕ ПлановыеМатериальныеЗатраты.СтоимостьРегл
	|		КОНЕЦ / Множители.Знаменатель * Множители.Числитель) КАК Стоимость,
	|	ВЫБОР
	|		КОГДА ПлановыеМатериальныеЗатраты.Количество < 0
	|			ТОГДА ""ВозвратныеОтходы""
	|		ИНАЧЕ ""Материальные""
	|	КОНЕЦ КАК ТипЗатрат,
	|	Множители.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
	|	ПлановыеМатериальныеЗатраты.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
	|	Множители.Продукция КАК Полуфабрикат,
	|	Множители.ХарактеристикаПродукции КАК ХарактеристикаПолуфабриката,
	|	Множители.Назначение КАК Назначение,
	|	Множители.Порядок КАК Порядок,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ ПлановыеМатериальныеЗатраты.СтоимостьЗабалансовая
	|	КОНЕЦ / Множители.Знаменатель * Множители.Числитель КАК Забалансовая,
	|	Множители.КлючПартия КАК КлючПартия
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	ОбщиеМножители КАК Множители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеМатериальныеЗатраты КАК ПлановыеМатериальныеЗатраты
	|		ПО (Множители.Калькуляция = ПлановыеМатериальныеЗатраты.Калькуляция)
	|			И (Множители.ПартияСпецификацияПродукции = ПлановыеМатериальныеЗатраты.ПартияСпецификация)
	|			И (Множители.КлючПартия = ПлановыеМатериальныеЗатраты.КлючПартия)
	|ГДЕ
	|	НЕ Множители.ПартияВыпущена
	|	И Множители.ЭтоПродукция
	|
	|СГРУППИРОВАТЬ ПО
	|	Множители.ЭтоПродукция,
	|	Множители.ОбъектКалькуляции,
	|	ПлановыеМатериальныеЗатраты.Номенклатура,
	|	Множители.Продукция,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.Калькуляция,
	|	ПлановыеМатериальныеЗатраты.Характеристика,
	|	ПлановыеМатериальныеЗатраты.СтатьяКалькуляции,
	|	ПлановыеМатериальныеЗатраты.Подразделение,
	|	ВЫБОР
	|		КОГДА ПлановыеМатериальныеЗатраты.Количество < 0
	|			ТОГДА ""ВозвратныеОтходы""
	|		ИНАЧЕ ""Материальные""
	|	КОНЕЦ,
	|	Множители.ПартияСпецификацияПродукции,
	|	Множители.КоличествоПолуфабриката,
	|	ПлановыеМатериальныеЗатраты.ЭтоПолуфабрикат,
	|	Множители.Назначение,
	|	Множители.Порядок,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ ПлановыеМатериальныеЗатраты.СтоимостьЗабалансовая
	|	КОНЕЦ / Множители.Знаменатель * Множители.Числитель,
	|	Множители.КлючПартия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Множители.ЭтоПродукция,
	|	Множители.ОбъектКалькуляции,
	|	Множители.Калькуляция,
	|	Множители.Продукция,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.КоличествоПолуфабриката,
	|	ПлановыеТрудозатраты.Подразделение,
	|	ПлановыеТрудозатраты.СтатьяКалькуляции,
	|	ПлановыеТрудозатраты.ВидРабот,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	СУММА(ПлановыеТрудозатраты.Количество / Множители.Знаменатель * Множители.Числитель),
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|					ИЛИ &ДанныеПоСебестоимости = 2
	|				ТОГДА ПлановыеТрудозатраты.Стоимость
	|			ИНАЧЕ ПлановыеТрудозатраты.СтоимостьРегл
	|		КОНЕЦ / Множители.Знаменатель * Множители.Числитель),
	|	""Трудозатраты"",
	|	Множители.ПартияСпецификацияПродукции,
	|	ЛОЖЬ,
	|	Множители.Продукция,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.Назначение,
	|	Множители.Порядок,
	|	0,
	|	Множители.КлючПартия
	|ИЗ
	|	ОбщиеМножители КАК Множители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
	|		ПО Множители.Калькуляция = ПлановыеТрудозатраты.Калькуляция
	|			И Множители.ПартияСпецификацияПродукции = ПлановыеТрудозатраты.ПартияСпецификация
	|			И Множители.КлючПартия = ПлановыеТрудозатраты.КлючПартия
	|ГДЕ
	|	НЕ Множители.ПартияВыпущена
	|	И Множители.ЭтоПродукция
	|
	|СГРУППИРОВАТЬ ПО
	|	Множители.ЭтоПродукция,
	|	Множители.ОбъектКалькуляции,
	|	ПлановыеТрудозатраты.ВидРабот,
	|	Множители.Продукция,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.Калькуляция,
	|	ПлановыеТрудозатраты.СтатьяКалькуляции,
	|	ПлановыеТрудозатраты.Подразделение,
	|	Множители.ПартияСпецификацияПродукции,
	|	Множители.КоличествоПолуфабриката,
	|	Множители.Назначение,
	|	Множители.Порядок,
	|	Множители.КлючПартия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Множители.ЭтоПродукция,
	|	Множители.ОбъектКалькуляции,
	|	Множители.Калькуляция,
	|	Множители.Продукция,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.КоличествоПолуфабриката,
	|	ПлановыеПрочиеЗатраты.Подразделение,
	|	ПлановыеПрочиеЗатраты.СтатьяКалькуляции,
	|	ПлановыеПрочиеЗатраты.СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|				ТОГДА ПлановыеПрочиеЗатраты.Стоимость
	|			КОГДА &ДанныеПоСебестоимости = 2
	|				ТОГДА ПлановыеПрочиеЗатраты.СтоимостьБезНДС
	|			ИНАЧЕ ПлановыеПрочиеЗатраты.СтоимостьРегл
	|		КОНЕЦ / Множители.Знаменатель * Множители.Числитель),
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА ""ПрочиеПостоянные""
	|		ИНАЧЕ ""ПрочиеПеременные""
	|	КОНЕЦ,
	|	Множители.ПартияСпецификацияПродукции,
	|	ЛОЖЬ,
	|	Множители.Продукция,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.Назначение,
	|	Множители.Порядок,
	|	0,
	|	Множители.КлючПартия
	|ИЗ
	|	ОбщиеМножители КАК Множители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеПрочиеЗатраты КАК ПлановыеПрочиеЗатраты
	|		ПО Множители.Калькуляция = ПлановыеПрочиеЗатраты.Калькуляция
	|			И Множители.ПартияСпецификацияПродукции = ПлановыеПрочиеЗатраты.ПартияСпецификация
	|			И Множители.КлючПартия = ПлановыеПрочиеЗатраты.КлючПартия
	|ГДЕ
	|	НЕ Множители.ПартияВыпущена
	|	И Множители.ЭтоПродукция
	|
	|СГРУППИРОВАТЬ ПО
	|	Множители.ЭтоПродукция,
	|	Множители.ОбъектКалькуляции,
	|	ПлановыеПрочиеЗатраты.СтатьяРасходов,
	|	Множители.Продукция,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.Калькуляция,
	|	ПлановыеПрочиеЗатраты.СтатьяКалькуляции,
	|	ПлановыеПрочиеЗатраты.Подразделение,
	|	Множители.ПартияСпецификацияПродукции,
	|	Множители.КоличествоПолуфабриката,
	|	Множители.Назначение,
	|	Множители.Порядок,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА ""ПрочиеПостоянные""
	|		ИНАЧЕ ""ПрочиеПеременные""
	|	КОНЕЦ,
	|	Множители.КлючПартия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Множители.ЭтоПродукция,
	|	Множители.ОбъектКалькуляции,
	|	Множители.Калькуляция,
	|	Множители.Продукция,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.КоличествоПолуфабриката,
	|	ПлановыеМатериальныеЗатраты.Подразделение,
	|	ПлановыеМатериальныеЗатраты.СтатьяКалькуляции,
	|	ПлановыеМатериальныеЗатраты.Номенклатура,
	|	ПлановыеМатериальныеЗатраты.Характеристика,
	|	СУММА(ПлановыеМатериальныеЗатраты.Количество / Множители.Знаменатель * Множители.Числитель),
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|				ТОГДА ПлановыеМатериальныеЗатраты.Стоимость
	|			КОГДА &ДанныеПоСебестоимости = 2
	|				ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьБезНДС
	|			ИНАЧЕ ПлановыеМатериальныеЗатраты.СтоимостьРегл
	|		КОНЕЦ / Множители.Знаменатель * Множители.Числитель),
	|	ВЫБОР
	|		КОГДА ПлановыеМатериальныеЗатраты.Количество < 0
	|			ТОГДА ""ВозвратныеОтходы""
	|		ИНАЧЕ ""Материальные""
	|	КОНЕЦ,
	|	Множители.ПартияСпецификацияПродукции,
	|	ПлановыеМатериальныеЗатраты.ЭтоПолуфабрикат,
	|	Множители.Полуфабрикат,
	|	Множители.ХарактеристикаПолуфабриката,
	|	Множители.Назначение,
	|	Множители.Порядок,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ ПлановыеМатериальныеЗатраты.СтоимостьЗабалансовая
	|	КОНЕЦ / Множители.Знаменатель * Множители.Числитель,
	|	Множители.КлючПартия
	|ИЗ
	|	ОбщиеМножители КАК Множители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеМатериальныеЗатраты КАК ПлановыеМатериальныеЗатраты
	|		ПО Множители.Калькуляция = ПлановыеМатериальныеЗатраты.Калькуляция
	|			И Множители.ПартияСпецификацияПолуфабриката = ПлановыеМатериальныеЗатраты.ПартияСпецификация
	|			И Множители.КлючПартия = ПлановыеМатериальныеЗатраты.КлючПартия
	|ГДЕ
	|	НЕ Множители.ПартияВыпущена
	|	И НЕ Множители.ЭтоПродукция
	|
	|СГРУППИРОВАТЬ ПО
	|	Множители.ЭтоПродукция,
	|	Множители.ОбъектКалькуляции,
	|	ПлановыеМатериальныеЗатраты.Номенклатура,
	|	Множители.Продукция,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.Калькуляция,
	|	ПлановыеМатериальныеЗатраты.Характеристика,
	|	ПлановыеМатериальныеЗатраты.СтатьяКалькуляции,
	|	ПлановыеМатериальныеЗатраты.Подразделение,
	|	ВЫБОР
	|		КОГДА ПлановыеМатериальныеЗатраты.Количество < 0
	|			ТОГДА ""ВозвратныеОтходы""
	|		ИНАЧЕ ""Материальные""
	|	КОНЕЦ,
	|	Множители.ПартияСпецификацияПродукции,
	|	Множители.КоличествоПолуфабриката,
	|	ПлановыеМатериальныеЗатраты.ЭтоПолуфабрикат,
	|	Множители.Полуфабрикат,
	|	Множители.ХарактеристикаПолуфабриката,
	|	Множители.Назначение,
	|	Множители.Порядок,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ ПлановыеМатериальныеЗатраты.СтоимостьЗабалансовая
	|	КОНЕЦ / Множители.Знаменатель * Множители.Числитель,
	|	Множители.КлючПартия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Множители.ЭтоПродукция,
	|	Множители.ОбъектКалькуляции,
	|	Множители.Калькуляция,
	|	Множители.Продукция,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.КоличествоПолуфабриката,
	|	ПлановыеТрудозатраты.Подразделение,
	|	ПлановыеТрудозатраты.СтатьяКалькуляции,
	|	ПлановыеТрудозатраты.ВидРабот,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	СУММА(ПлановыеТрудозатраты.Количество / Множители.Знаменатель * Множители.Числитель),
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|					ИЛИ &ДанныеПоСебестоимости = 2
	|				ТОГДА ПлановыеТрудозатраты.Стоимость
	|			ИНАЧЕ ПлановыеТрудозатраты.СтоимостьРегл
	|		КОНЕЦ / Множители.Знаменатель * Множители.Числитель),
	|	""Трудозатраты"",
	|	Множители.ПартияСпецификацияПродукции,
	|	ЛОЖЬ,
	|	Множители.Полуфабрикат,
	|	Множители.ХарактеристикаПолуфабриката,
	|	Множители.Назначение,
	|	Множители.Порядок,
	|	0,
	|	Множители.КлючПартия
	|ИЗ
	|	ОбщиеМножители КАК Множители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
	|		ПО Множители.Калькуляция = ПлановыеТрудозатраты.Калькуляция
	|			И Множители.ПартияСпецификацияПолуфабриката = ПлановыеТрудозатраты.ПартияСпецификация
	|			И Множители.КлючПартия = ПлановыеТрудозатраты.КлючПартия
	|ГДЕ
	|	НЕ Множители.ПартияВыпущена
	|	И НЕ Множители.ЭтоПродукция
	|
	|СГРУППИРОВАТЬ ПО
	|	Множители.ЭтоПродукция,
	|	Множители.ОбъектКалькуляции,
	|	ПлановыеТрудозатраты.ВидРабот,
	|	Множители.Продукция,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.Калькуляция,
	|	ПлановыеТрудозатраты.СтатьяКалькуляции,
	|	ПлановыеТрудозатраты.Подразделение,
	|	Множители.ПартияСпецификацияПродукции,
	|	Множители.КоличествоПолуфабриката,
	|	Множители.Полуфабрикат,
	|	Множители.ХарактеристикаПолуфабриката,
	|	Множители.Назначение,
	|	Множители.Порядок,
	|	Множители.КлючПартия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Множители.ЭтоПродукция,
	|	Множители.ОбъектКалькуляции,
	|	Множители.Калькуляция,
	|	Множители.Продукция,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.КоличествоПолуфабриката,
	|	ПлановыеПрочиеЗатраты.Подразделение,
	|	ПлановыеПрочиеЗатраты.СтатьяКалькуляции,
	|	ПлановыеПрочиеЗатраты.СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|				ТОГДА ПлановыеПрочиеЗатраты.Стоимость
	|			КОГДА &ДанныеПоСебестоимости = 2
	|				ТОГДА ПлановыеПрочиеЗатраты.СтоимостьБезНДС
	|			ИНАЧЕ ПлановыеПрочиеЗатраты.СтоимостьРегл
	|		КОНЕЦ / Множители.Знаменатель * Множители.Числитель),
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА ""ПрочиеПостоянные""
	|		ИНАЧЕ ""ПрочиеПеременные""
	|	КОНЕЦ,
	|	Множители.ПартияСпецификацияПродукции,
	|	ЛОЖЬ,
	|	Множители.Полуфабрикат,
	|	Множители.ХарактеристикаПолуфабриката,
	|	Множители.Назначение,
	|	Множители.Порядок,
	|	0,
	|	Множители.КлючПартия
	|ИЗ
	|	ОбщиеМножители КАК Множители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеПрочиеЗатраты КАК ПлановыеПрочиеЗатраты
	|		ПО Множители.Калькуляция = ПлановыеПрочиеЗатраты.Калькуляция
	|			И Множители.ПартияСпецификацияПолуфабриката = ПлановыеПрочиеЗатраты.ПартияСпецификация
	|			И Множители.КлючПартия = ПлановыеПрочиеЗатраты.КлючПартия
	|ГДЕ
	|	НЕ Множители.ПартияВыпущена
	|	И НЕ Множители.ЭтоПродукция
	|
	|СГРУППИРОВАТЬ ПО
	|	Множители.ЭтоПродукция,
	|	Множители.ОбъектКалькуляции,
	|	ПлановыеПрочиеЗатраты.СтатьяРасходов,
	|	Множители.Продукция,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.Калькуляция,
	|	ПлановыеПрочиеЗатраты.СтатьяКалькуляции,
	|	ПлановыеПрочиеЗатраты.Подразделение,
	|	Множители.ПартияСпецификацияПродукции,
	|	Множители.КоличествоПолуфабриката,
	|	Множители.Полуфабрикат,
	|	Множители.ХарактеристикаПолуфабриката,
	|	Множители.Назначение,
	|	Множители.Порядок,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА ""ПрочиеПостоянные""
	|		ИНАЧЕ ""ПрочиеПеременные""
	|	КОНЕЦ,
	|	Множители.КлючПартия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбщиеМножители.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
	|	ОбщиеМножители.Полуфабрикат КАК Полуфабрикат,
	|	ОбщиеМножители.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката
	|ПОМЕСТИТЬ ОбщиеМножителиДляОтбораРНСебестоимостьТоваров
	|ИЗ
	|	ОбщиеМножители КАК ОбщиеМножители
	|ГДЕ
	|	ОбщиеМножители.ПартияВыпущена
	|	И НЕ ОбщиеМножители.ЭтоПродукция
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПартияСпецификацияПолуфабриката,
	|	Полуфабрикат,
	|	ХарактеристикаПолуфабриката
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбщиеМножители.Полуфабрикат КАК Полуфабрикат,
	|	ОбщиеМножители.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
	|	СебестоимостьТоваров.Партия КАК Партия,
	|	СебестоимостьТоваров.КорПартия КАК КорПартия,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	СУММА(СебестоимостьТоваров.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|				ТОГДА СебестоимостьТоваров.Стоимость
	|			КОГДА &ДанныеПоСебестоимости = 2
	|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
	|			ИНАЧЕ СебестоимостьТоваров.СтоимостьРегл
	|		КОНЕЦ) КАК Стоимость,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 3
	|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|			ИНАЧЕ СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОНЕЦ) КАК СтоимостьЗабалансовая
	|ПОМЕСТИТЬ ВТСебестоимостьТоваров
	|ИЗ
	|	ОбщиеМножителиДляОтбораРНСебестоимостьТоваров КАК ОбщиеМножители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|		ПО ОбщиеМножители.ПартияСпецификацияПолуфабриката = СебестоимостьТоваров.КорПартия
	|			И ОбщиеМножители.Полуфабрикат = СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры.Номенклатура
	|			И ОбщиеМножители.ХарактеристикаПолуфабриката = СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры.Характеристика
	|			И (СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И (НЕ СебестоимостьТоваров.Партия = НЕОПРЕДЕЛЕНО)
	|			И (НЕ СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщиеМножители.Полуфабрикат,
	|	ОбщиеМножители.ХарактеристикаПолуфабриката,
	|	СебестоимостьТоваров.Партия,
	|	СебестоимостьТоваров.КорПартия,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КорПартия,
	|	Полуфабрикат,
	|	ХарактеристикаПолуфабриката
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОбщиеМножителиДляОтбораРНСебестоимостьТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбщиеМножителиСАналитикойПартии.ОбъектКалькуляции КАК ОбъектКалькуляции,
	|	ОбщиеМножителиСАналитикойПартии.Калькуляция КАК Калькуляция,
	|	ОбщиеМножителиСАналитикойПартии.Продукция КАК Продукция,
	|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	ОбщиеМножителиСАналитикойПартии.КоличествоПолуфабриката КАК КоличествоПолуфабриката,
	|	СебестоимостьТоваров.Партия КАК ПартияПроизводства,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения КАК Подразделение,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	СУММА(СебестоимостьТоваров.Количество / ОбщиеМножителиСАналитикойПартии.Знаменатель * ОбщиеМножителиСАналитикойПартии.Числитель) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|				ТОГДА СебестоимостьТоваров.Стоимость
	|			КОГДА &ДанныеПоСебестоимости = 2
	|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
	|			ИНАЧЕ СебестоимостьТоваров.СтоимостьРегл
	|		КОНЕЦ / ОбщиеМножителиСАналитикойПартии.Знаменатель * ОбщиеМножителиСАналитикойПартии.Числитель) КАК Стоимость,
	|	""Материальные"" КАК ТипЗатрат,
	|	ОбщиеМножителиСАналитикойПартии.Продукция.ЕдиницаИзмерения КАК ПродукцияЕдиницаИзмерения,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ОбщиеМножителиСАналитикойПартии.Числитель КАК Числитель,
	|	ОбщиеМножителиСАналитикойПартии.Знаменатель КАК Знаменатель,
	|	ОбщиеМножителиСАналитикойПартии.Продукция КАК Полуфабрикат,
	|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции КАК ХарактеристикаПолуфабриката,
	|	ОбщиеМножителиСАналитикойПартии.ЭтоПродукция КАК ЭтоПродукция,
	|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции КАК ПартияПолуфабриката,
	|	ОбщиеМножителиСАналитикойПартии.Назначение КАК Назначение,
	|	ОбщиеМножителиСАналитикойПартии.Порядок КАК Порядок,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 3
	|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|			ИНАЧЕ СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОНЕЦ / ОбщиеМножителиСАналитикойПартии.Знаменатель * ОбщиеМножителиСАналитикойПартии.Числитель) КАК Забалансовая,
	|	ОбщиеМножителиСАналитикойПартии.КлючПартия КАК КлючПартия
	|	
	|ПОМЕСТИТЬ ФактическиеЗатраты
	|ИЗ
	|	ОбщиеМножителиСАналитикойПартии КАК ОбщиеМножителиСАналитикойПартии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|		ПО ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции = СебестоимостьТоваров.КорПартия
	|			И ОбщиеМножителиСАналитикойПартии.АналитикаУчетаПартий = СебестоимостьТоваров.КорАналитикаУчетаПартий
	|			И (СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И (НЕ СебестоимостьТоваров.Партия = НЕОПРЕДЕЛЕНО)
	|			И НЕ СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщиеМножителиСАналитикойПартии.ОбъектКалькуляции,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура,
	|	СебестоимостьТоваров.Партия,
	|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
	|	ОбщиеМножителиСАналитикойПартии.Продукция,
	|	ОбщиеМножителиСАналитикойПартии.Калькуляция,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения,
	|	СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Характеристика,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
	|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
	|	ОбщиеМножителиСАналитикойПартии.КоличествоПолуфабриката,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	ОбщиеМножителиСАналитикойПартии.Продукция.ЕдиницаИзмерения,
	|	ОбщиеМножителиСАналитикойПартии.Знаменатель,
	|	ОбщиеМножителиСАналитикойПартии.Числитель,
	|	ОбщиеМножителиСАналитикойПартии.ЭтоПродукция,
	|	ОбщиеМножителиСАналитикойПартии.Назначение,
	|	ОбщиеМножителиСАналитикойПартии.Порядок,
	|	ОбщиеМножителиСАналитикойПартии.КлючПартия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбщиеМножителиСАналитикойПартии.ОбъектКалькуляции,
	|	ОбщиеМножителиСАналитикойПартии.Калькуляция,
	|	ОбщиеМножителиСАналитикойПартии.Продукция,
	|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
	|	ОбщиеМножителиСАналитикойПартии.КоличествоПолуфабриката,
	|	ПрочиеРасходыНезавершенногоПроизводства.ПартияПроизводства,
	|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяКалькуляции,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	СУММА(0),
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|				ТОГДА ПрочиеРасходыНезавершенногоПроизводства.Стоимость
	|			КОГДА &ДанныеПоСебестоимости = 2
	|				ТОГДА ПрочиеРасходыНезавершенногоПроизводства.СтоимостьБезНДС
	|			ИНАЧЕ ПрочиеРасходыНезавершенногоПроизводства.СтоимостьРегл
	|		КОНЕЦ * ОбщиеМножителиСАналитикойПартии.ДоляСтоимости),
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА ""ПрочиеПостоянные""
	|		ИНАЧЕ ""ПрочиеПеременные""
	|	КОНЕЦ,
	|	ОбщиеМножителиСАналитикойПартии.Продукция.ЕдиницаИзмерения,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
	|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
	|	ОбщиеМножителиСАналитикойПартии.Числитель,
	|	ОбщиеМножителиСАналитикойПартии.Знаменатель,
	|	ОбщиеМножителиСАналитикойПартии.Продукция,
	|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
	|	ОбщиеМножителиСАналитикойПартии.ЭтоПродукция,
	|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
	|	ОбщиеМножителиСАналитикойПартии.Назначение,
	|	ОбщиеМножителиСАналитикойПартии.Порядок,
	|	0,
	|	ОбщиеМножителиСАналитикойПартии.КлючПартия
	|ИЗ
	|	ОбщиеМножителиСАналитикойПартии КАК ОбщиеМножителиСАналитикойПартии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНезавершенногоПроизводства
	|		ПО ОбщиеМножителиСАналитикойПартии.Продукция = ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Номенклатура
	|			И ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции = ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Характеристика
	|			И ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции = ПрочиеРасходыНезавершенногоПроизводства.Регистратор
	|			И (ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И ОбщиеМножителиСАналитикойПартии.АналитикаУчетаПартий = ПрочиеРасходыНезавершенногоПроизводства.КорАналитикаУчетаПартий
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщиеМножителиСАналитикойПартии.ОбъектКалькуляции,
	|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
	|	ПрочиеРасходыНезавершенногоПроизводства.ПартияПроизводства,
	|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяКалькуляции,
	|	ОбщиеМножителиСАналитикойПартии.Продукция,
	|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
	|	ОбщиеМножителиСАналитикойПартии.Калькуляция,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов,
	|	ОбщиеМножителиСАналитикойПартии.КоличествоПолуфабриката,
	|	ОбщиеМножителиСАналитикойПартии.Продукция.ЕдиницаИзмерения,
	|	ОбщиеМножителиСАналитикойПартии.Знаменатель,
	|	ОбщиеМножителиСАналитикойПартии.Числитель,
	|	ОбщиеМножителиСАналитикойПартии.ЭтоПродукция,
	|	ОбщиеМножителиСАналитикойПартии.Назначение,
	|	ОбщиеМножителиСАналитикойПартии.Порядок,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА ""ПрочиеПостоянные""
	|		ИНАЧЕ ""ПрочиеПеременные""
	|	КОНЕЦ,
	|	ОбщиеМножителиСАналитикойПартии.КлючПартия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбщиеМножителиСАналитикойПартии.ОбъектКалькуляции,
	|	ОбщиеМножителиСАналитикойПартии.Калькуляция,
	|	ОбщиеМножителиСАналитикойПартии.Продукция,
	|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
	|	ОбщиеМножителиСАналитикойПартии.КоличествоПолуфабриката,
	|	ТрудозатратыНезавершенногоПроизводства.ПартияПроизводства,
	|	ТрудозатратыНезавершенногоПроизводства.Подразделение,
	|	ТрудозатратыНезавершенногоПроизводства.СтатьяКалькуляции,
	|	ТрудозатратыНезавершенногоПроизводства.ВидРабот,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	СУММА(ТрудозатратыНезавершенногоПроизводства.Количество * ОбщиеМножителиСАналитикойПартии.ДоляСтоимости),
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|					ИЛИ &ДанныеПоСебестоимости = 2
	|				ТОГДА ТрудозатратыНезавершенногоПроизводства.Стоимость
	|			ИНАЧЕ ТрудозатратыНезавершенногоПроизводства.СтоимостьРегл
	|		КОНЕЦ * ОбщиеМножителиСАналитикойПартии.ДоляСтоимости),
	|	""Трудозатраты"",
	|	ОбщиеМножителиСАналитикойПартии.Продукция.ЕдиницаИзмерения,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
	|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
	|	ОбщиеМножителиСАналитикойПартии.Числитель,
	|	ОбщиеМножителиСАналитикойПартии.Знаменатель,
	|	ОбщиеМножителиСАналитикойПартии.Продукция,
	|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
	|	ОбщиеМножителиСАналитикойПартии.ЭтоПродукция,
	|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
	|	ОбщиеМножителиСАналитикойПартии.Назначение,
	|	ОбщиеМножителиСАналитикойПартии.Порядок,
	|	0,
	|	ОбщиеМножителиСАналитикойПартии.КлючПартия
	|ИЗ
	|	ОбщиеМножителиСАналитикойПартии КАК ОбщиеМножителиСАналитикойПартии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ТрудозатратыНезавершенногоПроизводства
	|		ПО ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции = ТрудозатратыНезавершенногоПроизводства.Регистратор
	|			И ОбщиеМножителиСАналитикойПартии.Продукция = ТрудозатратыНезавершенногоПроизводства.КорАналитикаУчетаПродукции.Номенклатура
	|			И ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции = ТрудозатратыНезавершенногоПроизводства.КорАналитикаУчетаПродукции.Характеристика
	|			И (ТрудозатратыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И ОбщиеМножителиСАналитикойПартии.АналитикаУчетаПартий = ТрудозатратыНезавершенногоПроизводства.КорАналитикаУчетаПартий
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщиеМножителиСАналитикойПартии.ОбъектКалькуляции,
	|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
	|	ОбщиеМножителиСАналитикойПартии.Калькуляция,
	|	ОбщиеМножителиСАналитикойПартии.Продукция,
	|	ТрудозатратыНезавершенногоПроизводства.ПартияПроизводства,
	|	ТрудозатратыНезавершенногоПроизводства.ВидРабот,
	|	ТрудозатратыНезавершенногоПроизводства.Подразделение,
	|	ТрудозатратыНезавершенногоПроизводства.СтатьяКалькуляции,
	|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
	|	ОбщиеМножителиСАналитикойПартии.КоличествоПолуфабриката,
	|	ОбщиеМножителиСАналитикойПартии.Продукция.ЕдиницаИзмерения,
	|	ОбщиеМножителиСАналитикойПартии.Знаменатель,
	|	ОбщиеМножителиСАналитикойПартии.Числитель,
	|	ОбщиеМножителиСАналитикойПартии.ЭтоПродукция,
	|	ОбщиеМножителиСАналитикойПартии.Назначение,
	|	ОбщиеМножителиСАналитикойПартии.Порядок,
	|	ОбщиеМножителиСАналитикойПартии.КлючПартия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбщиеМножители.ОбъектКалькуляции,
	|	ОбщиеМножители.Калькуляция,
	|	ОбщиеМножители.Продукция,
	|	ОбщиеМножители.ХарактеристикаПродукции,
	|	ОбщиеМножители.КоличествоПолуфабриката,
	|	СебестоимостьТоваров.Партия,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Характеристика,
	|	СУММА(СебестоимостьТоваров.Количество / ОбщиеМножители.Знаменатель * ОбщиеМножители.Числитель),
	|	СУММА(СебестоимостьТоваров.Стоимость / ОбщиеМножители.Знаменатель * ОбщиеМножители.Числитель),
	|	""Материальные"",
	|	ОбщиеМножители.Продукция.ЕдиницаИзмерения,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
	|	ОбщиеМножители.ПартияСпецификацияПродукции,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	ОбщиеМножители.Числитель,
	|	ОбщиеМножители.Знаменатель,
	|	ОбщиеМножители.Полуфабрикат,
	|	ОбщиеМножители.ХарактеристикаПолуфабриката,
	|	ОбщиеМножители.ЭтоПродукция,
	|	ОбщиеМножители.ПартияСпецификацияПолуфабриката,
	|	ОбщиеМножители.Назначение,
	|	ОбщиеМножители.Порядок,
	|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансовая / ОбщиеМножители.Знаменатель * ОбщиеМножители.Числитель),
	|	ОбщиеМножители.КлючПартия
	|ИЗ
	|	ОбщиеМножители КАК ОбщиеМножители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСебестоимостьТоваров КАК СебестоимостьТоваров
	|		ПО ОбщиеМножители.ПартияСпецификацияПолуфабриката = СебестоимостьТоваров.КорПартия
	|			И ОбщиеМножители.Полуфабрикат = СебестоимостьТоваров.Полуфабрикат
	|			И ОбщиеМножители.ХарактеристикаПолуфабриката = СебестоимостьТоваров.ХарактеристикаПолуфабриката
	|ГДЕ
	|	ОбщиеМножители.ПартияВыпущена
	|	И НЕ ОбщиеМножители.ЭтоПродукция
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщиеМножители.ОбъектКалькуляции,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура,
	|	СебестоимостьТоваров.Партия,
	|	ОбщиеМножители.ХарактеристикаПродукции,
	|	ОбщиеМножители.Продукция,
	|	ОбщиеМножители.Калькуляция,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Характеристика,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
	|	ОбщиеМножители.ПартияСпецификацияПродукции,
	|	ОбщиеМножители.КоличествоПолуфабриката,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	ОбщиеМножители.Продукция.ЕдиницаИзмерения,
	|	ОбщиеМножители.Знаменатель,
	|	ОбщиеМножители.Числитель,
	|	ОбщиеМножители.Полуфабрикат,
	|	ОбщиеМножители.ХарактеристикаПолуфабриката,
	|	ОбщиеМножители.ЭтоПродукция,
	|	ОбщиеМножители.ПартияСпецификацияПолуфабриката,
	|	ОбщиеМножители.Назначение,
	|	ОбщиеМножители.Порядок,
	|	ОбщиеМножители.КлючПартия
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбщиеМножители.ОбъектКалькуляции,
	|	ОбщиеМножители.Калькуляция,
	|	ОбщиеМножители.Продукция,
	|	ОбщиеМножители.ХарактеристикаПродукции,
	|	ОбщиеМножители.КоличествоПолуфабриката,
	|	ПрочиеРасходыНезавершенногоПроизводства.ПартияПроизводства,
	|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяКалькуляции,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|				ТОГДА ПрочиеРасходыНезавершенногоПроизводства.Стоимость
	|			КОГДА &ДанныеПоСебестоимости = 2
	|				ТОГДА ПрочиеРасходыНезавершенногоПроизводства.СтоимостьБезНДС
	|			ИНАЧЕ ПрочиеРасходыНезавершенногоПроизводства.СтоимостьРегл
	|		КОНЕЦ / ОбщиеМножители.Знаменатель * ОбщиеМножители.Числитель),
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА ""ПрочиеПостоянные""
	|		ИНАЧЕ ""ПрочиеПеременные""
	|	КОНЕЦ,
	|	ОбщиеМножители.Продукция.ЕдиницаИзмерения,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
	|	ОбщиеМножители.ПартияСпецификацияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
	|	ОбщиеМножители.Числитель,
	|	ОбщиеМножители.Знаменатель,
	|	ОбщиеМножители.Полуфабрикат,
	|	ОбщиеМножители.ХарактеристикаПолуфабриката,
	|	ОбщиеМножители.ЭтоПродукция,
	|	ОбщиеМножители.ПартияСпецификацияПолуфабриката,
	|	ОбщиеМножители.Назначение,
	|	ОбщиеМножители.Порядок,
	|	0,
	|	ОбщиеМножители.КлючПартия
	|ИЗ
	|	ОбщиеМножители КАК ОбщиеМножители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНезавершенногоПроизводства
	|		ПО ОбщиеМножители.ПартияСпецификацияПолуфабриката = ПрочиеРасходыНезавершенногоПроизводства.Регистратор
	|			И ОбщиеМножители.Полуфабрикат = ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Номенклатура
	|			И ОбщиеМножители.ХарактеристикаПолуфабриката = ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Характеристика
	|			И (ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|ГДЕ
	|	ОбщиеМножители.ПартияВыпущена
	|	И НЕ ОбщиеМножители.ЭтоПродукция
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщиеМножители.ОбъектКалькуляции,
	|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
	|	ПрочиеРасходыНезавершенногоПроизводства.ПартияПроизводства,
	|	ОбщиеМножители.ПартияСпецификацияПродукции,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяКалькуляции,
	|	ОбщиеМножители.Продукция,
	|	ОбщиеМножители.ХарактеристикаПродукции,
	|	ОбщиеМножители.Калькуляция,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов,
	|	ОбщиеМножители.КоличествоПолуфабриката,
	|	ОбщиеМножители.Продукция.ЕдиницаИзмерения,
	|	ОбщиеМножители.Знаменатель,
	|	ОбщиеМножители.Числитель,
	|	ОбщиеМножители.Полуфабрикат,
	|	ОбщиеМножители.ХарактеристикаПолуфабриката,
	|	ОбщиеМножители.ЭтоПродукция,
	|	ОбщиеМножители.ПартияСпецификацияПолуфабриката,
	|	ОбщиеМножители.Назначение,
	|	ОбщиеМножители.Порядок,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА ""ПрочиеПостоянные""
	|		ИНАЧЕ ""ПрочиеПеременные""
	|	КОНЕЦ,
	|	ОбщиеМножители.КлючПартия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбщиеМножители.ОбъектКалькуляции,
	|	ОбщиеМножители.Калькуляция,
	|	ОбщиеМножители.Продукция,
	|	ОбщиеМножители.ХарактеристикаПродукции,
	|	ОбщиеМножители.КоличествоПолуфабриката,
	|	ТрудозатратыНезавершенногоПроизводства.ПартияПроизводства,
	|	ТрудозатратыНезавершенногоПроизводства.Подразделение,
	|	ТрудозатратыНезавершенногоПроизводства.СтатьяКалькуляции,
	|	ТрудозатратыНезавершенногоПроизводства.ВидРабот,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	СУММА(ТрудозатратыНезавершенногоПроизводства.Количество / ОбщиеМножители.Знаменатель * ОбщиеМножители.Числитель),
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|					ИЛИ &ДанныеПоСебестоимости = 2
	|				ТОГДА ТрудозатратыНезавершенногоПроизводства.Стоимость
	|			ИНАЧЕ ТрудозатратыНезавершенногоПроизводства.СтоимостьРегл
	|		КОНЕЦ / ОбщиеМножители.Знаменатель * ОбщиеМножители.Числитель),
	|	""Трудозатраты"",
	|	ОбщиеМножители.Продукция.ЕдиницаИзмерения,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
	|	ОбщиеМножители.ПартияСпецификацияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
	|	ОбщиеМножители.Числитель,
	|	ОбщиеМножители.Знаменатель,
	|	ОбщиеМножители.Полуфабрикат,
	|	ОбщиеМножители.ХарактеристикаПолуфабриката,
	|	ОбщиеМножители.ЭтоПродукция,
	|	ОбщиеМножители.ПартияСпецификацияПолуфабриката,
	|	ОбщиеМножители.Назначение,
	|	ОбщиеМножители.Порядок,
	|	0,
	|	ОбщиеМножители.КлючПартия
	|ИЗ
	|	ОбщиеМножители КАК ОбщиеМножители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ТрудозатратыНезавершенногоПроизводства
	|		ПО ОбщиеМножители.ПартияСпецификацияПолуфабриката = ТрудозатратыНезавершенногоПроизводства.Регистратор
	|			И ОбщиеМножители.Полуфабрикат = ТрудозатратыНезавершенногоПроизводства.КорАналитикаУчетаПродукции.Номенклатура
	|			И ОбщиеМножители.ХарактеристикаПолуфабриката = ТрудозатратыНезавершенногоПроизводства.КорАналитикаУчетаПродукции.Характеристика
	|			И (ТрудозатратыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|ГДЕ
	|	ОбщиеМножители.ПартияВыпущена
	|	И НЕ ОбщиеМножители.ЭтоПродукция
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщиеМножители.ОбъектКалькуляции,
	|	ОбщиеМножители.ХарактеристикаПродукции,
	|	ОбщиеМножители.Калькуляция,
	|	ОбщиеМножители.Продукция,
	|	ТрудозатратыНезавершенногоПроизводства.ПартияПроизводства,
	|	ТрудозатратыНезавершенногоПроизводства.ВидРабот,
	|	ТрудозатратыНезавершенногоПроизводства.Подразделение,
	|	ТрудозатратыНезавершенногоПроизводства.СтатьяКалькуляции,
	|	ОбщиеМножители.ПартияСпецификацияПродукции,
	|	ОбщиеМножители.КоличествоПолуфабриката,
	|	ОбщиеМножители.Продукция.ЕдиницаИзмерения,
	|	ОбщиеМножители.Знаменатель,
	|	ОбщиеМножители.Числитель,
	|	ОбщиеМножители.Полуфабрикат,
	|	ОбщиеМножители.ХарактеристикаПолуфабриката,
	|	ОбщиеМножители.ЭтоПродукция,
	|	ОбщиеМножители.ПартияСпецификацияПолуфабриката,
	|	ОбщиеМножители.Назначение,
	|	ОбщиеМножители.Порядок,
	|	ОбщиеМножители.КлючПартия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСебестоимостьТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФактическиеЗатраты.ОбъектКалькуляции КАК ОбъектКалькуляции,
	|	ФактическиеЗатраты.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ФактическиеЗатраты.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
	|	ФактическиеЗатраты.ПартияПроизводства КАК ПартияПроизводства,
	|	ФактическиеЗатраты.КлючПартия КАК КлючПартия
	|ПОМЕСТИТЬ АналитикиПартии
	|ИЗ
	|	ФактическиеЗатраты КАК ФактическиеЗатраты
	|ГДЕ
	|	НЕ ФактическиеЗатраты.АналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	И ФактическиеЗатраты.ЭтоПродукция
	|	И ФактическиеЗатраты.ТипЗатрат = ""Материальные""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФактическиеЗатраты.ОбъектКалькуляции,
	|	ФактическиеЗатраты.АналитикаУчетаНоменклатуры,
	|	ФактическиеЗатраты.ПартияПолуфабриката,
	|	ФактическиеЗатраты.ПартияПроизводства,
	|	ФактическиеЗатраты.КлючПартия
	|ИЗ
	|	ФактическиеЗатраты КАК ФактическиеЗатраты
	|ГДЕ
	|	НЕ ФактическиеЗатраты.ЭтоПродукция
	|	И ФактическиеЗатраты.ТипЗатрат = ""Материальные""
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПартияСпецификацияПродукции,
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АналитикиПартии.ОбъектКалькуляции КАК ОбъектКалькуляции,
	|	АналитикиПартии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	АналитикиПартии.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
	|	ОпределениеПартии.Партия КАК Партия,
	|	ОпределениеПартии.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	АналитикиПартии.КлючПартия КАК КлючПартия
	|ПОМЕСТИТЬ ВТОпределениеПартии
	|ИЗ
	|	АналитикиПартии КАК АналитикиПартии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ОпределениеПартии
	|		ПО АналитикиПартии.ПартияПроизводства = ОпределениеПартии.КорПартия
	|			И АналитикиПартии.АналитикаУчетаНоменклатуры = ОпределениеПартии.КорАналитикаУчетаНоменклатуры
	|			И (ОпределениеПартии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И (ОпределениеПартии.РазделУчета В (ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)))
	|			И (ОпределениеПартии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства))
	|			И (ОпределениеПартии.Количество > 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	АналитикаУчетаПартий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОпределениеПартии.ОбъектКалькуляции КАК ОбъектКалькуляции,
	|	ОпределениеПартии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ОпределениеПартии.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
	|	ДвиженияВыпуска.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость) КАК ФиксСтоимость,
	|	СУММА(ЕСТЬNULL(ДвиженияВыпуска.Количество, 0)) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.Стоимость, 0) + ЕСТЬNULL(ДвиженияВыпуска.ДопРасходы, 0)
	|			КОГДА &ДанныеПоСебестоимости = 2
	|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.СтоимостьБезНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.ДопРасходыБезНДС, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияВыпуска.СтоимостьРегл, 0) + ЕСТЬNULL(ДвиженияВыпуска.ДопРасходыРегл, 0)
	|		КОНЕЦ) КАК СтоимостьМатериальные,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.Трудозатраты, 0)
	|			КОГДА &ДанныеПоСебестоимости = 2
	|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.Трудозатраты, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияВыпуска.ТрудозатратыРегл, 0)
	|		КОНЕЦ) КАК СтоимостьТрудозатраты,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПостоянныеСНДС, 0)
	|			КОГДА &ДанныеПоСебестоимости = 2
	|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПостоянныеБезНДС, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПостоянныеРегл, 0)
	|		КОНЕЦ) КАК СтоимостьПрочиеПостоянные,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПеременныеСНДС, 0)
	|			КОГДА &ДанныеПоСебестоимости = 2
	|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПеременныеБезНДС, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПеременныеРегл, 0)
	|		КОНЕЦ) КАК СтоимостьПрочиеПеременные,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 1
	|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.Стоимость, 0) + ЕСТЬNULL(ДвиженияВыпуска.ДопРасходы, 0) + ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПостоянныеСНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПеременныеСНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.Трудозатраты, 0)
	|			КОГДА &ДанныеПоСебестоимости = 2
	|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.СтоимостьБезНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.ДопРасходыБезНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПостоянныеБезНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПеременныеБезНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.Трудозатраты, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияВыпуска.СтоимостьРегл, 0) + ЕСТЬNULL(ДвиженияВыпуска.ДопРасходыРегл, 0) + ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПостоянныеРегл, 0) + ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПеременныеРегл, 0) + ЕСТЬNULL(ДвиженияВыпуска.ТрудозатратыРегл, 0)
	|		КОНЕЦ) КАК Стоимость,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеПоСебестоимости = 3
	|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.СтоимостьЗабалансовая, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияВыпуска.СтоимостьЗабалансоваяРегл, 0)
	|		КОНЕЦ) КАК СтоимостьЗабалансовая,
	|	ОпределениеПартии.КлючПартия КАК КлючПартия
	|ПОМЕСТИТЬ ОпределениеПолуфабрикатов
	|ИЗ
	|	ВТОпределениеПартии КАК ОпределениеПартии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ДвиженияВыпуска
	|		ПО ОпределениеПартии.Партия = ДвиженияВыпуска.Партия
	|			И ОпределениеПартии.АналитикаУчетаПартий = ДвиженияВыпуска.АналитикаУчетаПартий
	|			И (ДвиженияВыпуска.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)))
	|
	|СГРУППИРОВАТЬ ПО
	|	ОпределениеПартии.ОбъектКалькуляции,
	|	ОпределениеПартии.АналитикаУчетаНоменклатуры,
	|	ОпределениеПартии.ПартияСпецификацияПродукции,
	|	ДвиженияВыпуска.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость),
	|	ОпределениеПартии.КлючПартия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОпределениеПартии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ОбъектКалькуляции КАК ОбъектКалькуляции,
	|	ВТ.Калькуляция КАК Калькуляция,
	|	ВТ.Продукция КАК Продукция,
	|	ВТ.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	СУММА(ВТ.Стоимость) / ВЫБОР
	|		КОГДА СУММА(ВТ.КоличествоПолуфабриката) = 0
	|			ТОГДА 1
	|		ИНАЧЕ СУММА(ВТ.КоличествоПолуфабриката)
	|	КОНЕЦ КАК Цена,
	|	ВТ.ПартияПродукции КАК ПартияПродукции,
	|	ВТ.Полуфабрикат КАК Полуфабрикат,
	|	ВТ.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
	|	ВТ.НазначениеПродукции КАК НазначениеПродукции
	|ПОМЕСТИТЬ ЦеныПолуфабрикатов
	|ИЗ
	|	(ВЫБРАТЬ
	|		Данные.ОбъектКалькуляции КАК ОбъектКалькуляции,
	|		Данные.Калькуляция КАК Калькуляция,
	|		Данные.Продукция КАК Продукция,
	|		Данные.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|		СУММА(Данные.Стоимость) КАК Стоимость,
	|		0 КАК КоличествоПолуфабриката,
	|		Данные.ПартияСпецификацияПродукции КАК ПартияПродукции,
	|		Данные.Полуфабрикат КАК Полуфабрикат,
	|		Данные.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
	|		Данные.Назначение КАК НазначениеПродукции,
	|		Данные.КлючПартия КАК КлючПартия
	|	ИЗ
	|		Данные КАК Данные
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Данные.ОбъектКалькуляции,
	|		Данные.Калькуляция,
	|		Данные.Продукция,
	|		Данные.ХарактеристикаПродукции,
	|		Данные.ПартияСпецификацияПродукции,
	|		Данные.Полуфабрикат,
	|		Данные.ХарактеристикаПолуфабриката,
	|		Данные.Назначение,
	|		Данные.КлючПартия
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Множители.ОбъектКалькуляции,
	|		Множители.Калькуляция,
	|		Множители.Продукция,
	|		Множители.ХарактеристикаПродукции,
	|		0,
	|		СУММА(Множители.КоличествоПолуфабриката),
	|		Множители.ПартияСпецификацияПродукции,
	|		Множители.Полуфабрикат,
	|		Множители.ХарактеристикаПолуфабриката,
	|		Множители.Назначение,
	|		Множители.КлючПартия
	|	ИЗ
	|		ОбщиеМножители КАК Множители
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Множители.ОбъектКалькуляции,
	|		Множители.Калькуляция,
	|		Множители.Продукция,
	|		Множители.ХарактеристикаПродукции,
	|		Множители.ПартияСпецификацияПродукции,
	|		Множители.Полуфабрикат,
	|		Множители.ХарактеристикаПолуфабриката,
	|		Множители.Назначение,
	|		Множители.КлючПартия) КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ОбъектКалькуляции,
	|	ВТ.Калькуляция,
	|	ВТ.Продукция,
	|	ВТ.ХарактеристикаПродукции,
	|	ВТ.ПартияПродукции,
	|	ВТ.Полуфабрикат,
	|	ВТ.ХарактеристикаПолуфабриката,
	|	ВТ.НазначениеПродукции
	|";
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	Результат = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Возврат Результат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПлановаяСебестоимостьПродукции);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПлановаяСебестоимостьПродукции");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы плановые затраты по выпускаемой продукции?';
									|en = 'Check the planned costs for the released products.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");	
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПлановаяСебестоимостьПродукцииКонтекст");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
