
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриПолученииКоличестваВыбранныхФайловДляВыгрузкиНаДиск(Дерево, КоличествоВыбранныхФайлов) Экспорт
	
	Для Каждого Строка1 Из Дерево.ПолучитьЭлементы() Цикл
		Для Каждого Строка2 Из Строка1.ПолучитьЭлементы() Цикл
			
			Если Строка2.Выгружать И Строка2.ЭтоЭДО Тогда
				КоличествоВыбранныхФайлов = КоличествоВыбранныхФайлов + 1;
			КонецЕсли;
			
			Для Каждого Строка3 Из Строка2.ПолучитьЭлементы() Цикл
				Если Строка3.Выгружать И Строка3.ЭтоЭДО Тогда
					КоличествоВыбранныхФайлов = КоличествоВыбранныхФайлов + 1;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
