
&Вместо("ПараметрыРазузлования")
Функция Расш1_ПараметрыРазузлования()
	Результат = ПродолжитьВызов();
	Результат.РазделятьНаОптимальныеПартии = Ложь;	
	Возврат Результат;
КонецФункции

&ИзменениеИКонтроль("Разузловать")
Функция Расш1_Разузловать(Изделия, ПараметрыРазузлования, ПараметрыВыборки)

	Результат = Новый Структура;
	Результат.Вставить("ДанныеСпецификаций", Неопределено);
	Результат.Вставить("ЕстьОшибка",         Ложь);
	Результат.Вставить("ОшибкаТекст",        "");
	Результат.Вставить("ОшибкаСсылка",       Неопределено);

	Потребности = ВыгрузитьВходящиеИзделияДляОбработки(Изделия);
	ПараметрыВыборки.ПереченьДанных = Справочники.РесурсныеСпецификации.ПереченьДанныхСпецификации();
	РазузловатьПотребностиРекурсивно(Потребности, Потребности, ПараметрыРазузлования, ПараметрыВыборки);

	ОписаниеОшибки = Новый Структура("ЕстьОшибка, ОшибкаТекст, ОшибкаСсылка", Ложь, "", Неопределено);
	ПроверитьКорректностьСпецификаций(Потребности.ВыгрузитьКолонку("Спецификация"), ОписаниеОшибки);

	Если НЕ ОписаниеОшибки.ЕстьОшибка Тогда

		//++ НЕ УТКА
		ЗаполнитьСрокиОбеспеченияПролеживанияПотребностей(Потребности); 
		#Удаление
		Если ПараметрыРазузлования.ГруппироватьДанные Тогда
			СвернутьПотребности(Потребности, ПараметрыРазузлования, ПараметрыВыборки);
		КонецЕсли;
		#КонецУдаления
		//-- НЕ УТКА

		Результат.ДанныеСпецификаций = РазделитьПотребностиНаПартии(Потребности, ПараметрыРазузлования);

	Иначе
		ЗаполнитьЗначенияСвойств(Результат, ОписаниеОшибки);
	КонецЕсли;

	Возврат Результат;

КонецФункции