
#Область ПрограммныйИнтерфейс

// Вызывается из "ПриЧтенииНаСервере" формы элемента справочника ШаблоныДокументов
// 
// Параметры:
//  ТекущийОбъект - СправочникОбъект.ШаблоныДокументов
//  Форма - ФормаКлиентскогоПриложения
Процедура ПриЧтенииНаСервере_ФормаЭлемента(ТекущийОбъект, Форма) Экспорт

// Локализация
	ОпределитьУчастиеШаблонаВОтраженииЭДО(Форма);
// Локализация Конец

КонецПроцедуры

#КонецОбласти

// Локализация
#Область СлужебныеПроцедурыИФункции

// Устанавливает значение реквизита ШаблонУчаствуетВОтраженииДокументовЭДО
Процедура ОпределитьУчастиеШаблонаВОтраженииЭДО(Форма)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШаблоныДляСозданияДокументовПоВходящимЭДО.Шаблон КАК Шаблон
		|ИЗ
		|	РегистрСведений.ШаблоныДляСозданияДокументовПоВходящимЭДО КАК ШаблоныДляСозданияДокументовПоВходящимЭДО
		|ГДЕ
		|	ШаблоныДляСозданияДокументовПоВходящимЭДО.Шаблон = &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон", Форма.Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Форма.ШаблонУчаствуетВОтраженииДокументовЭДО = Выборка.Следующий();
	
КонецПроцедуры

#КонецОбласти
// Локализация Конец