// @strict-types

#Область ПрограммныйИнтерфейс

// Обрабатывает нажатие на HTML поле "Обзор"
// Добавляет локальную специфику
// 
// Параметры:
//  НавигационнаяСсылкаПоля - Строка
//  Параметры - Структура
// 
// Возвращаемое значение:
//  Булево - нажатие обработано в этой функции, дальнейшая обработка не требуется
Функция ОбработатьНажатиеНаПолеОбзор(НавигационнаяСсылкаПоля, Параметры) Экспорт 

	НажатиеОбработано = Ложь;

// Локализация
	Если СтрНайти(НавигационнаяСсылкаПоля, "SPARK:NoInformation") > 0 Тогда
		
		СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(Параметры.ЭтаФорма, Параметры.Элемент, НавигационнаяСсылкаПоля, Истина);
		
		НажатиеОбработано = Истина;
		
	КонецЕсли;
// Локализация Конец

	Возврат НажатиеОбработано;

КонецФункции

#КонецОбласти
