Процедура ОчиститьВсеФоново(ДопРеквизит) Экспорт
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураДополнительныеРеквизиты.Ссылка) КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|ГДЕ
		|	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство");
	Запрос.УстановитьПараметр("Свойство", ДопРеквизит);
	Выб = Запрос.Выполнить().Выбрать();                             
	Выб.Следующий();
	КолЗаписей = Выб.Ссылка;
	ПроцентВыполнения = 0; 
	ПроцентВыполненияБыл = 0; 
	НомерЗаписи = 0;       
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 400
		|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|ГДЕ
		|	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство";
	Выб = Запрос.Выполнить().Выбрать();                             
	Пока Выб.Количество()>0 цикл
		Пока Выб.Следующий() цикл
			Элем = Выб.Ссылка.ПолучитьОбъект(); 
			Стр = Элем.ДополнительныеРеквизиты.Найти(ДопРеквизит,"Свойство");
			Если Стр <> Неопределено тогда
				Элем.ДополнительныеРеквизиты.Удалить(Стр);
			КонецЕсли; 
			Если Элем.Модифицированность() тогда
				Элем.Записать();
			КонецЕсли;
			НомерЗаписи = НомерЗаписи + 1;
			ПроцентВыполнения = Цел(100*НомерЗаписи/КолЗаписей);
			Если ПроцентВыполнения <> ПроцентВыполненияБыл тогда
				ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения);
	            ПроцентВыполненияБыл = ПроцентВыполнения;
			КонецЕсли;
		КонецЦикла;
		Выб = Запрос.Выполнить().Выбрать();
	КонецЦикла;
КонецПроцедуры