
#Область СлужебныеПроцедурыИФункции

// Проверяет состояние фонового задания по переданному идентификатору.
// 
// Параметры:
//  ИдентификаторЗадания - УникальныйИдентификатор - идентификатор фонового задания. 
//
// Возвращаемое значение:
//  Булево              - возвращает Истина, если задание успешно выполнено,
//                        Ложь - если выполняется. В иных случаях вызывается исключение.
// 
Функция ЗаданиеВыполнено(ИдентификаторЗадания) Экспорт
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

// Получает из временного хранилища подсчитанное количество подакцизных товаров и возвращает
// текст заголовка для поля облагается акцизом.
//
// Параметры:
//  Адрес - Строка - Адрес данных о количестве подакцизных товаров во временном хранилище.
//
// Возвращаемое значение:
//  Строка
//
Функция ЗаголовокПоляОблагаетсяАкцизом(Адрес) Экспорт
	
	КоличествоПодакцизныхТоваров = 0;
	
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		КоличествоПодакцизныхТоваров = ПолучитьИзВременногоХранилища(Адрес);
		УдалитьИзВременногоХранилища(Адрес);
	КонецЕсли;
	
	ЗаголовокПоля = УчетПодакцизныхТоваровКлиентСервер.ЗаголовокПоляОблагаетсяАкцизом(
		КоличествоПодакцизныхТоваров);
	
	Возврат ЗаголовокПоля;
	
КонецФункции

#КонецОбласти
