////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ СОДЕРЖИТ РЕАЛИЗАЦИЮ МЕХАНИКИ ПРОТОКОЛИРОВАНИЯ РАБОТЫ СОТРУДНИКОВ
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Делает запись в регистр сведений ПротоколРаботыСотрудников при прерывании бизнес процесса.
Процедура ЗаписатьПрерываниеБизнесПроцесса(ОбъектДанных) Экспорт   
	
	ПротоколированиеРаботыСотрудников.ЗаписатьПрерываниеБизнесПроцесса(ОбъектДанных);
	
КонецПроцедуры

// Возвращает значение константы ИспользоватьПротоколированиеРаботыСотрудников.
Функция ПолучитьИспользоватьПротоколированиеРаботыСотрудников() Экспорт
	
	Возврат ПротоколированиеРаботыСотрудников.ПолучитьИспользоватьПротоколированиеРаботыСотрудников();	
	
КонецФункции	

// Делает запись в регистр сведений ПротоколРаботыСотрудников при выполнении команды "Сохранить как" для файла.
Процедура ЗаписатьСохранитьКак(ОбъектДанных, ПолныйПуть) Экспорт    
	
	ПротоколированиеРаботыСотрудников.ЗаписатьСохранитьКак(ОбъектДанных, ПолныйПуть);
		
КонецПроцедуры

// Делает запись в регистр сведений ПротоколРаботыСотрудников при интерактивном изменении объекта.
Процедура ЗаписатьИзменение(ОбъектДанных, Описание = "") Экспорт
	
	ПротоколированиеРаботыСотрудников.ЗаписатьИзменение(ОбъектДанных, Описание);
	
КонецПроцедуры

// Делает запись в регистр сведений ПротоколРаботыСотрудников при импорте файлов.
Процедура ЗаписатьИмпортФайлов(ОбъектДанных, ПолноеИмя) Экспорт
	
	ПротоколированиеРаботыСотрудников.ЗаписатьИмпортФайлов(ОбъектДанных, ПолноеИмя);
		
КонецПроцедуры

#КонецОбласти