#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить все настройки
// 
// Возвращаемое значение:
//  Структура
//
Функция ВсеНастройки() Экспорт    
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиВнешнегоВидаШтампаЭП.ИмяПоля КАК ИмяПоля,
	               |	НастройкиВнешнегоВидаШтампаЭП.ЗначениеПоля КАК ЗначениеПоля
	               |ИЗ
	               |	РегистрСведений.НастройкиВнешнегоВидаШтампаЭП КАК НастройкиВнешнегоВидаШтампаЭП";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Результат.Вставить(Выборка.ИмяПоля, Выборка.ЗначениеПоля);	
		
	КонецЦикла;	     
	
	Если Результат.Количество() <> 0 Тогда
	
		// Пустые поля - в конец.
		МассивПолей = Новый Массив;
		Если Результат.Свойство("Поле1") И ЗначениеЗаполнено(Результат.Поле1) Тогда
			МассивПолей.Добавить(Результат.Поле1);
		КонецЕсли;	
		Если Результат.Свойство("Поле2") И ЗначениеЗаполнено(Результат.Поле2) Тогда
			МассивПолей.Добавить(Результат.Поле2);
		КонецЕсли;	
		Если Результат.Свойство("Поле3") И ЗначениеЗаполнено(Результат.Поле3) Тогда
			МассивПолей.Добавить(Результат.Поле3);
		КонецЕсли;	
		Если Результат.Свойство("Поле4") И ЗначениеЗаполнено(Результат.Поле4) Тогда
			МассивПолей.Добавить(Результат.Поле4);
		КонецЕсли;	
		Если Результат.Свойство("Поле5") И ЗначениеЗаполнено(Результат.Поле5) Тогда
			МассивПолей.Добавить(Результат.Поле5);
		КонецЕсли;	
		Если Результат.Свойство("Поле6") И ЗначениеЗаполнено(Результат.Поле6) Тогда
			МассивПолей.Добавить(Результат.Поле6);
		КонецЕсли;	
		Если Результат.Свойство("Поле7") И ЗначениеЗаполнено(Результат.Поле7) Тогда
			МассивПолей.Добавить(Результат.Поле7);
		КонецЕсли;	
		
		Пока МассивПолей.Количество() < 7 Цикл
			МассивПолей.Добавить("");
		КонецЦикла; 
		
		Результат.Вставить("Поле1", МассивПолей[0]);
		Результат.Вставить("Поле2", МассивПолей[1]);
		Результат.Вставить("Поле3", МассивПолей[2]);
		Результат.Вставить("Поле4", МассивПолей[3]);
		Результат.Вставить("Поле5", МассивПолей[4]);
		Результат.Вставить("Поле6", МассивПолей[5]);
		Результат.Вставить("Поле7", МассивПолей[6]);
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Записать все настройки
//
// Параметры
// ВсеНастройки = Структура
// 
Процедура ЗаписатьВсеНастройки(ВсеНастройки) Экспорт   
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.НастройкиВнешнегоВидаШтампаЭП.СоздатьНаборЗаписей();
	
	Для Каждого ИмяИЗначение Из ВсеНастройки Цикл
	
		Запись = НаборЗаписей.Добавить();
		Запись.ИмяПоля = ИмяИЗначение.Ключ;    
		Запись.ЗначениеПоля = ИмяИЗначение.Значение;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли