
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если Не Параметры.Свойство("ОбъектыНазначения")
	//Тогда
	//	Возврат;
	//КонецЕсли;
	//Элементы.ЗаказНаПроизводство.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭтапыНаСервере()
	Распоряжения = Новый Массив;
	Распоряжения.Добавить( Объект.ЗаказНаПроизводство );
	Структ = Новый Структура;
	Структ.Вставить("Распоряжения", Распоряжения);
	
	Обработки.НастроитьЭтапыПослеСоздания.ВыполнитьНастройкуЭтапов( Структ );
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭтапы(Команда)
	НастроитьЭтапыНаСервере();
КонецПроцедуры

