&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("СписокНайденного") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого НайденноеЗначение Из Параметры.СписокНайденного Цикл
		НоваяСтрока = ТаблицаРезультатов.Добавить();
		НоваяСтрока.Ключ = НайденноеЗначение.Ключ;
		НоваяСтрока.Тип = НайденноеЗначение.ПредставлениеОбъекта;
		НоваяСтрока.ИмяСправочника = НайденноеЗначение.Метаданные;
	КонецЦикла;
	
	ТаблицаРезультатов.Сортировать("Тип Возр");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРезультатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Ключ);
	
КонецПроцедуры
