
#Область ПрограммныйИнтерфейс

#Область ФормаЭлемента

// Вызывается из "ПриОткрытии" формы элемента справочника Организации
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
Процедура ПриОткрытии_ФормаЭлемента(Форма, Отказ) Экспорт
// Локализация
// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыПриОткрытии = ОбменСКонтрагентамиКлиент.ПараметрыПриОткрытии();
	ПараметрыПриОткрытии.Форма                            = Форма;
	ПараметрыПриОткрытии.МестоРазмещенияКоманд            = Форма.Элементы.КомандыЭДО;
	ПараметрыПриОткрытии.ЕстьОбработчикОбновитьКомандыЭДО = Истина;
	
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ПараметрыПриОткрытии);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
// Локализация Конец
КонецПроцедуры

// Вызывается из "ОбработкаОповещения" формы элемента справочника Организации
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ИмяСобытия - Строка
//  Параметр - Произвольный
//  Источник - Произвольный
Процедура ОбработкаОповещения_ФормаЭлемента(Форма, ИмяСобытия, Параметр, Источник) Экспорт
// Локализация

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		ПараметрыОповещенияЭДО = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаСправочника();
		ПараметрыОповещенияЭДО.Форма                            = Форма;
		ПараметрыОповещенияЭДО.МестоРазмещенияКоманд            = Форма.Элементы.КомандыЭДО;
		ПараметрыОповещенияЭДО.ЕстьОбработчикОбновитьКомандыЭДО = Истина;

		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаСправочника(ИмяСобытия, Параметр, Источник, ПараметрыОповещенияЭДО);
		// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

// Локализация Конец
КонецПроцедуры

#КонецОбласти

#Область ФормаСписка

// Вызывается из "ПриОткрытии" формы списка справочника Контрагенты
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
Процедура ПриОткрытии_ФормаСписка(Форма, Отказ) Экспорт
// Локализация

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПриОткрытии(Форма);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

// Локализация Конец
КонецПроцедуры

// Вызывается из "ОбработкаОповещения" формы списка справочника Контрагенты
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ИмяСобытия - Строка
//  Параметр - Произвольный
//  Источник - Произвольный
Процедура ОбработкаОповещения_ФормаСписка(Форма, ИмяСобытия, Параметр, Источник) Экспорт
// Локализация

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыОповещенияЭДО = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаСписка();
	ПараметрыОповещенияЭДО.Форма = Форма;
	ПараметрыОповещенияЭДО.ИмяДинамическогоСписка = "Список";
	ПараметрыОповещенияЭДО.МестоРазмещенияКоманд = Форма.Элементы.КомандыЭДО;
	ПараметрыОповещенияЭДО.ЕстьОбработчикОбновитьКомандыЭДО = Истина;

	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаСписка(ИмяСобытия, Параметр, Источник, ПараметрыОповещенияЭДО);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

// Локализация Конец
КонецПроцедуры

#КонецОбласти

#КонецОбласти
