////////////////////////////////////////////////////////////////////////////////
// Подсистема "Физические лица"
#Область ПрограммныйИнтерфейс

// Формирует фамилию и инициалы либо по наименованию элемента справочника ФизическиеЛица,
// либо по переданным строкам.
// Если передан Объект, то извлеченная из него строка считается совокупностью 
// Фамилия + Имя + Отчество, разделенными пробелами.
//
// Параметры
//  ОбъектИлиСтрока - строка, ссылка или объект элемента справочника ФизическиеЛица.
//  Фамилия		    - фамилия физического лица.
//  Имя		        - имя физического лица.
//  Отчество	    - отчество физического лица.
//  СуффиксЯзыка - Строка
//
// Возвращаемое значение 
//  Строка - фамилия и инициалы одной строкой. 
//  В параметрах Фамилия, Имя и Отчество записываются вычисленные части.
//
// Пример:
//  Результат = ФамилияИнициалыФизЛица("Иванов Иван Иванович"); // Результат = "Иванов И. И."
//
Функция ФамилияИнициалыФизЛица(ОбъектИлиСтрока = "", Фамилия = " ", Имя = " ", Отчество = " ", СуффиксЯзыка = "") Экспорт

	ТипОбъекта = ТипЗнч(ОбъектИлиСтрока);
	Если ТипОбъекта = Тип("Строка") Тогда
		ФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(ОбъектИлиСтрока), " ");
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ФизическиеЛица") Или ТипОбъекта = Тип("СправочникОбъект.ФизическиеЛица") Тогда
		ПредставлениеФИО = Справочники.ФизическиеЛица.ПредставлениеФизЛицаСУчетомЯзыка(ОбъектИлиСтрока, СуффиксЯзыка);
		ФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(ПредставлениеФИО), " ");
	Иначе
		// используем возможно переданные отдельные строки
		Возврат ?(Не ПустаяСтрока(Фамилия), 
		          Фамилия + ?(Не ПустаяСтрока(Имя), " " + Лев(Имя,1) + "." + ?(Не ПустаяСтрока(Отчество), Лев(Отчество,1) + ".", ""), ""),
		          "")
	КонецЕсли;
	
	КоличествоПодстрок = ФИО.Количество();
	Фамилия            = ?(КоличествоПодстрок > 0, ФИО[0], "");
	Имя                = ?(КоличествоПодстрок > 1, ФИО[1], "");
	Отчество           = ?(КоличествоПодстрок > 2, ФИО[2], "");
	
	Возврат ?(Не ПустаяСтрока(Фамилия), 
	          Фамилия + ?(Не ПустаяСтрока(Имя), " " + Лев(Имя,1) + "." + ?(Не ПустаяСтрока(Отчество), Лев(Отчество, 1) + ".", ""), ""),
	          "");
	
КонецФункции

// Функция склоняет переданную фразу
// Параметры:
//  ФИО (обязательный), тип строка
//   Параметр должен содержать фамилию имя отчества в именительном падеже, которые необходимо просклонять.
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
//  Результат (обязательный), тип строка
//   Переменная, в которую будет возвращен результат склонения.
//
//  Пол (необязательный), тип Перечисление.ПолФизическогоЛица
//   Пол физического лица
//
Функция Просклонять(Знач ФИО, Падеж, Результат, Пол = Неопределено) Экспорт
	
	Возврат ФизическиеЛицаЛокализация.Просклонять(ФИО, Падеж, Результат, Пол = Неопределено);
	
КонецФункции

// Функция - Описание нового ФИО
// 
// Возвращаемое значение:
//  Структура:
//   * ФИО - Строка
//   * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//   * ИменительныйПадеж - Строка
//   * РодительныйПадеж - Строка
//   * ВинительныйПадеж - Строка
//   * ДательныйПадеж - Строка
//   * ТворительныйПадеж - Строка
//   * ПредложныйПадеж - Строка
//   * ФИОВОбъекте - Строка
//
Функция НовоеОписаниеПриСменеФИО() Экспорт
	
	Возврат ФизическиеЛицаЛокализация.НовоеОписаниеПриСменеФИО();
	
КонецФункции

// Обновляет наименования и склонения физ. лиц, сотрудников и пользователей по актуальному ФИО физ. лица
//
// Параметры:
//  ФизЛицо - СправочникСсылка.ФизическиеЛица
//
Процедура ОбновитьНаименованиеИСклоненияФизЛица(ФизЛицо) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФИОФизическихЛицСрезПоследних.ФИО КАК ФИО,
		|	ФИОФизическихЛицСрезПоследних.ФИОЯзык1 КАК ФИОЯзык1,
		|	ФИОФизическихЛицСрезПоследних.ФИОЯзык2 КАК ФИОЯзык2
		|ПОМЕСТИТЬ ФИОФизическихЛицСрезПоследних
		|ИЗ
		|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ТекущаяДата, ФизическоеЛицо = &ФизЛицо) КАК
		|		ФИОФизическихЛицСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФИОФизическихЛицСрезПоследних.ФИО КАК ФИО,
		|	ФизическиеЛица.Наименование КАК ФИОВОбъекте,
		|	ФИОФизическихЛицСрезПоследних.ФИО <> ФизическиеЛица.Наименование
		|	ИЛИ ФИОФизическихЛицСрезПоследних.ФИОЯзык1 <> ФизическиеЛица.НаименованиеЯзык1
		|	ИЛИ ФИОФизическихЛицСрезПоследних.ФИОЯзык2 <> ФизическиеЛица.НаименованиеЯзык2 КАК ИзменилосьФИО,
		|	ФИОФизическихЛицСрезПоследних.ФИОЯзык1 КАК ФИОЯзык1,
		|	ФИОФизическихЛицСрезПоследних.ФИОЯзык2 КАК ФИОЯзык2
		|ИЗ
		|	ФИОФизическихЛицСрезПоследних КАК ФИОФизическихЛицСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО ФИОФизическихЛицСрезПоследних.ФизическоеЛицо = ФизическиеЛица.Ссылка";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаАктуальногоФИОИСклонений = РезультатЗапроса.Выгрузить();
	Если ТаблицаАктуальногоФИОИСклонений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	АктуальныеФИО = ТаблицаАктуальногоФИОИСклонений[0];
	
	НовоеФИО = АктуальныеФИО.ФИО;
	ИзменилосьФИО = АктуальныеФИО.ИзменилосьФИО;
	Если ИзменилосьФИО Тогда
		
		НачатьТранзакцию();
		Попытка
			ТекущееФизЛицо = АктуальныеФИО.ФизическоеЛицо;
			
			Блокировка = Новый БлокировкаДанных;
				
			ПользовательФизЛица = ПользователиДокументооборот.ПользовательФизЛица(ФизЛицо);
			
			Если ЗначениеЗаполнено(ПользовательФизЛица) Тогда
				ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.Пользователи.ПолноеИмя());
				ЭлементБлокировки.УстановитьЗначение("Ссылка", ПользовательФизЛица);
			КонецЕсли;
			
			ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.ФизическиеЛица.ПолноеИмя());
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ТекущееФизЛицо);
			
			ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.ФИОФизическихЛиц.ПолноеИмя());
			ЭлементБлокировки.УстановитьЗначение("ФизическоеЛицо", ТекущееФизЛицо); 
			Блокировка.Заблокировать();
			
				
			// Обновляем объект физ. лица. С ним обновляются и сотрудники
			ОбъектФизЛица = ТекущееФизЛицо.ПолучитьОбъект();
			ОбъектФизЛица.Наименование = НовоеФИО;
			ОбъектФизЛица.НаименованиеЯзык1 = АктуальныеФИО.ФИОЯзык1;
			ОбъектФизЛица.НаименованиеЯзык2 = АктуальныеФИО.ФИОЯзык2;
			ОбъектФизЛица.ДополнительныеСвойства.Вставить("НеСоздаватьЗаписьОбИстории", Истина);
			ОбъектФизЛица.Записать();
			
			// Обновляем пользователя
			Если ЗначениеЗаполнено(ПользовательФизЛица) Тогда
				ПользовательОбъект = ПользовательФизЛица.ПолучитьОбъект();
				ПользовательОбъект.Наименование = НовоеФИО;
				ПользовательОбъект.Записать();
			КонецЕсли;
			
			ФизическиеЛицаЛокализация.ОбновитьСклоненияФизЛица(ФизЛицо);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru='К сожалению, произошла ошибка'") + Символы.ПС
				+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает Истина, если это физ. лицо связано с сотрудникома
//
// Параметры:
//  ФизЛицо - СправочникСсылка.Сотрудники
// 
// Возвращаемое значение:
//  Булево
//
Функция ЭтоФизЛицоСотрудника(ФизЛицо) Экспорт
	
	Возврат Сотрудники.ВсеСотрудникиФизЛица(ФизЛицо).Количество() > 0;
	
КонецФункции

// Возвращает склонения ФИО физ. лица
//
// Параметры:
//  ФизЛицо - СправочникСсылка.Сотрудники
// 
// Возвращаемое значение:
//  Структура:
// * Именительный - ОпределяемыйТип.ФИО
// * Родительный - ОпределяемыйТип.ФИО
// * Дательный - ОпределяемыйТип.ФИО
// * Винительный - ОпределяемыйТип.ФИО
// * Творительный - ОпределяемыйТип.ФИО
// * Предложный - ОпределяемыйТип.ФИО
//
Функция СклоненияАктуальногоФИОФизЛица(ФизЛицо) Экспорт
	
	СтруктураПадежей = Новый Структура;
	СтруктураПадежей.Вставить("Именительный", "");
	СтруктураПадежей.Вставить("Родительный", "");
	СтруктураПадежей.Вставить("Дательный", "");
	СтруктураПадежей.Вставить("Винительный", "");
	СтруктураПадежей.Вставить("Творительный", "");
	СтруктураПадежей.Вставить("Предложный", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФИОФизическихЛицСрезПоследних.ИменительныйПадеж КАК Именительный,
		|	ФИОФизическихЛицСрезПоследних.ДательныйПадеж КАК Дательный,
		|	ФИОФизическихЛицСрезПоследних.ВинительныйПадеж КАК Винительный,
		|	ФИОФизическихЛицСрезПоследних.ПредложныйПадеж КАК Предложный,
		|	ФИОФизическихЛицСрезПоследних.РодительныйПадеж КАК Родительный,
		|	ФИОФизическихЛицСрезПоследних.ТворительныйПадеж КАК Творительный
		|ИЗ
		|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(, ФизическоеЛицо = &ФизЛицо) КАК ФИОФизическихЛицСрезПоследних";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураПадежей, Выборка);
		
	КонецЕсли;
	
	Возврат СтруктураПадежей;
	
КонецФункции

// Функция - Фамилия инициалы физ лица на дату
//
// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//  Дата - Дата
// 
// Возвращаемое значение:
//  Строка
//
Функция ФамилияИнициалыФизЛицаНаДату(ФизическоеЛицо, Дата) Экспорт
	
	Возврат ФамилияИнициалыФизЛица(РегистрыСведений.ФИОФизическихЛиц.ФИОФизЛицаНаДату(ФизическоеЛицо, Дата));
	
КонецФункции

// Возвращает 1, если мужской пол, 2 - если женский, иначе - Неопределено
//
// Параметры:
//  ПолФизЛица - ПеречислениеСсылка.ПолФизическогоЛица
// 
// Возвращаемое значение:
//  Число, Неопределено
//
Функция ПолЦифрой(ПолФизЛица) Экспорт
	
	ПолЦифрой = 0;
	Если ПолФизЛица = Перечисления.ПолФизическогоЛица.Мужской Тогда
		ПолЦифрой = 1;
	ИначеЕсли ПолФизЛица = Перечисления.ПолФизическогоЛица.Женский Тогда
		ПолЦифрой = 2;
	ИначеЕсли Не ЗначениеЗаполнено(ПолФизЛица) Тогда
		ПолЦифрой = Неопределено;
	Иначе
		ВызватьИсключение НСтр("ru='Некорректное значение пола'");
	КонецЕсли;
	
	Возврат ПолЦифрой;
		
КонецФункции

// Возвращает Ложь, если можно менять данные ФИО физ. лица, иначе - Истина
//
// Параметры:
//  ФизЛицо -СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  Булево
//
Функция НельзяИзменитьФИОФизЛицу(ФизЛицо) Экспорт
	
	ПерсональныеДанныеУничтожены = РегистрыСведений.УничтоженныеПерсональныеДанные.
		ЕстьСубъектыСУничтоженнымиПерсональнымиДанными(ФизЛицо);
	
	Если ПерсональныеДанныеУничтожены Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ЭтоФизЛицоСотрудника = ЭтоФизЛицоСотрудника(ФизЛицо);
	
	Возврат ЭтоФизЛицоСотрудника;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограмныйИнтерфейс

// См. описание этой же процедуры в модуле СтандартныеПодсистемыСервер.
Процедура ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики) Экспорт
	
	// СЕРВЕРНЫЕ ОБРАБОТЧИКИ.
	
	СерверныеОбработчики["СтандартныеПодсистемы.ОбновлениеВерсииИБ\ПриДобавленииОбработчиковОбновления"].Добавить(
		"ФизическиеЛица");
	
	СерверныеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииИсключенийПоискаСсылок"].Добавить(
		"ФизическиеЛица");
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обработчики служебных событий подсистем БСП
// 
// Заполняет массив списком имен объектов метаданных, данные которых могут содержать ссылки на различные объекты метаданных,
// но при этом эти ссылки не должны учитываться в бизнес-логике приложения.
//
// Параметры:
//  Массив       - массив строк, например, "РегистрСведений.ВерсииОбъектов".
//
Процедура ПриДобавленииИсключенийПоискаСсылок(Массив) Экспорт
	
	Массив.Добавить(Метаданные.РегистрыСведений.ДокументыФизическихЛиц.ПолноеИмя());
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы
// Добавляет процедуры-обработчики обновления, необходимые данной подсистеме.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                  общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	ФизическиеЛицаЛокализация.ПриДобавленииОбработчиковОбновления(Обработчики);
	
КонецПроцедуры

#КонецОбласти