#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет, что ключ реестра это пользователь.
// 
// Параметры:
//  ТипРеестра - ПеречислениеСсылка.ТипыРеестров
// 
// Возвращаемое значение:
//  Булево
// 
Функция КлючРеестраЭтоПользователь(ТипРеестра) Экспорт
	
	КлючРеестраЭтоПользователь =
		ТипРеестра = ЗадачиМне
		Или ТипРеестра = ЗадачиОтМеня
		Или ТипРеестра = ЗадачиПодчиненных
		Или ТипРеестра = ЗадачиПоПроектам;
	
	Возврат КлючРеестраЭтоПользователь;
	
КонецФункции

#КонецОбласти

#КонецЕсли