//в версии 2.5.7.288 вроде исправили, пока закомментирую
//&ИзменениеИКонтроль("ИсправитьОшибкиОтраженияДокументовВРеестре")
//Процедура Расш1_ИсправитьОшибкиОтраженияДокументовВРеестре(Параметры, АдресВременногоХранилища)

//	Если Не ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, "РегистрСведений.РеестрДокументов") Тогда
//		ТекстИсключения = НСтр("ru = 'По реестру документов есть невыполненные обработчики обновления. Перед запуском процедуры необходимо дождаться окончания их выполнения.';
//		|en = 'There are incomplete update handlers in the document registry. Before run the procedure, you need to wait until the end of their execution.'");
//		ВызватьИсключение ТекстИсключения;
//	КонецЕсли;

//	Типы = Метаданные.РегистрыСведений.РеестрДокументов.Измерения.Ссылка.Тип.Типы();
//	ЕстьОшибки = Ложь;

//	Для каждого ТипДокумента Из Типы Цикл

//		ПолноеИмяДокумента = Метаданные.НайтиПоТипу(ТипДокумента).ПолноеИмя();

//		НеиспользуемыеПоля = Новый Массив;
//		НеиспользуемыеПоля.Добавить("Дополнительно");
//		НеиспользуемыеПоля.Добавить("РазделительЗаписи");
//		НеиспользуемыеПоля.Добавить("НомерПервичногоДокумента");

//		УстановитьПривилегированныйРежим(Истина);

//		ИмяДокумента = СтрРазделить(ПолноеИмяДокумента, ".")[1];
//		РезультатАдаптацииЗапроса = Документы[ИмяДокумента].АдаптированныйТекстЗапросаДвиженийПоРегистру("РеестрДокументов");
//		Регистраторы = ОбновлениеИнформационнойБазыУТ.ДанныеНезависимогоРегистраДляПерепроведения(
//		РезультатАдаптацииЗапроса, 
//		"РегистрСведений.РеестрДокументов", 
//		ПолноеИмяДокумента, 
//		НеиспользуемыеПоля);

//#Удаление
//		Для Каждого Регистратор из Регистраторы Цикл
//#КонецУдаления
//#Вставка
//		Для Каждого Стр из Регистраторы Цикл
//#КонецВставки

//			Отказ = Ложь;

//			Попытка
//#Вставка
//				Регистратор = Стр.Ссылка;
//#КонецВставки
//				ТаблицыДанных = ПроведениеДокументов.ДанныеДокументаДляПроведения(Регистратор, "РеестрДокументов");
//				РегистрыСведений.РеестрДокументов.ЗаписатьДанные(ТаблицыДанных, Регистратор, Отказ);
//				Если Отказ Тогда
//					ЕстьОшибки = Истина;
//				КонецЕсли;
//			Исключение
//				ЕстьОшибки = Истина;
//				ЗаписьЖурналаРегистрации(НСтр("ru = 'Переотражение документов в реестре документов';
//				|en = 'Re-recording documents in documents register'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
//				УровеньЖурналаРегистрации.Ошибка,
//				Метаданные.РегистрыСведений.РеестрДокументов,
//				Регистратор,
//				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
//			КонецПопытки;;

//		КонецЦикла;					

//		УстановитьПривилегированныйРежим(Ложь);

//	КонецЦикла;

//	Если ЕстьОшибки Тогда
//		Результат = РезультатФоновыхЗаданий();
//		Результат.ЕстьДокументыКПереотражениюВРеестре = "Ошибка";
//		ПоместитьВоВременноеХранилище(Результат, АдресВременногоХранилища);
//	Иначе
//		ПроверитьНеобходимостьПереотраженияДокументовВРеестре(Параметры, АдресВременногоХранилища);
//	КонецЕсли;

//КонецПроцедуры
