
#Область ПрограммныйИнтерфейс

// Формирует имя группы "Все".
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяВсеГруппы() Экспорт
	
	Возврат "Все";
	
КонецФункции

// Формирует имя группы "БезГруппы".
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяБезГруппы() Экспорт
	
	Возврат "БезГруппы";
	
КонецФункции

// Вставляет в дерево групп две специальные группы: "Все" и "БезГруппы".
// 
// Параметры:
//  ЭлементыДерева - ДанныеФормыКоллекцияЭлементовДерева
//
Процедура ДобавитьСпециальныеГруппы(ЭлементыДерева) Экспорт
	
	СтрокаДерева = ЭлементыДерева.Вставить(0);
	СтрокаДерева.ИндексПиктограммы = -1;
	СтрокаДерева.ГруппаКонтрагентов = ИмяВсеГруппы();
	СтрокаДерева.ПредставлениеГруппы = НСтр("ru='<Все группы>'");
	
	СтрокаДерева = ЭлементыДерева.Добавить();
	СтрокаДерева.ИндексПиктограммы = -1;
	СтрокаДерева.ГруппаКонтрагентов = ИмяБезГруппы();
	СтрокаДерева.ПредставлениеГруппы = НСтр("ru='<Группа не указана>'");
	
КонецПроцедуры

// Идентификатор строки дерева по значению.
// 
// Параметры:
//  Коллекция - ДанныеФормыДерево
//  ИскомоеЗначение - СправочникСсылка.Контрагенты
// 
// Возвращаемое значение:
//  Число
//
Функция ИдентификаторСтрокиДереваПоЗначению(Коллекция, ИскомоеЗначение) Экспорт
	
	КоллекцияЭлементов = Коллекция.ПолучитьЭлементы();
	
	Для Каждого Элемент Из КоллекцияЭлементов Цикл
		
		Если Элемент.ГруппаКонтрагентов = ИскомоеЗначение Тогда
			Возврат Элемент.ПолучитьИдентификатор();
		КонецЕсли;
		
		Идентификатор = ИдентификаторСтрокиДереваПоЗначению(Элемент, ИскомоеЗначение);
		
		Если Идентификатор <> Неопределено Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти
