
#Область ПрограммныйИнтерфейс

// Вызывается из "ПриОткрытии" формы ШаблонДокумента справочника ШаблоныДокументов 
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
Процедура ПриОткрытииШаблонДокумента(Форма, Отказ) Экспорт

// Локализация
	ВидДокументаКэш = Форма.ВидДокументаКэш;
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;

	Если ВидДокументаКэш.ЯвляетсяОбращениемОтГраждан Тогда	
		ДоступенКонтрагент = Объект.ВидОбращения <> ПредопределенноеЗначение("Перечисление.ВидыОбращенийГраждан.Анонимное"); 
		Элементы.Контрагент.Доступность = ДоступенКонтрагент;
		Элементы.КонтактноеЛицо.Доступность = ДоступенКонтрагент;
	КонецЕсли;
// Локализация Конец

КонецПроцедуры

// Форма документа обработка выбора форма элемента.
// 
// Параметры:
//  Элемент - ПолеФормы - Элемент
//  ВыбранноеЗначение - Произвольный - Выбранное значение
//  ДополнительныеДанные - Произвольный - Дополнительные данные
//  СтандартнаяОбработка - Булево - Стандартная обработка
//  Форма - ФормаКлиентскогоПриложения
Процедура ФормаДокументаОбработкаВыбора_ФормаЭлемента(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка, Форма) Экспорт

// Локализация
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВариантыФормДокументов.Бумажная")
		И Форма.ШаблонУчаствуетВОтраженииДокументовЭДО Тогда
		
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = 
			НСтр("ru='Нельзя изменить форму на бумажную, так как этот шаблон используется при отражении документов ЭДО'");
		
		ПредупреждениеАсинх(ТекстСообщения);
		
	КонецЕсли;
// Локализация Конец

КонецПроцедуры

#КонецОбласти
