&НаСервере
Перем ЕдИзмМин, ЕдИзмЧас;

&НаСервере
Процедура ПолучитьЕдИзм()
	Если не ЗначениеЗаполнено(ЕдИзмМин) тогда
		ЕдИзмМин = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("мин", Истина);
	КонецЕсли;
	Если не ЗначениеЗаполнено(ЕдИзмЧас) тогда
		ЕдИзмЧас = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("ч", Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьТрудозатраты()
	//ПолучитьЕдИзм();
	//Для каждого Стр из Объект.Трудозатраты цикл
	//	Стр.ЕдиницаИзмерения = Стр.ВидРабот.ЕдиницаИзмерения;
	//	Если Стр.ЕдиницаИзмерения = ЕдИзмЧас тогда
	//		Стр.ЕдиницаИзмерения = ЕдИзмМин;
	//		Стр.Количество60 = Стр.Количество*60;
	//	Иначе
	//		Стр.Количество60 = Стр.Количество;
	//	КонецЕсли;
	//КонецЦикла
КонецПроцедуры

&НаСервере
Процедура Расш1_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	//ОбновитьТрудозатраты();
КонецПроцедуры              

&НаСервере
Процедура Расш1_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	//ОбновитьТрудозатраты(); 
	ЭТП.ПроверитьЗацикливаниеСпецификаций(Ложь);
КонецПроцедуры

&НаСервере
Функция ЕдИзмДляВидаРабот(знач ВидРабот)
	ПолучитьЕдИзм();
	ЕдИзм = ВидРабот.ЕдиницаИзмерения;
	Если ЕдИзм = ЕдИзмЧас тогда
		ЕдИзм = ЕдИзмМин;
	КонецЕсли;
	Возврат ЕдИзм;
КонецФункции

&НаСервере
Процедура ПоправитьДанные(знач ВидРабот, знач Количество60, ЕдИзм, Количество)
	ПолучитьЕдИзм();
	ЕдИзм = ВидРабот.ЕдиницаИзмерения;
	Если ЕдИзм = ЕдИзмЧас тогда
		ЕдИзм = ЕдИзмМин;
		Количество = Количество60 /60;
	Иначе
		Количество = Количество60;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ТрудозатратыВидРаботПриИзмененииПосле(Элемент)
	//ТекДанные = Элементы.Трудозатраты.ТекущиеДанные;
	//ПоправитьДанные(ТекДанные.ВидРабот, ТекДанные.Количество60, ТекДанные.ЕдиницаИзмерения, ТекДанные.Количество);	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ТрудозатратыКоличествоПриИзмененииПосле(Элемент)
	//ТекДанные = Элементы.Трудозатраты.ТекущиеДанные;
	//ПоправитьДанные(ТекДанные.ВидРабот, ТекДанные.Количество60, ТекДанные.ЕдиницаИзмерения, ТекДанные.Количество);	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Трудозатраты_ВставитьСтрокиПосле(Команда)
	//ОбновитьТрудозатраты();
КонецПроцедуры
