// @strict-types


#Область ПрограммныйИнтерфейс

// Берёт ознакомление в работу.
// Вызывается из ВзятьВРаботу модуля менеджера регистра сведедений УчастникиОзнакомления
//
// Параметры:
//  Действие - СправочникСсылка.ДействияОзнакомления.
//  Исполнитель - СправочникСсылка.ПолныеРоли.
//  Участник - СправочникСсылка.Сотрудники.
//
Процедура ВзятьВРаботу(Действие, Исполнитель, Участник) Экспорт

// Локализация
	РаботаСВнешнимПодписанием.ОбработатьВзятиеЗадачиВРаботу(Действие, Исполнитель, Участник, Ложь);
// Локализация Конец
	
КонецПроцедуры

// Вызывается из ОтменитьВзятиеВРаботу модуля менеджера регистра сведедений УчастникиОзнакомления
//
// Параметры:
//  Действие - СправочникСсылка.ДействияОзнакомления.
//  СтарыйИсполнитель - СправочникСсылка.ПолныеРоли.
//  Участник - СправочникСсылка.Сотрудники.
//
Процедура ОтменитьВзятиеВРаботу(Действие, СтарыйИсполнитель, Участник) Экспорт

// Локализация			
	РаботаСВнешнимПодписанием.ОбработатьВзятиеЗадачиВРаботу(Действие, СтарыйИсполнитель, Участник, Истина);
// Локализация Конец	

КонецПроцедуры

#КонецОбласти