#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Перечень рабочих статусов производственной операции
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СтатусыПроизводственныхОпераций
Функция Рабочие() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Перечисления.СтатусыПроизводственныхОпераций.Создана);
	Результат.Добавить(Перечисления.СтатусыПроизводственныхОпераций.Выполняется);
	Результат.Добавить(Перечисления.СтатусыПроизводственныхОпераций.Выполнена);
	Результат.Добавить(Перечисления.СтатусыПроизводственныхОпераций.НеВыполнена);
	Результат.Добавить(Перечисления.СтатусыПроизводственныхОпераций.Пропущена);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
