
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновленоСостояниеЭДДО" Тогда
		ОбновитьСписки();
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		ОбновитьСписки();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийСписков

&НаКлиенте
Процедура СписокВходящихВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокВходящих.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуОшибки(ТекущиеДанные.ПредметОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИсходящихВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокИсходящих.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуОшибки(ТекущиеДанные.ПредметОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыОшибки(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьСписки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСписки()
	
	Элементы.СписокВходящих.Обновить();
	Элементы.СписокИсходящих.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОшибки(ПредметОшибки)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ПредметОшибки", ПредметОшибки);
	
	ОткрытьФорму("РегистрСведений.ОшибкиЭДОКИсправлению.Форма.ФормаЗаписи",
		ПараметрыОткрытия,
		ЭтаФорма, , , ,
		Новый ОписаниеОповещения("ПослеЗакрытияФормыОшибки", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти
