#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает статус потока
Процедура ЗаписатьСтатус(ПорядокДоставки, Поток, ДатаНачала, ДатаПоследнейАктивности,
	Описание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.СостоянияФоновыхЗаданийПриемкиВнутреннейМаршрутизации.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Поток = Поток;
	МенеджерЗаписи.ПорядокДоставки = ПорядокДоставки;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Поток = Поток;
	МенеджерЗаписи.ПорядокДоставки = ПорядокДоставки;
	
	Если ДатаНачала <> Неопределено Тогда
		МенеджерЗаписи.ДатаНачала = ДатаНачала;
	КонецЕсли;	
	МенеджерЗаписи.ДатаПоследнейАктивности = ДатаПоследнейАктивности;
	МенеджерЗаписи.Описание = Описание;
	МенеджерЗаписи.НомерСеанса = НомерСеансаИнформационнойБазы();
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
