// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из ПринятьКИсполнениюЗадачуПроцессаБезусловно общего модуля БизнесПроцессыИЗадачиСервер
// Принимает к исполнению задачу процесса без условно, с учетом переданных параметров.
// Параметры:
//  ЗадачаПроцесса - ЗадачаСсылка.ЗадачаИсполнителя
//  ПараметрыПринятия - Структура:
//    * ДатаПринятияКИсполнению - Дата
//    * Исполнитель - СправочникСсылка.Сотрудники
//    * ОтключитьОбновлениеЗадач - Булево
//  Немедленно - Булево - признак немедленного принятия задачи процесса к исполнению.
//
Процедура ПринятьКИсполнениюЗадачуПроцессаБезусловно(ЗадачаПроцесса, ПараметрыПринятия, Немедленно = Ложь) Экспорт
// Локализация
	ЗадачаПроцессаОбъект = ЗадачаПроцесса.ПолучитьОбъект();
	РаботаСВнешнимПодписанием.ПриВзятииЗадачиВРаботу(ЗадачаПроцесса, ПараметрыПринятия.Исполнитель,
		ЗадачаПроцессаОбъект.РольИсполнителя, Ложь);
// Локализация Конец		
КонецПроцедуры	

// Вызывается из ОтменитьПринятиеЗадачиПроцессаКИсполнениюБезусловно общего модуля БизнесПроцессыИЗадачиСервер
// Отменяет принятие к исполнению задачи процесса без условно.
// Параметры:
//  ЗадачаПроцесса - ЗадачаСсылка.ЗадачаИсполнителя
//  ОтключитьОбновлениеЗадач - Булево
//  Немедленно - Булево - признак немедленного принятия задачи процесса к исполнению.
//  СтарыйИсполнитель - СправочникСсылка.Сотрудники, 
//  				  - СправочникСсылка.Пользователи, 
//  				  - СправочникСсылка.ПолныеРоли
//
Процедура ОтменитьПринятиеЗадачиПроцессаКИсполнениюБезусловно(ЗадачаПроцесса, ОтключитьОбновлениеЗадач, Немедленно = Ложь,
		 СтарыйИсполнитель) Экспорт
// Локализация	
	ЗадачаПроцессаОбъект = ЗадачаПроцесса.ПолучитьОбъект();
	РаботаСВнешнимПодписанием.ПриВзятииЗадачиВРаботу(ЗадачаПроцесса, СтарыйИсполнитель,
		ЗадачаПроцессаОбъект.РольИсполнителя, Истина);
// Локализация Конец	
КонецПроцедуры	

#КонецОбласти
