
#Область ПрограммныйИнтерфейс

// Вызывается из ЗаписатьКонстантыСервер формы ОбменДанными обработки НастройкиПрограммы
// Дополняет состав записываемых констант специфичными для национальной редакции
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ПриЗаписиНастроекОбменаДанными(Форма) Экспорт
// Локализация
	Если Форма.ИспользоватьМЭДО Тогда 
		Опции = МЭДОВызовСервера.ВыключенныеОпцииОтКоторыхЗависитМЭДО();
		Если Опции <> "" Тогда
			ТекстПредупреждения = СтрШаблон(
				НСтр("ru = 'Одновременно с опцией ""МЭДО"" автоматически включаются другие необходимые для МЭДО опции:
				|%1'"), Опции);
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецЕсли;
	КонецЕсли;
// Локализация Конец
КонецПроцедуры

#КонецОбласти
