#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.РасчетыПоФинансовымИнструментамНУ.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.25.32";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("51119c20-5762-5c1b-bdf7-3f0a1da45bec");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.РасчетыПоФинансовымИнструментамНУ.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	
	СписокОписаний = Новый Массив;
	СписокОписаний.Добавить(НСтр("ru = 'Обновление регистра ""Расчеты по финансовым инструментам (НУ)"":';
								|en = 'Update the ""Financial instruments AR/AP (TA)"" register:'"));
	СписокОписаний.Добавить(НСтр("ru = '- Поле ""Аналитика учета по партнерам"" очищается от направления деятельности';
								|en = '- The ""Accounting dimension by partners"" field is cleared of the line of business'"));
	
	Обработчик.Комментарий = СтрСоединить(СписокОписаний, Символы.ПС);
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыПоФинансовымИнструментамНУ.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.КлючиАналитикиУчетаПоПартнерам.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.РасчетыПоФинансовымИнструментамНУ.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыНакопления.РасчетыПоФинансовымИнструментамНУ.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = "РегистрНакопления.РасчетыПоФинансовымИнструментамНУ";
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистр.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментамНУ КАК Регистр
	|ГДЕ
	|	Регистр.АналитикаУчетаПоПартнерам.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|";
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор"), ПараметрыВыборки.ПолныеИменаРегистров);
	
КонецПроцедуры

// Обработчик обновления
// 
// Параметры:
// 	Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки 
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "РегистрНакопления.РасчетыПоФинансовымИнструментамНУ";
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена =
			ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ИсключенияПриОбновлении = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Ключи.Ссылка КАК НоваяАналитикаУчетаПоПартнерам,
		|	Расчеты.АналитикаУчетаПоПартнерам.Организация КАК Организация,
		|	Расчеты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
		|	Расчеты.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
		|	Расчеты.АналитикаУчетаПоПартнерам.Договор КАК Договор,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности
		|ИЗ
		|	РегистрНакопления.РасчетыПоФинансовымИнструментамНУ КАК Расчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК Ключи
		|			ПО Ключи.Организация = Расчеты.АналитикаУчетаПоПартнерам.Организация
		|			И Ключи.Партнер = Расчеты.АналитикаУчетаПоПартнерам.Партнер
		|			И Ключи.Контрагент = Расчеты.АналитикаУчетаПоПартнерам.Контрагент
		|			И Ключи.Договор = Расчеты.АналитикаУчетаПоПартнерам.Договор
		|			И Ключи.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|ГДЕ
		|	Расчеты.Регистратор = &Ссылка
		|";
		
	// Ключ старая аналитика, значение - новая
	Соответствие = Новый Соответствие();
	
	Для Каждого СтрокаДанных Из ОбновляемыеДанные Цикл
		
		ПричинаИсключения = "";
		Рекомендация = "";
		
		НачатьТранзакцию();
		Попытка
			
			ПричинаИсключения = "Блокировка"; 
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыПоФинансовымИнструментамНУ.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", СтрокаДанных.Регистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			ПричинаИсключения = "ПлохиеДанные";
			Рекомендация = НСтр("ru = 'Перепроведите документ вручную.';
								|en = 'Repost the document manually.'");
			
			НаборЗаписей = РегистрыНакопления.РасчетыПоФинансовымИнструментамНУ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(СтрокаДанных.Регистратор);
			НаборЗаписей.Прочитать();
			
			Запрос.УстановитьПараметр("Ссылка", СтрокаДанных.Регистратор);
			ДанныеАналитики = Запрос.Выполнить().Выгрузить();
			
			//АналитикаУчетаПоПартнерам
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Соответствие.Получить(Запись.АналитикаУчетаПоПартнерам) = Неопределено Тогда
					ДанныеКлючаАналитики = ДанныеАналитики.НайтиСтроки(Новый Структура("АналитикаУчетаПоПартнерам",Запись.АналитикаУчетаПоПартнерам));
					Если ДанныеКлючаАналитики.Количество() > 0 Тогда
						Если ЗначениеЗаполнено(ДанныеКлючаАналитики[0].НоваяАналитикаУчетаПоПартнерам) Тогда
							НовыйКлюч = ДанныеКлючаАналитики[0].НоваяАналитикаУчетаПоПартнерам;
						Иначе
							НовыйКлюч = РегистрыСведений.АналитикаУчетаПоПартнерам.СоздатьКлючАналитики(ДанныеКлючаАналитики[0])
						КонецЕсли;
						Соответствие.Вставить(Запись.АналитикаУчетаПоПартнерам,НовыйКлюч);
						Запись.АналитикаУчетаПоПартнерам = НовыйКлюч;
					КонецЕсли;
				Иначе
					Запись.АналитикаУчетаПоПартнерам = Соответствие[Запись.АналитикаУчетаПоПартнерам];
				КонецЕсли;
			КонецЦикла;
			
			ПричинаИсключения = "Запись";
			Если НаборЗаписей.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), СтрокаДанных.Регистратор);
			
			Если ПричинаИсключения = "ПлохиеДанные" Тогда
				
				ОписаниеПроблемы = ОбновлениеИнформационнойБазыУТ.ПроблемаСДанными(
					СтрокаДанных.Регистратор, Рекомендация, ИнформацияОбОшибке());
				ИсключенияПриОбновлении.Добавить(ОписаниеПроблемы);
				
			ИначеЕсли ПричинаИсключения = "Запись" Тогда
				
				ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(
					ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
				ВызватьИсключение СтрСоединить(НСтр("ru = 'Не удалось обработать набор записей регистра накопления ""Расчеты по финансовым инструментам (НУ)"".';
													|en = 'Cannot process the ""Financial instruments AR/AP (TA)"" accumulation register record set.'"), Символы.ПС);
				
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано > 0 Тогда
		ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена =
		ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
