
&ИзменениеИКонтроль("ПолучитьДанныеДляПечатнойФормыМ15")
Функция Расш1_ПолучитьДанныеДляПечатнойФормыМ15(ПараметрыПечати, МассивОбъектов)

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Валюта КАК Валюта
	|
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|ИЗ
	|	Документ.ПередачаСырьяПереработчику КАК ДанныеДокументов
	|
	|ГДЕ
	|	ДанныеДокументов.Ссылка В (&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	Запрос.Выполнить();

	ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Передача.Ссылка                                       КАК Ссылка,
	|	Передача.Номер                                        КАК Номер,
	|	Передача.Дата                                         КАК Дата,
	|	Передача.Дата                                         КАК ДатаСоставления,
	|	Передача.Контрагент                                   КАК Контрагент,
	|	Передача.Организация                                  КАК Организация,
	|	Передача.Организация.Префикс                          КАК Префикс,
	|	Передача.Основание                                    КАК Основание,
	|	Передача.Склад                                        КАК Склад,
	|	Передача.Склад.Наименование                           КАК СкладНаименование,
	|	Передача.Подразделение                                КАК СтруктурноеПодразделение,
	|	Передача.БанковскийСчетОрганизации                    КАК БанковскийСчетОрганизации,
	|	Передача.Валюта                                       КАК Валюта,
	|	ЛОЖЬ                                                  КАК ЦенаВключаетНДС,
	|	ТаблицаОтветственныеЛица.РуководительНаименование     КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность        КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	Передача.Отпустил                        			  КАК Кладовщик,
	|	Передача.ОтпустилДолжность                            КАК ДолжностьКладовщика
	|ИЗ
	|	Документ.ПередачаСырьяПереработчику КАК Передача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО Передача.Ссылка = ДанныеДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО Передача.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка                                            КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура                                      КАК Номенклатура,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное                   КАК НоменклатураНаименование,
#Удаление
	|	ТаблицаТоваров.Номенклатура.Код                                  КАК НоменклатураКод,
#КонецУдаления
#Вставка
	|	ТаблицаТоваров.Номенклатура.Артикул                                  КАК НоменклатураКод,
#КонецВставки
	|	&ТекстЗапросаНаименованиеЕдиницыИзмерения 						 КАК ЕдиницаИзмеренияНаименование,
	|	&ТекстЗапросаКодЕдиницыИзмерения 								 КАК ЕдиницаИзмеренияКод,
	|	ВЫБОР КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) = 1 ТОГДА
	|		НЕОПРЕДЕЛЕНО
	|	ИНАЧЕ
	|		ТаблицаТоваров.Упаковка
	|	КОНЕЦ                                                            КАК Упаковка,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное                 КАК ХарактеристикаНаименование,
	|	ТаблицаТоваров.Серия.Наименование                                КАК СерияНаименование,
	|	СУММА(ТаблицаТоваров.КоличествоУпаковок)                         КАК Количество,
	|	0                                                                КАК КоличествоМест,
	|	ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.КоличествоУпаковок   КАК Цена,
	|	СУММА(ТаблицаТоваров.СуммаБезНДС)                                КАК СуммаБезНДС,
	|	0                                                                КАК СуммаНДС,
	|	СУММА(ТаблицаТоваров.СуммаБезНДС)                                КАК СуммаСНДС,
	|	МИНИМУМ(ТаблицаТоваров.НомерСтроки)                              КАК НомерСтроки,
	|
	|	ЛОЖЬ                                                             КАК ЭтоВозвратнаяТара
	|
	|ИЗ
	|	ПередачаСырьяПереработчикуТаблицаТоваров КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.ЭтоТовар
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное,
#Удаление
	|	ТаблицаТоваров.Номенклатура.Код,
#КонецУдаления
#Вставка
	|	ТаблицаТоваров.Номенклатура.Артикул,
#КонецВставки
	|	&ТекстЗапросаНаименованиеЕдиницыИзмерения,
	|	&ТекстЗапросаКодЕдиницыИзмерения,
	|	ВЫБОР КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) = 1 ТОГДА
	|		НЕОПРЕДЕЛЕНО
	|	ИНАЧЕ
	|		ТаблицаТоваров.Упаковка
	|	КОНЕЦ,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное,
	|	ТаблицаТоваров.Серия.Наименование,
	|	ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.КоличествоУпаковок
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|
	|ИТОГИ ПО
	|	Ссылка
	|";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ТаблицаТоваров.Упаковка",
			"ТаблицаТоваров.Номенклатура"));

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаНаименованиеЕдиницыИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Наименование",
			"ТаблицаТоваров.Упаковка",
			"ТаблицаТоваров.Номенклатура"));

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКодЕдиницыИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Код",
			"ТаблицаТоваров.Упаковка",
			"ТаблицаТоваров.Номенклатура"));

	МассивРезультатов = Запрос.ВыполнитьПакет();
	РезультатПоШапке = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[1];

	СтруктураДанныхДляПечати = Новый Структура(
		"РезультатПоШапке, РезультатПоТабличнойЧасти",
		РезультатПоШапке,
		РезультатПоТабличнойЧасти);

	Возврат СтруктураДанныхДляПечати;

КонецФункции
