
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ВстроеннаяПочтаИспользуется = ВстроеннаяПочтаКлиент.ВстроеннаяПочтаИспользуется();	

	Если Не ВстроеннаяПочтаИспользуется Тогда
		ТекстСообщения = НСтр("ru = 'Чтобы открыть историю переписки, включите персональную настройку ""Встроенная почта"".'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Предмет", ПараметрКоманды);
	ОткрытьФорму("Справочник.Файлы.Форма.ИсторияПереписки", 
		ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
