
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СброситьПопытки(Команда)
	
	СброситьПопыткиНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)
	
	ОбработатьНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СброситьПопыткиНаСервере()
	
	РаботаСАдреснойКнигойСлужебный.СброситьПопытки();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьНаСервере()
	
	РаботаСАдреснойКнигойСлужебный.ОбновлениеАдреснойКниги();
	
КонецПроцедуры

#КонецОбласти