&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

    // Проверяем, что параметр команды не пустой и содержит нужный тип
    Если ПараметрКоманды <> Неопределено И ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ПлановаяКалькуляция2_2") Тогда

        // Создаем структуру параметров для передачи в отчет 
		Параметры = Новый Структура;
		Параметры.Вставить("СформироватьПриОткрытии", Истина);  // Формируем при открытии, но можно переформировать по кнопке
		Параметры.Вставить("ДокументВладелец", ПараметрКоманды ); 
		ОткрытьФорму("Отчет.Расш1_Плановая_калькуляция_сквозная.Форма.ФормаОтчета", Параметры, 
                     ПараметрыВыполненияКоманды.Источник, 
                     ПараметрыВыполненияКоманды.Уникальность, 
                     ПараметрыВыполненияКоманды.Окно); 
    Иначе
        Сообщить("Параметр команды не установлен или имеет неверный тип.");
    КонецЕсли;

КонецПроцедуры
