#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ДляЗаданийКЗакрытиюМесяца") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	// В форме списка регистра заданий к закрытию месяца для выбора доступны только те значения перечисления,
	// которые поддерживаются в механизме закрытия месяца.
	// см. использование функции ЗакрытиеМесяцаСервер.ПроверитьНаличиеЗаданийКЗакрытиюМесяца().
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствИФинансовыхИнструментов);
	Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов);
	КонецЕсли;
	ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.РаспределениеРасходовПоНаправлениямДеятельности);
	ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.РаспределениеДоходовПоНаправлениямДеятельности);
	ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.РаспределениеНДС);
	//++ НЕ УТ
	ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.ФормированиеРезервовПодОбесценениеЗапасов);
	ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.ФормированиеРезервовПоСомнительнымДолгам);
	ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.ПризнаниеРасходовПоИсследованиямИРазработкам);
	ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.ОбесценениеВНА);
	ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.ЗакрытиеРасходовОтВыбытияОС);
	ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.АктуализацияПараметровУзловКомпонентовАмортизации);
	Если ПолучитьФункциональнуюОпцию("ИспользуетсяПередачаВАрендуСубарендуПоФСБУ25") Тогда
		ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.НачислениеПроцентовПоДоходнойАренде);
		ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.РасчетСтоимостиИнвестицииВАренду);
	КонецЕсли;
	//-- НЕ УТ
	Если ПолучитьФункциональнуюОпцию("УчетДисконтированнойКредиторскойЗадолженностиПоставщикам") Тогда
		ДанныеВыбора.Добавить(Справочники.ОперацииЗакрытияМесяца.РасчетПроцентныхРасходовДисконтирования);
	КонецЕсли;
	ЗакрытиеМесяцаЛокализация.ДополнитьДанныеВыбораОперацийЗакрытияМесяца(ДанныеВыбора);
	
	ДанныеВыбора.СортироватьПоЗначению();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает неиспользуемые операции закрытия месяца, по которым не должно быть записей в регистре ЗаданияКЗакрытиюМесяца.
// 
// Возвращаемое значение:
// Массив из СправочникСсылка.ОперацииЗакрытияМесяца - неиспользуемые операции
Функция НеиспользуемыеОперации() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.УдалитьОперацииЗакрытияМесяца.ПустаяСсылка());
	Результат.Добавить(Перечисления.УдалитьОперацииЗакрытияМесяца.УдалитьИсправлениеОшибокКорреспонденцииФинансовыхРегистров);
	Результат.Добавить(Перечисления.УдалитьОперацииЗакрытияМесяца.УдалитьОформлениеПередачМатериаловВПроизводство);
	Результат.Добавить(Перечисления.УдалитьОперацииЗакрытияМесяца.УдалитьПроверкаОшибокКорреспонденцииФинансовыхРегистров);
	
	Возврат Результат; 
	
КонецФункции

//++ Локализация

//++ НЕ УТ

// Возвращает операции закрытия месяца, используемые только организациями на УСН.
// 
// Возвращаемое значение:
// Массив из СправочникСсылка.ОперацииЗакрытияМесяца - операции для УСН
Функция ОперацииУСН() Экспорт

	Результат = Новый Массив;
	Результат.Добавить(Справочники.ОперацииЗакрытияМесяца.СторноДоходовКУДиР);
	Результат.Добавить(Справочники.ОперацииЗакрытияМесяца.ПризнаниеРасходовПриУСН);
	Результат.Добавить(Справочники.ОперацииЗакрытияМесяца.РасчетНалогаУСН);
	
	Возврат Результат; 
	
КонецФункции

//-- НЕ УТ

//-- Локализация

#КонецОбласти

#КонецЕсли
